TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{A955FC8F-DD62-468C-8CEC-7F5E7A3A0C22} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Sat Apr 14 15:10:00 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/LaunchPad/board_led.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\collector_cc1310lp\collector_cc1
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    4452                            .dwendtag $C$DW$T$846
    4453                    
    4454                    $C$DW$T$847     .dwtag  DW_TAG_typedef
    4455                            .dwattr $C$DW$T$847, DW_AT_name("ApiMac_MLMESubIE_t")
    4456                            .dwattr $C$DW$T$847, DW_AT_type(*$C$DW$T$846)
    4457                            .dwattr $C$DW$T$847, DW_AT_language(DW_LANG_C)
    4458                            .dwattr $C$DW$T$847, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicati
    4459                            .dwattr $C$DW$T$847, DW_AT_decl_line(0x43d)
    4460                            .dwattr $C$DW$T$847, DW_AT_decl_column(0x03)
    4461                    
    4462                    
    4463                    $C$DW$T$848     .dwtag  DW_TAG_enumeration_type
    4464                            .dwattr $C$DW$T$848, DW_AT_byte_size(0x01)
    4465                    $C$DW$412       .dwtag  DW_TAG_enumerator
    4466                            .dwattr $C$DW$412, DW_AT_name("ApiMac_wisunSubIE_USIE")
    4467                            .dwattr $C$DW$412, DW_AT_const_value(0x01)
    4468                            .dwattr $C$DW$412, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4469                            .dwattr $C$DW$412, DW_AT_decl_line(0x443)
    4470                            .dwattr $C$DW$412, DW_AT_decl_column(0x05)
    4471                    
    4472                    $C$DW$413       .dwtag  DW_TAG_enumerator
    4473                            .dwattr $C$DW$413, DW_AT_name("ApiMac_wisunSubIE_BSIE")
    4474                            .dwattr $C$DW$413, DW_AT_const_value(0x02)
    4475                            .dwattr $C$DW$413, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4476                            .dwattr $C$DW$413, DW_AT_decl_line(0x445)
    4477                            .dwattr $C$DW$413, DW_AT_decl_column(0x05)
    4478                    
    4479                    $C$DW$414       .dwtag  DW_TAG_enumerator
    4480                            .dwattr $C$DW$414, DW_AT_name("ApiMac_wisunSubIE_PANIE")
    4481                            .dwattr $C$DW$414, DW_AT_const_value(0x04)
    4482                            .dwattr $C$DW$414, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4483                            .dwattr $C$DW$414, DW_AT_decl_line(0x447)
    4484                            .dwattr $C$DW$414, DW_AT_decl_column(0x05)
    4485                    
    4486                    $C$DW$415       .dwtag  DW_TAG_enumerator
    4487                            .dwattr $C$DW$415, DW_AT_name("ApiMac_wisunSubIE_netNameIE")
    4488                            .dwattr $C$DW$415, DW_AT_const_value(0x05)
    4489                            .dwattr $C$DW$415, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4490                            .dwattr $C$DW$415, DW_AT_decl_line(0x449)
    4491                            .dwattr $C$DW$415, DW_AT_decl_column(0x05)
    4492                    
    4493                    $C$DW$416       .dwtag  DW_TAG_enumerator
    4494                            .dwattr $C$DW$416, DW_AT_name("ApiMac_wisunSubIE_PANVersionIE")
    4495                            .dwattr $C$DW$416, DW_AT_const_value(0x06)
    4496                            .dwattr $C$DW$416, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4497                            .dwattr $C$DW$416, DW_AT_decl_line(0x44b)
    4498                            .dwattr $C$DW$416, DW_AT_decl_column(0x05)
    4499                    
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{A955FC8F-DD62-468C-8CEC-7F5E7A3A0C22} PAGE   83

    4500                    $C$DW$417       .dwtag  DW_TAG_enumerator
    4501                            .dwattr $C$DW$417, DW_AT_name("ApiMac_wisunSubIE_GTKHashIE")
    4502                            .dwattr $C$DW$417, DW_AT_const_value(0x07)
    4503                            .dwattr $C$DW$417, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4504                            .dwattr $C$DW$417, DW_AT_decl_line(0x44d)
    4505                            .dwattr $C$DW$417, DW_AT_decl_column(0x05)
    4506                    
    4507                            .dwattr $C$DW$T$848, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicati
    4508                            .dwattr $C$DW$T$848, DW_AT_decl_line(0x441)
    4509                            .dwattr $C$DW$T$848, DW_AT_decl_column(0x01)
    4510                            .dwendtag $C$DW$T$848
    4511                    
    4512                    $C$DW$T$849     .dwtag  DW_TAG_typedef
    4513                            .dwattr $C$DW$T$849, DW_AT_name("ApiMac_wisunSubIE_t")
    4514                            .dwattr $C$DW$T$849, DW_AT_type(*$C$DW$T$848)
    4515                            .dwattr $C$DW$T$849, DW_AT_language(DW_LANG_C)
    4516                            .dwattr $C$DW$T$849, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicati
    4517                            .dwattr $C$DW$T$849, DW_AT_decl_line(0x44e)
    4518                            .dwattr $C$DW$T$849, DW_AT_decl_column(0x03)
    4519                    
    4520                    
    4521                    $C$DW$T$141     .dwtag  DW_TAG_structure_type
    4522                            .dwattr $C$DW$T$141, DW_AT_byte_size(0x02)
    4523                    $C$DW$418       .dwtag  DW_TAG_member
    4524                            .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$138)
    4525                            .dwattr $C$DW$418, DW_AT_name("state")
    4526                            .dwattr $C$DW$418, DW_AT_TI_symbol_name("state")
    4527                            .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4528                            .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4529                            .dwattr $C$DW$418, DW_AT_decl_file("../Application/LaunchPad/board_led.c")
    4530                            .dwattr $C$DW$418, DW_AT_decl_line(0x72)
    4531                            .dwattr $C$DW$418, DW_AT_decl_column(0x15)
    4532                    
    4533                    $C$DW$419       .dwtag  DW_TAG_member
    4534                            .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$140)
    4535                            .dwattr $C$DW$419, DW_AT_name("status")
    4536                            .dwattr $C$DW$419, DW_AT_TI_symbol_name("status")
    4537                            .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4538                            .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4539                            .dwattr $C$DW$419, DW_AT_decl_file("../Application/LaunchPad/board_led.c")
    4540                            .dwattr $C$DW$419, DW_AT_decl_line(0x73)
    4541                            .dwattr $C$DW$419, DW_AT_decl_column(0x11)
    4542                    
    4543                            .dwattr $C$DW$T$141, DW_AT_decl_file("../Application/LaunchPad/board_led.c")
    4544                            .dwattr $C$DW$T$141, DW_AT_decl_line(0x71)
    4545                            .dwattr $C$DW$T$141, DW_AT_decl_column(0x01)
    4546                            .dwendtag $C$DW$T$141
    4547                    
    4548                    
    4549                    $C$DW$T$227     .dwtag  DW_TAG_array_type
    4550                            .dwattr $C$DW$T$227, DW_AT_type(*$C$DW$T$141)
    4551                            .dwattr $C$DW$T$227, DW_AT_language(DW_LANG_C)
    4552                            .dwattr $C$DW$T$227, DW_AT_byte_size(0x0e)
    4553                    $C$DW$420       .dwtag  DW_TAG_subrange_type
    4554                            .dwattr $C$DW$420, DW_AT_upper_bound(0x06)
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{A955FC8F-DD62-468C-8CEC-7F5E7A3A0C22} PAGE   84

    4555                    
    4556                            .dwendtag $C$DW$T$227
    4557                    
    4558                    $C$DW$T$852     .dwtag  DW_TAG_typedef
    4559                            .dwattr $C$DW$T$852, DW_AT_name("board_led_status_t")
    4560                            .dwattr $C$DW$T$852, DW_AT_type(*$C$DW$T$141)
    4561                            .dwattr $C$DW$T$852, DW_AT_language(DW_LANG_C)
    4562                            .dwattr $C$DW$T$852, DW_AT_decl_file("../Application/LaunchPad/board_led.c")
    4563                            .dwattr $C$DW$T$852, DW_AT_decl_line(0x74)
    4564                            .dwattr $C$DW$T$852, DW_AT_decl_column(0x03)
    4565                    
    4566                    
    4567                    $C$DW$T$853     .dwtag  DW_TAG_array_type
    4568                            .dwattr $C$DW$T$853, DW_AT_type(*$C$DW$T$852)
    4569                            .dwattr $C$DW$T$853, DW_AT_language(DW_LANG_C)
    4570                            .dwattr $C$DW$T$853, DW_AT_byte_size(0x0e)
    4571                    $C$DW$421       .dwtag  DW_TAG_subrange_type
    4572                            .dwattr $C$DW$421, DW_AT_upper_bound(0x06)
    4573                    
    4574                            .dwendtag $C$DW$T$853
    4575                    
    4576                    
    4577                    $C$DW$T$142     .dwtag  DW_TAG_structure_type
    4578                            .dwattr $C$DW$T$142, DW_AT_byte_size(0x08)
    4579                    $C$DW$422       .dwtag  DW_TAG_member
    4580                            .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$10)
    4581                            .dwattr $C$DW$422, DW_AT_name("quot")
    4582                            .dwattr $C$DW$422, DW_AT_TI_symbol_name("quot")
    4583                            .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4584                            .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4585                            .dwattr $C$DW$422, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    4586                            .dwattr $C$DW$422, DW_AT_decl_line(0x5c)
    4587                            .dwattr $C$DW$422, DW_AT_decl_column(0x16)
    4588                    
    4589                    $C$DW$423       .dwtag  DW_TAG_member
    4590                            .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$10)
    4591                            .dwattr $C$DW$423, DW_AT_name("rem")
    4592                            .dwattr $C$DW$423, DW_AT_TI_symbol_name("rem")
    4593                            .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4594                            .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4595                            .dwattr $C$DW$423, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    4596                            .dwattr $C$DW$423, DW_AT_decl_line(0x5c)
    4597                            .dwattr $C$DW$423, DW_AT_decl_column(0x1c)
    4598                    
    4599                            .dwattr $C$DW$T$142, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    4600                            .dwattr $C$DW$T$142, DW_AT_decl_line(0x5c)
    4601                            .dwattr $C$DW$T$142, DW_AT_decl_column(0x10)
    4602                            .dwendtag $C$DW$T$142
    4603                    
    4604                    $C$DW$T$854     .dwtag  DW_TAG_typedef
    4605                            .dwattr $C$DW$T$854, DW_AT_name("div_t")
    4606                            .dwattr $C$DW$T$854, DW_AT_type(*$C$DW$T$142)
    4607                            .dwattr $C$DW$T$854, DW_AT_language(DW_LANG_C)
    4608                            .dwattr $C$DW$T$854, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    4609                            .dwattr $C$DW$T$854, DW_AT_decl_line(0x5c)
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{A955FC8F-DD62-468C-8CEC-7F5E7A3A0C22} PAGE   85

    4610                            .dwattr $C$DW$T$854, DW_AT_decl_column(0x23)
    4611                    
    4612                    
    4613                    $C$DW$T$143     .dwtag  DW_TAG_structure_type
    4614                            .dwattr $C$DW$T$143, DW_AT_byte_size(0x08)
    4615                    $C$DW$424       .dwtag  DW_TAG_member
    4616                            .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$10)
    4617                            .dwattr $C$DW$424, DW_AT_name("quot")
    4618                            .dwattr $C$DW$424, DW_AT_TI_symbol_name("quot")
    4619                            .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4620                            .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4621                            .dwattr $C$DW$424, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    4622                            .dwattr $C$DW$424, DW_AT_decl_line(0x5e)
    4623                            .dwattr $C$DW$424, DW_AT_decl_column(0x16)
    4624                    
    4625                    $C$DW$425       .dwtag  DW_TAG_member
    4626                            .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$10)
    4627                            .dwattr $C$DW$425, DW_AT_name("rem")
    4628                            .dwattr $C$DW$425, DW_AT_TI_symbol_name("rem")
    4629                            .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4630                            .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4631                            .dwattr $C$DW$425, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    4632                            .dwattr $C$DW$425, DW_AT_decl_line(0x5e)
    4633                            .dwattr $C$DW$425, DW_AT_decl_column(0x1c)
    4634                    
    4635                            .dwattr $C$DW$T$143, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    4636                            .dwattr $C$DW$T$143, DW_AT_decl_line(0x5e)
    4637                            .dwattr $C$DW$T$143, DW_AT_decl_column(0x10)
    4638                            .dwendtag $C$DW$T$143
    4639                    
    4640                    $C$DW$T$855     .dwtag  DW_TAG_typedef
    4641                            .dwattr $C$DW$T$855, DW_AT_name("ldiv_t")
    4642                            .dwattr $C$DW$T$855, DW_AT_type(*$C$DW$T$143)
    4643                            .dwattr $C$DW$T$855, DW_AT_language(DW_LANG_C)
    4644                            .dwattr $C$DW$T$855, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    4645                            .dwattr $C$DW$T$855, DW_AT_decl_line(0x5e)
    4646                            .dwattr $C$DW$T$855, DW_AT_decl_column(0x23)
    4647                    
    4648                    
    4649                    $C$DW$T$144     .dwtag  DW_TAG_structure_type
    4650                            .dwattr $C$DW$T$144, DW_AT_byte_size(0x10)
    4651                    $C$DW$426       .dwtag  DW_TAG_member
    4652                            .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$14)
    4653                            .dwattr $C$DW$426, DW_AT_name("quot")
    4654                            .dwattr $C$DW$426, DW_AT_TI_symbol_name("quot")
    4655                            .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4656                            .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4657                            .dwattr $C$DW$426, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    4658                            .dwattr $C$DW$426, DW_AT_decl_line(0x61)
    4659                            .dwattr $C$DW$426, DW_AT_decl_column(0x1c)
    4660                    
    4661                    $C$DW$427       .dwtag  DW_TAG_member
    4662                            .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$14)
    4663                            .dwattr $C$DW$427, DW_AT_name("rem")
    4664                            .dwattr $C$DW$427, DW_AT_TI_symbol_name("rem")
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{A955FC8F-DD62-468C-8CEC-7F5E7A3A0C22} PAGE   86

    4665                            .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4666                            .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4667                            .dwattr $C$DW$427, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    4668                            .dwattr $C$DW$427, DW_AT_decl_line(0x61)
    4669                            .dwattr $C$DW$427, DW_AT_decl_column(0x22)
    4670                    
    4671                            .dwattr $C$DW$T$144, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    4672                            .dwattr $C$DW$T$144, DW_AT_decl_line(0x61)
    4673                            .dwattr $C$DW$T$144, DW_AT_decl_column(0x10)
    4674                            .dwendtag $C$DW$T$144
    4675                    
    4676                    $C$DW$T$856     .dwtag  DW_TAG_typedef
    4677                            .dwattr $C$DW$T$856, DW_AT_name("lldiv_t")
    4678                            .dwattr $C$DW$T$856, DW_AT_type(*$C$DW$T$144)
    4679                            .dwattr $C$DW$T$856, DW_AT_language(DW_LANG_C)
    4680                            .dwattr $C$DW$T$856, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    4681                            .dwattr $C$DW$T$856, DW_AT_decl_line(0x61)
    4682                            .dwattr $C$DW$T$856, DW_AT_decl_column(0x29)
    4683                    
    4684                    
    4685                    $C$DW$T$149     .dwtag  DW_TAG_structure_type
    4686                            .dwattr $C$DW$T$149, DW_AT_byte_size(0x08)
    4687                    $C$DW$428       .dwtag  DW_TAG_member
    4688                            .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$147)
    4689                            .dwattr $C$DW$428, DW_AT_name("pointerStack")
    4690                            .dwattr $C$DW$428, DW_AT_TI_symbol_name("pointerStack")
    4691                            .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4692                            .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4693                            .dwattr $C$DW$428, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4694                            .dwattr $C$DW$428, DW_AT_decl_line(0x3f5)
    4695                            .dwattr $C$DW$428, DW_AT_decl_column(0x16)
    4696                    
    4697                    $C$DW$429       .dwtag  DW_TAG_member
    4698                            .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$148)
    4699                            .dwattr $C$DW$429, DW_AT_name("directAPI")
    4700                            .dwattr $C$DW$429, DW_AT_TI_symbol_name("directAPI")
    4701                            .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4702                            .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4703                            .dwattr $C$DW$429, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4704                            .dwattr $C$DW$429, DW_AT_decl_line(0x3f6)
    4705                            .dwattr $C$DW$429, DW_AT_decl_column(0x15)
    4706                    
    4707                            .dwattr $C$DW$T$149, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    4708                            .dwattr $C$DW$T$149, DW_AT_decl_line(0x3f4)
    4709                            .dwattr $C$DW$T$149, DW_AT_decl_column(0x01)
    4710                            .dwendtag $C$DW$T$149
    4711                    
    4712                    $C$DW$T$151     .dwtag  DW_TAG_typedef
    4713                            .dwattr $C$DW$T$151, DW_AT_name("icall_directAPIMsg_t")
    4714                            .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$149)
    4715                            .dwattr $C$DW$T$151, DW_AT_language(DW_LANG_C)
    4716                            .dwattr $C$DW$T$151, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    4717                            .dwattr $C$DW$T$151, DW_AT_decl_line(0x3f7)
    4718                            .dwattr $C$DW$T$151, DW_AT_decl_column(0x03)
    4719                    
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{A955FC8F-DD62-468C-8CEC-7F5E7A3A0C22} PAGE   87

    4720                    
    4721                    $C$DW$T$152     .dwtag  DW_TAG_structure_type
    4722                            .dwattr $C$DW$T$152, DW_AT_byte_size(0x14)
    4723                    $C$DW$430       .dwtag  DW_TAG_member
    4724                            .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$150)
    4725                            .dwattr $C$DW$430, DW_AT_name("hdr")
    4726                            .dwattr $C$DW$430, DW_AT_TI_symbol_name("hdr")
    4727                            .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4728                            .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4729                            .dwattr $C$DW$430, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4730                            .dwattr $C$DW$430, DW_AT_decl_line(0x3fb)
    4731                            .dwattr $C$DW$430, DW_AT_decl_column(0x10)
    4732                    
    4733                    $C$DW$431       .dwtag  DW_TAG_member
    4734                            .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$151)
    4735                            .dwattr $C$DW$431, DW_AT_name("msg")
    4736                            .dwattr $C$DW$431, DW_AT_TI_symbol_name("msg")
    4737                            .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4738                            .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4739                            .dwattr $C$DW$431, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4740                            .dwattr $C$DW$431, DW_AT_decl_line(0x3fc)
    4741                            .dwattr $C$DW$431, DW_AT_decl_column(0x1a)
    4742                    
    4743                            .dwattr $C$DW$T$152, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    4744                            .dwattr $C$DW$T$152, DW_AT_decl_line(0x3fa)
    4745                            .dwattr $C$DW$T$152, DW_AT_decl_column(0x01)
    4746                            .dwendtag $C$DW$T$152
    4747                    
    4748                    $C$DW$T$857     .dwtag  DW_TAG_typedef
    4749                            .dwattr $C$DW$T$857, DW_AT_name("icallLiteMsg_t")
    4750                            .dwattr $C$DW$T$857, DW_AT_type(*$C$DW$T$152)
    4751                            .dwattr $C$DW$T$857, DW_AT_language(DW_LANG_C)
    4752                            .dwattr $C$DW$T$857, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    4753                            .dwattr $C$DW$T$857, DW_AT_decl_line(0x3fd)
    4754                            .dwattr $C$DW$T$857, DW_AT_decl_column(0x03)
    4755                    
    4756                    
    4757                    $C$DW$T$193     .dwtag  DW_TAG_structure_type
    4758                            .dwattr $C$DW$T$193, DW_AT_byte_size(0x4c)
    4759                    $C$DW$432       .dwtag  DW_TAG_member
    4760                            .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$157)
    4761                            .dwattr $C$DW$432, DW_AT_name("Crc32")
    4762                            .dwattr $C$DW$432, DW_AT_TI_symbol_name("Crc32")
    4763                            .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4764                            .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4765                            .dwattr $C$DW$432, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4766                            .dwattr $C$DW$432, DW_AT_decl_line(0x76)
    4767                            .dwattr $C$DW$432, DW_AT_decl_column(0x25)
    4768                    
    4769                    $C$DW$433       .dwtag  DW_TAG_member
    4770                            .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$160)
    4771                            .dwattr $C$DW$433, DW_AT_name("FlashGetSize")
    4772                            .dwattr $C$DW$433, DW_AT_TI_symbol_name("FlashGetSize")
    4773                            .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4774                            .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{A955FC8F-DD62-468C-8CEC-7F5E7A3A0C22} PAGE   88

    4775                            .dwattr $C$DW$433, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4776                            .dwattr $C$DW$433, DW_AT_decl_line(0x77)
    4777                            .dwattr $C$DW$433, DW_AT_decl_column(0x25)
    4778                    
    4779                    $C$DW$434       .dwtag  DW_TAG_member
    4780                            .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$161)
    4781                            .dwattr $C$DW$434, DW_AT_name("GetChipId")
    4782                            .dwattr $C$DW$434, DW_AT_TI_symbol_name("GetChipId")
    4783                            .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4784                            .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4785                            .dwattr $C$DW$434, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4786                            .dwattr $C$DW$434, DW_AT_decl_line(0x78)
    4787                            .dwattr $C$DW$434, DW_AT_decl_column(0x25)
    4788                    
    4789                    $C$DW$435       .dwtag  DW_TAG_member
    4790                            .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$164)
    4791                            .dwattr $C$DW$435, DW_AT_name("ReservedLocation1")
    4792                            .dwattr $C$DW$435, DW_AT_TI_symbol_name("ReservedLocation1")
    4793                            .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4794                            .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4795                            .dwattr $C$DW$435, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4796                            .dwattr $C$DW$435, DW_AT_decl_line(0x79)
    4797                            .dwattr $C$DW$435, DW_AT_decl_column(0x25)
    4798                    
    4799                    $C$DW$436       .dwtag  DW_TAG_member
    4800                            .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$165)
    4801                            .dwattr $C$DW$436, DW_AT_name("ReservedLocation2")
    4802                            .dwattr $C$DW$436, DW_AT_TI_symbol_name("ReservedLocation2")
    4803                            .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4804                            .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4805                            .dwattr $C$DW$436, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4806                            .dwattr $C$DW$436, DW_AT_decl_line(0x7a)
    4807                            .dwattr $C$DW$436, DW_AT_decl_column(0x25)
    4808                    
    4809                    $C$DW$437       .dwtag  DW_TAG_member
    4810                            .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$166)
    4811                            .dwattr $C$DW$437, DW_AT_name("ReservedLocation3")
    4812                            .dwattr $C$DW$437, DW_AT_TI_symbol_name("ReservedLocation3")
    4813                            .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4814                            .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4815                            .dwattr $C$DW$437, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4816                            .dwattr $C$DW$437, DW_AT_decl_line(0x7b)
    4817                            .dwattr $C$DW$437, DW_AT_decl_column(0x25)
    4818                    
    4819                    $C$DW$438       .dwtag  DW_TAG_member
    4820                            .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$169)
    4821                            .dwattr $C$DW$438, DW_AT_name("ResetDevice")
    4822                            .dwattr $C$DW$438, DW_AT_TI_symbol_name("ResetDevice")
    4823                            .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4824                            .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4825                            .dwattr $C$DW$438, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4826                            .dwattr $C$DW$438, DW_AT_decl_line(0x7c)
    4827                            .dwattr $C$DW$438, DW_AT_decl_column(0x25)
    4828                    
    4829                    $C$DW$439       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{A955FC8F-DD62-468C-8CEC-7F5E7A3A0C22} PAGE   89

    4830                            .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$174)
    4831                            .dwattr $C$DW$439, DW_AT_name("Fletcher32")
    4832                            .dwattr $C$DW$439, DW_AT_TI_symbol_name("Fletcher32")
    4833                            .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4834                            .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4835                            .dwattr $C$DW$439, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4836                            .dwattr $C$DW$439, DW_AT_decl_line(0x7d)
    4837                            .dwattr $C$DW$439, DW_AT_decl_column(0x25)
    4838                    
    4839                    $C$DW$440       .dwtag  DW_TAG_member
    4840                            .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$178)
    4841                            .dwattr $C$DW$440, DW_AT_name("MinValue")
    4842                            .dwattr $C$DW$440, DW_AT_TI_symbol_name("MinValue")
    4843                            .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4844                            .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4845                            .dwattr $C$DW$440, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4846                            .dwattr $C$DW$440, DW_AT_decl_line(0x7e)
    4847                            .dwattr $C$DW$440, DW_AT_decl_column(0x25)
    4848                    
    4849                    $C$DW$441       .dwtag  DW_TAG_member
    4850                            .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$179)
    4851                            .dwattr $C$DW$441, DW_AT_name("MaxValue")
    4852                            .dwattr $C$DW$441, DW_AT_TI_symbol_name("MaxValue")
    4853                            .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4854                            .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4855                            .dwattr $C$DW$441, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4856                            .dwattr $C$DW$441, DW_AT_decl_line(0x7f)
    4857                            .dwattr $C$DW$441, DW_AT_decl_column(0x25)
    4858                    
    4859                    $C$DW$442       .dwtag  DW_TAG_member
    4860                            .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$180)
    4861                            .dwattr $C$DW$442, DW_AT_name("MeanValue")
    4862                            .dwattr $C$DW$442, DW_AT_TI_symbol_name("MeanValue")
    4863                            .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4864                            .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4865                            .dwattr $C$DW$442, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4866                            .dwattr $C$DW$442, DW_AT_decl_line(0x80)
    4867                            .dwattr $C$DW$442, DW_AT_decl_column(0x25)
    4868                    
    4869                    $C$DW$443       .dwtag  DW_TAG_member
    4870                            .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$181)
    4871                            .dwattr $C$DW$443, DW_AT_name("StandDeviationValue")
    4872                            .dwattr $C$DW$443, DW_AT_TI_symbol_name("StandDeviationValue")
    4873                            .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4874                            .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4875                            .dwattr $C$DW$443, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4876                            .dwattr $C$DW$443, DW_AT_decl_line(0x81)
    4877                            .dwattr $C$DW$443, DW_AT_decl_column(0x25)
    4878                    
    4879                    $C$DW$444       .dwtag  DW_TAG_member
    4880                            .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$184)
    4881                            .dwattr $C$DW$444, DW_AT_name("ReservedLocation4")
    4882                            .dwattr $C$DW$444, DW_AT_TI_symbol_name("ReservedLocation4")
    4883                            .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4884                            .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{A955FC8F-DD62-468C-8CEC-7F5E7A3A0C22} PAGE   90

    4885                            .dwattr $C$DW$444, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4886                            .dwattr $C$DW$444, DW_AT_decl_line(0x82)
    4887                            .dwattr $C$DW$444, DW_AT_decl_column(0x25)
    4888                    
    4889                    $C$DW$445       .dwtag  DW_TAG_member
    4890                            .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$185)
    4891                            .dwattr $C$DW$445, DW_AT_name("ReservedLocation5")
    4892                            .dwattr $C$DW$445, DW_AT_TI_symbol_name("ReservedLocation5")
    4893                            .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4894                            .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4895                            .dwattr $C$DW$445, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4896                            .dwattr $C$DW$445, DW_AT_decl_line(0x83)
    4897                            .dwattr $C$DW$445, DW_AT_decl_column(0x25)
    4898                    
    4899                    $C$DW$446       .dwtag  DW_TAG_member
    4900                            .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$186)
    4901                            .dwattr $C$DW$446, DW_AT_name("HFSourceSafeSwitch")
    4902                            .dwattr $C$DW$446, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    4903                            .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4904                            .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4905                            .dwattr $C$DW$446, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4906                            .dwattr $C$DW$446, DW_AT_decl_line(0x84)
    4907                            .dwattr $C$DW$446, DW_AT_decl_column(0x25)
    4908                    
    4909                    $C$DW$447       .dwtag  DW_TAG_member
    4910                            .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$189)
    4911                            .dwattr $C$DW$447, DW_AT_name("SelectCompAInput")
    4912                            .dwattr $C$DW$447, DW_AT_TI_symbol_name("SelectCompAInput")
    4913                            .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4914                            .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4915                            .dwattr $C$DW$447, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4916                            .dwattr $C$DW$447, DW_AT_decl_line(0x85)
    4917                            .dwattr $C$DW$447, DW_AT_decl_column(0x25)
    4918                    
    4919                    $C$DW$448       .dwtag  DW_TAG_member
    4920                            .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$190)
    4921                            .dwattr $C$DW$448, DW_AT_name("SelectCompARef")
    4922                            .dwattr $C$DW$448, DW_AT_TI_symbol_name("SelectCompARef")
    4923                            .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4924                            .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4925                            .dwattr $C$DW$448, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4926                            .dwattr $C$DW$448, DW_AT_decl_line(0x86)
    4927                            .dwattr $C$DW$448, DW_AT_decl_column(0x25)
    4928                    
    4929                    $C$DW$449       .dwtag  DW_TAG_member
    4930                            .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$191)
    4931                            .dwattr $C$DW$449, DW_AT_name("SelectADCCompBInput")
    4932                            .dwattr $C$DW$449, DW_AT_TI_symbol_name("SelectADCCompBInput")
    4933                            .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4934                            .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4935                            .dwattr $C$DW$449, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4936                            .dwattr $C$DW$449, DW_AT_decl_line(0x87)
    4937                            .dwattr $C$DW$449, DW_AT_decl_column(0x25)
    4938                    
    4939                    $C$DW$450       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{A955FC8F-DD62-468C-8CEC-7F5E7A3A0C22} PAGE   91

    4940                            .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$192)
    4941                            .dwattr $C$DW$450, DW_AT_name("SelectCompBRef")
    4942                            .dwattr $C$DW$450, DW_AT_TI_symbol_name("SelectCompBRef")
    4943                            .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4944                            .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4945                            .dwattr $C$DW$450, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4946                            .dwattr $C$DW$450, DW_AT_decl_line(0x88)
    4947                            .dwattr $C$DW$450, DW_AT_decl_column(0x25)
    4948                    
    4949                            .dwattr $C$DW$T$193, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    4950                            .dwattr $C$DW$T$193, DW_AT_decl_line(0x75)
    4951                            .dwattr $C$DW$T$193, DW_AT_decl_column(0x01)
    4952                            .dwendtag $C$DW$T$193
    4953                    
    4954                    $C$DW$T$858     .dwtag  DW_TAG_typedef
    4955                            .dwattr $C$DW$T$858, DW_AT_name("HARD_API_T")
    4956                            .dwattr $C$DW$T$858, DW_AT_type(*$C$DW$T$193)
    4957                            .dwattr $C$DW$T$858, DW_AT_language(DW_LANG_C)
    4958                            .dwattr $C$DW$T$858, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    4959                            .dwattr $C$DW$T$858, DW_AT_decl_line(0x89)
    4960                            .dwattr $C$DW$T$858, DW_AT_decl_column(0x03)
    4961                    
    4962                    
    4963                    $C$DW$T$196     .dwtag  DW_TAG_structure_type
    4964                            .dwattr $C$DW$T$196, DW_AT_byte_size(0x08)
    4965                    $C$DW$451       .dwtag  DW_TAG_member
    4966                            .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$10)
    4967                            .dwattr $C$DW$451, DW_AT_name("length")
    4968                            .dwattr $C$DW$451, DW_AT_TI_symbol_name("length")
    4969                            .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4970                            .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4971                            .dwattr $C$DW$451, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    4972                            .dwattr $C$DW$451, DW_AT_decl_line(0x165)
    4973                            .dwattr $C$DW$451, DW_AT_decl_column(0x16)
    4974                    
    4975                    $C$DW$452       .dwtag  DW_TAG_member
    4976                            .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$195)
    4977                            .dwattr $C$DW$452, DW_AT_name("elem")
    4978                            .dwattr $C$DW$452, DW_AT_TI_symbol_name("elem")
    4979                            .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4980                            .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4981                            .dwattr $C$DW$452, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    4982                            .dwattr $C$DW$452, DW_AT_decl_line(0x165)
    4983                            .dwattr $C$DW$452, DW_AT_decl_column(0x3a)
    4984                    
    4985                            .dwattr $C$DW$T$196, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    4986                            .dwattr $C$DW$T$196, DW_AT_decl_line(0x165)
    4987                            .dwattr $C$DW$T$196, DW_AT_decl_column(0x10)
    4988                            .dwendtag $C$DW$T$196
    4989                    
    4990                    $C$DW$T$859     .dwtag  DW_TAG_typedef
    4991                            .dwattr $C$DW$T$859, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
    4992                            .dwattr $C$DW$T$859, DW_AT_type(*$C$DW$T$196)
    4993                            .dwattr $C$DW$T$859, DW_AT_language(DW_LANG_C)
    4994                            .dwattr $C$DW$T$859, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{A955FC8F-DD62-468C-8CEC-7F5E7A3A0C22} PAGE   92

    4995                            .dwattr $C$DW$T$859, DW_AT_decl_line(0x165)
    4996                            .dwattr $C$DW$T$859, DW_AT_decl_column(0x42)
    4997                    
    4998                    
    4999                    $C$DW$T$199     .dwtag  DW_TAG_structure_type
    5000                            .dwattr $C$DW$T$199, DW_AT_byte_size(0x08)
    5001                    $C$DW$453       .dwtag  DW_TAG_member
    5002                            .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$10)
    5003                            .dwattr $C$DW$453, DW_AT_name("length")
    5004                            .dwattr $C$DW$453, DW_AT_TI_symbol_name("length")
    5005                            .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5006                            .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    5007                            .dwattr $C$DW$453, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    5008                            .dwattr $C$DW$453, DW_AT_decl_line(0x166)
    5009                            .dwattr $C$DW$453, DW_AT_decl_column(0x16)
    5010                    
    5011                    $C$DW$454       .dwtag  DW_TAG_member
    5012                            .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$198)
    5013                            .dwattr $C$DW$454, DW_AT_name("elem")
    5014                            .dwattr $C$DW$454, DW_AT_TI_symbol_name("elem")
    5015                            .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5016                            .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    5017                            .dwattr $C$DW$454, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    5018                            .dwattr $C$DW$454, DW_AT_decl_line(0x166)
    5019                            .dwattr $C$DW$454, DW_AT_decl_column(0x40)
    5020                    
    5021                            .dwattr $C$DW$T$199, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    5022                            .dwattr $C$DW$T$199, DW_AT_decl_line(0x166)
    5023                            .dwattr $C$DW$T$199, DW_AT_decl_column(0x10)
    5024                            .dwendtag $C$DW$T$199
    5025                    
    5026                    $C$DW$T$860     .dwtag  DW_TAG_typedef
    5027                            .dwattr $C$DW$T$860, DW_AT_name("__CARRAY1_ti_sysbios_knl_Swi_hooks")
    5028                            .dwattr $C$DW$T$860, DW_AT_type(*$C$DW$T$199)
    5029                            .dwattr $C$DW$T$860, DW_AT_language(DW_LANG_C)
    5030                            .dwattr $C$DW$T$860, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    5031                            .dwattr $C$DW$T$860, DW_AT_decl_line(0x166)
    5032                            .dwattr $C$DW$T$860, DW_AT_decl_column(0x48)
    5033                    
    5034                    $C$DW$T$861     .dwtag  DW_TAG_typedef
    5035                            .dwattr $C$DW$T$861, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
    5036                            .dwattr $C$DW$T$861, DW_AT_type(*$C$DW$T$860)
    5037                            .dwattr $C$DW$T$861, DW_AT_language(DW_LANG_C)
    5038                            .dwattr $C$DW$T$861, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    5039                            .dwattr $C$DW$T$861, DW_AT_decl_line(0x168)
    5040                            .dwattr $C$DW$T$861, DW_AT_decl_column(0x2c)
    5041                    
    5042                    $C$DW$T$862     .dwtag  DW_TAG_typedef
    5043                            .dwattr $C$DW$T$862, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
    5044                            .dwattr $C$DW$T$862, DW_AT_type(*$C$DW$T$860)
    5045                            .dwattr $C$DW$T$862, DW_AT_language(DW_LANG_C)
    5046                            .dwattr $C$DW$T$862, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    5047                            .dwattr $C$DW$T$862, DW_AT_decl_line(0x167)
    5048                            .dwattr $C$DW$T$862, DW_AT_decl_column(0x2c)
    5049                    
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{A955FC8F-DD62-468C-8CEC-7F5E7A3A0C22} PAGE   93

    5050                    
    5051                    $C$DW$T$202     .dwtag  DW_TAG_structure_type
    5052                            .dwattr $C$DW$T$202, DW_AT_byte_size(0x0a)
    5053                    $C$DW$455       .dwtag  DW_TAG_member
    5054                            .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$219)
    5055                            .dwattr $C$DW$455, DW_AT_name("addr")
    5056                            .dwattr $C$DW$455, DW_AT_TI_symbol_name("addr")
    5057                            .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5058                            .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    5059                            .dwattr $C$DW$455, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5060                            .dwattr $C$DW$455, DW_AT_decl_line(0x4a7)
    5061                            .dwattr $C$DW$455, DW_AT_decl_column(0x07)
    5062                    
    5063                    $C$DW$456       .dwtag  DW_TAG_member
    5064                            .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$201)
    5065                            .dwattr $C$DW$456, DW_AT_name("addrMode")
    5066                            .dwattr $C$DW$456, DW_AT_TI_symbol_name("addrMode")
    5067                            .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5068                            .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    5069                            .dwattr $C$DW$456, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5070                            .dwattr $C$DW$456, DW_AT_decl_line(0x4aa)
    5071                            .dwattr $C$DW$456, DW_AT_decl_column(0x17)
    5072                    
    5073                            .dwattr $C$DW$T$202, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicati
    5074                            .dwattr $C$DW$T$202, DW_AT_decl_line(0x49c)
    5075                            .dwattr $C$DW$T$202, DW_AT_decl_column(0x01)
    5076                            .dwendtag $C$DW$T$202
    5077                    
    5078                    $C$DW$T$395     .dwtag  DW_TAG_typedef
    5079                            .dwattr $C$DW$T$395, DW_AT_name("ApiMac_sAddr_t")
    5080                            .dwattr $C$DW$T$395, DW_AT_type(*$C$DW$T$202)
    5081                            .dwattr $C$DW$T$395, DW_AT_language(DW_LANG_C)
    5082                            .dwattr $C$DW$T$395, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicati
    5083                            .dwattr $C$DW$T$395, DW_AT_decl_line(0x4ab)
    5084                            .dwattr $C$DW$T$395, DW_AT_decl_column(0x03)
    5085                    
    5086                    
    5087                    $C$DW$T$206     .dwtag  DW_TAG_structure_type
    5088                            .dwattr $C$DW$T$206, DW_AT_byte_size(0x40)
    5089                    $C$DW$457       .dwtag  DW_TAG_member
    5090                            .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$204)
    5091                            .dwattr $C$DW$457, DW_AT_name("beaconType")
    5092                            .dwattr $C$DW$457, DW_AT_TI_symbol_name("beaconType")
    5093                            .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5094                            .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    5095                            .dwattr $C$DW$457, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5096                            .dwattr $C$DW$457, DW_AT_decl_line(0x848)
    5097                            .dwattr $C$DW$457, DW_AT_decl_column(0x19)
    5098                    
    5099                    $C$DW$458       .dwtag  DW_TAG_member
    5100                            .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$153)
    5101                            .dwattr $C$DW$458, DW_AT_name("bsn")
    5102                            .dwattr $C$DW$458, DW_AT_TI_symbol_name("bsn")
    5103                            .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5104                            .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{A955FC8F-DD62-468C-8CEC-7F5E7A3A0C22} PAGE   94

    5105                            .dwattr $C$DW$458, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5106                            .dwattr $C$DW$458, DW_AT_decl_line(0x84a)
    5107                            .dwattr $C$DW$458, DW_AT_decl_column(0x0d)
    5108                    
    5109                    $C$DW$459       .dwtag  DW_TAG_member
    5110                            .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$205)
    5111                            .dwattr $C$DW$459, DW_AT_name("panDesc")
    5112                            .dwattr $C$DW$459, DW_AT_TI_symbol_name("panDesc")
    5113                            .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5114                            .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    5115                            .dwattr $C$DW$459, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5116                            .dwattr $C$DW$459, DW_AT_decl_line(0x84c)
    5117                            .dwattr $C$DW$459, DW_AT_decl_column(0x16)
    5118                    
    5119                    $C$DW$460       .dwtag  DW_TAG_member
    5120                            .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$222)
    5121                            .dwattr $C$DW$460, DW_AT_name("beaconData")
    5122                            .dwattr $C$DW$460, DW_AT_TI_symbol_name("beaconData")
    5123                            .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5124                            .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    5125                            .dwattr $C$DW$460, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5126                            .dwattr $C$DW$460, DW_AT_decl_line(0x857)
    5127                            .dwattr $C$DW$460, DW_AT_decl_column(0x07)
    5128                    
    5129                            .dwattr $C$DW$T$206, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicati
    5130                            .dwattr $C$DW$T$206, DW_AT_decl_line(0x846)
    5131                            .dwattr $C$DW$T$206, DW_AT_decl_column(0x01)
    5132                            .dwendtag $C$DW$T$206
    5133                    
    5134                    $C$DW$T$307     .dwtag  DW_TAG_typedef
    5135                            .dwattr $C$DW$T$307, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
    5136                            .dwattr $C$DW$T$307, DW_AT_type(*$C$DW$T$206)
    5137                            .dwattr $C$DW$T$307, DW_AT_language(DW_LANG_C)
    5138                            .dwattr $C$DW$T$307, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicati
    5139                            .dwattr $C$DW$T$307, DW_AT_decl_line(0x858)
    5140                            .dwattr $C$DW$T$307, DW_AT_decl_column(0x03)
    5141                    
    5142                    $C$DW$T$308     .dwtag  DW_TAG_pointer_type
    5143                            .dwattr $C$DW$T$308, DW_AT_type(*$C$DW$T$307)
    5144                            .dwattr $C$DW$T$308, DW_AT_address_class(0x20)
    5145                    
    5146                    
    5147                    $C$DW$T$210     .dwtag  DW_TAG_union_type
    5148                            .dwattr $C$DW$T$210, DW_AT_byte_size(0x04)
    5149                    $C$DW$461       .dwtag  DW_TAG_member
    5150                            .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$207)
    5151                            .dwattr $C$DW$461, DW_AT_name("f")
    5152                            .dwattr $C$DW$461, DW_AT_TI_symbol_name("f")
    5153                            .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5154                            .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    5155                            .dwattr $C$DW$461, DW_AT_decl_file("C:/ti/xdctools_3_50_03_33_core/packages/xdc/std.h")
    5156                            .dwattr $C$DW$461, DW_AT_decl_line(0xb7)
    5157                            .dwattr $C$DW$461, DW_AT_decl_column(0x0f)
    5158                    
    5159                    $C$DW$462       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{A955FC8F-DD62-468C-8CEC-7F5E7A3A0C22} PAGE   95

    5160                            .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$209)
    5161                            .dwattr $C$DW$462, DW_AT_name("a")
    5162                            .dwattr $C$DW$462, DW_AT_TI_symbol_name("a")
    5163                            .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5164                            .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    5165                            .dwattr $C$DW$462, DW_AT_decl_file("C:/ti/xdctools_3_50_03_33_core/packages/xdc/std.h")
    5166                            .dwattr $C$DW$462, DW_AT_decl_line(0xb8)
    5167                            .dwattr $C$DW$462, DW_AT_decl_column(0x0f)
    5168                    
    5169                            .dwattr $C$DW$T$210, DW_AT_decl_file("C:/ti/xdctools_3_50_03_33_core/packages/xdc/std.h")
    5170                            .dwattr $C$DW$T$210, DW_AT_decl_line(0xb6)
    5171                            .dwattr $C$DW$T$210, DW_AT_decl_column(0x0f)
    5172                            .dwendtag $C$DW$T$210
    5173                    
    5174                    $C$DW$T$863     .dwtag  DW_TAG_typedef
    5175                            .dwattr $C$DW$T$863, DW_AT_name("xdc_FloatData")
    5176                            .dwattr $C$DW$T$863, DW_AT_type(*$C$DW$T$210)
    5177                            .dwattr $C$DW$T$863, DW_AT_language(DW_LANG_C)
    5178                            .dwattr $C$DW$T$863, DW_AT_decl_file("C:/ti/xdctools_3_50_03_33_core/packages/xdc/std.h")
    5179                            .dwattr $C$DW$T$863, DW_AT_decl_line(0xb9)
    5180                            .dwattr $C$DW$T$863, DW_AT_decl_column(0x03)
    5181                    
    5182                    
    5183                    $C$DW$T$215     .dwtag  DW_TAG_union_type
    5184                            .dwattr $C$DW$T$215, DW_AT_byte_size(0x02)
    5185                    $C$DW$463       .dwtag  DW_TAG_member
    5186                            .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$212)
    5187                            .dwattr $C$DW$463, DW_AT_name("entityId")
    5188                            .dwattr $C$DW$463, DW_AT_TI_symbol_name("entityId")
    5189                            .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5190                            .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    5191                            .dwattr $C$DW$463, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    5192                            .dwattr $C$DW$463, DW_AT_decl_line(0x1fe)
    5193                            .dwattr $C$DW$463, DW_AT_decl_column(0x14)
    5194                    
    5195                    $C$DW$464       .dwtag  DW_TAG_member
    5196                            .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$214)
    5197                            .dwattr $C$DW$464, DW_AT_name("servId")
    5198                            .dwattr $C$DW$464, DW_AT_TI_symbol_name("servId")
    5199                            .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5200                            .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    5201                            .dwattr $C$DW$464, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    5202                            .dwattr $C$DW$464, DW_AT_decl_line(0x200)
    5203                            .dwattr $C$DW$464, DW_AT_decl_column(0x17)
    5204                    
    5205                            .dwattr $C$DW$T$215, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    5206                            .dwattr $C$DW$T$215, DW_AT_decl_line(0x1fc)
    5207                            .dwattr $C$DW$T$215, DW_AT_decl_column(0x03)
    5208                            .dwendtag $C$DW$T$215
    5209                    
    5210                    
    5211                    $C$DW$T$216     .dwtag  DW_TAG_union_type
    5212                            .dwattr $C$DW$T$216, DW_AT_byte_size(0x02)
    5213                    $C$DW$465       .dwtag  DW_TAG_member
    5214                            .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$214)
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{A955FC8F-DD62-468C-8CEC-7F5E7A3A0C22} PAGE   96

    5215                            .dwattr $C$DW$465, DW_AT_name("servId")
    5216                            .dwattr $C$DW$465, DW_AT_TI_symbol_name("servId")
    5217                            .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5218                            .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    5219                            .dwattr $C$DW$465, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    5220                            .dwattr $C$DW$465, DW_AT_decl_line(0x211)
    5221                            .dwattr $C$DW$465, DW_AT_decl_column(0x17)
    5222                    
    5223                    $C$DW$466       .dwtag  DW_TAG_member
    5224                            .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$212)
    5225                            .dwattr $C$DW$466, DW_AT_name("entityId")
    5226                            .dwattr $C$DW$466, DW_AT_TI_symbol_name("entityId")
    5227                            .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5228                            .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    5229                            .dwattr $C$DW$466, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    5230                            .dwattr $C$DW$466, DW_AT_decl_line(0x213)
    5231                            .dwattr $C$DW$466, DW_AT_decl_column(0x14)
    5232                    
    5233                            .dwattr $C$DW$T$216, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    5234                            .dwattr $C$DW$T$216, DW_AT_decl_line(0x20f)
    5235                            .dwattr $C$DW$T$216, DW_AT_decl_column(0x03)
    5236                            .dwendtag $C$DW$T$216
    5237                    
    5238                    
    5239                    $C$DW$T$219     .dwtag  DW_TAG_union_type
    5240                            .dwattr $C$DW$T$219, DW_AT_byte_size(0x08)
    5241                    $C$DW$467       .dwtag  DW_TAG_member
    5242                            .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$170)
    5243                            .dwattr $C$DW$467, DW_AT_name("shortAddr")
    5244                            .dwattr $C$DW$467, DW_AT_TI_symbol_name("shortAddr")
    5245                            .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5246                            .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    5247                            .dwattr $C$DW$467, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5248                            .dwattr $C$DW$467, DW_AT_decl_line(0x4a4)
    5249                            .dwattr $C$DW$467, DW_AT_decl_column(0x12)
    5250                    
    5251                    $C$DW$468       .dwtag  DW_TAG_member
    5252                            .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$218)
    5253                            .dwattr $C$DW$468, DW_AT_name("extAddr")
    5254                            .dwattr $C$DW$468, DW_AT_TI_symbol_name("extAddr")
    5255                            .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5256                            .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    5257                            .dwattr $C$DW$468, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5258                            .dwattr $C$DW$468, DW_AT_decl_line(0x4a6)
    5259                            .dwattr $C$DW$468, DW_AT_decl_column(0x1b)
    5260                    
    5261                            .dwattr $C$DW$T$219, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicati
    5262                            .dwattr $C$DW$T$219, DW_AT_decl_line(0x4a2)
    5263                            .dwattr $C$DW$T$219, DW_AT_decl_column(0x05)
    5264                            .dwendtag $C$DW$T$219
    5265                    
    5266                    
    5267                    $C$DW$T$222     .dwtag  DW_TAG_union_type
    5268                            .dwattr $C$DW$T$222, DW_AT_byte_size(0x18)
    5269                    $C$DW$469       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{A955FC8F-DD62-468C-8CEC-7F5E7A3A0C22} PAGE   97

    5270                            .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$220)
    5271                            .dwattr $C$DW$469, DW_AT_name("beacon")
    5272                            .dwattr $C$DW$469, DW_AT_TI_symbol_name("beacon")
    5273                            .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5274                            .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    5275                            .dwattr $C$DW$469, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5276                            .dwattr $C$DW$469, DW_AT_decl_line(0x854)
    5277                            .dwattr $C$DW$469, DW_AT_decl_column(0x1d)
    5278                    
    5279                    $C$DW$470       .dwtag  DW_TAG_member
    5280                            .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$221)
    5281                            .dwattr $C$DW$470, DW_AT_name("eBeacon")
    5282                            .dwattr $C$DW$470, DW_AT_TI_symbol_name("eBeacon")
    5283                            .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5284                            .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    5285                            .dwattr $C$DW$470, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5286                            .dwattr $C$DW$470, DW_AT_decl_line(0x856)
    5287                            .dwattr $C$DW$470, DW_AT_decl_column(0x1e)
    5288                    
    5289                            .dwattr $C$DW$T$222, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicati
    5290                            .dwattr $C$DW$T$222, DW_AT_decl_line(0x852)
    5291                            .dwattr $C$DW$T$222, DW_AT_decl_column(0x05)
    5292                            .dwendtag $C$DW$T$222
    5293                    
    5294                    
    5295                    $C$DW$T$224     .dwtag  DW_TAG_union_type
    5296                            .dwattr $C$DW$T$224, DW_AT_byte_size(0x04)
    5297                    $C$DW$471       .dwtag  DW_TAG_member
    5298                            .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$154)
    5299                            .dwattr $C$DW$471, DW_AT_name("pEnergyDetect")
    5300                            .dwattr $C$DW$471, DW_AT_TI_symbol_name("pEnergyDetect")
    5301                            .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5302                            .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    5303                            .dwattr $C$DW$471, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5304                            .dwattr $C$DW$471, DW_AT_decl_line(0x876)
    5305                            .dwattr $C$DW$471, DW_AT_decl_column(0x12)
    5306                    
    5307                    $C$DW$472       .dwtag  DW_TAG_member
    5308                            .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$223)
    5309                            .dwattr $C$DW$472, DW_AT_name("pPanDescriptor")
    5310                            .dwattr $C$DW$472, DW_AT_TI_symbol_name("pPanDescriptor")
    5311                            .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5312                            .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    5313                            .dwattr $C$DW$472, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5314                            .dwattr $C$DW$472, DW_AT_decl_line(0x878)
    5315                            .dwattr $C$DW$472, DW_AT_decl_column(0x1b)
    5316                    
    5317                            .dwattr $C$DW$T$224, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicati
    5318                            .dwattr $C$DW$T$224, DW_AT_decl_line(0x874)
    5319                            .dwattr $C$DW$T$224, DW_AT_decl_column(0x05)
    5320                            .dwendtag $C$DW$T$224
    5321                    
    5322                    
    5323                    $C$DW$T$229     .dwtag  DW_TAG_structure_type
    5324                            .dwattr $C$DW$T$229, DW_AT_name(".ggroup1")
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{A955FC8F-DD62-468C-8CEC-7F5E7A3A0C22} PAGE   98

    5325                            .dwattr $C$DW$T$229, DW_AT_byte_size(0xdc)
    5326                    $C$DW$473       .dwtag  DW_TAG_member
    5327                            .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$225)
    5328                            .dwattr $C$DW$473, DW_AT_name("ledPinHandle")
    5329                            .dwattr $C$DW$473, DW_AT_TI_symbol_name("ledPinHandle")
    5330                            .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5331                            .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    5332                    
    5333                    $C$DW$474       .dwtag  DW_TAG_member
    5334                            .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$226)
    5335                            .dwattr $C$DW$474, DW_AT_name("laserPwm")
    5336                            .dwattr $C$DW$474, DW_AT_TI_symbol_name("laserPwm")
    5337                            .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5338                            .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    5339                    
    5340                    $C$DW$475       .dwtag  DW_TAG_member
    5341                            .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$226)
    5342                            .dwattr $C$DW$475, DW_AT_name("tonePwm")
    5343                            .dwattr $C$DW$475, DW_AT_TI_symbol_name("tonePwm")
    5344                            .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5345                            .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    5346                    
    5347                    $C$DW$476       .dwtag  DW_TAG_member
    5348                            .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$243)
    5349                            .dwattr $C$DW$476, DW_AT_name("ledPinState")
    5350                            .dwattr $C$DW$476, DW_AT_TI_symbol_name("ledPinState")
    5351                            .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5352                            .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    5353                    
    5354                    $C$DW$477       .dwtag  DW_TAG_member
    5355                            .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$227)
    5356                            .dwattr $C$DW$477, DW_AT_name("ledStatus")
    5357                            .dwattr $C$DW$477, DW_AT_TI_symbol_name("ledStatus")
    5358                            .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5359                            .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    5360                    
    5361                    $C$DW$478       .dwtag  DW_TAG_member
    5362                            .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$228)
    5363                            .dwattr $C$DW$478, DW_AT_name("ledPinTable")
    5364                            .dwattr $C$DW$478, DW_AT_TI_symbol_name("ledPinTable")
    5365                            .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5366                            .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    5367                    
    5368                    $C$DW$479       .dwtag  DW_TAG_member
    5369                            .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$279)
    5370                            .dwattr $C$DW$479, DW_AT_name("laserPwmParams")
    5371                            .dwattr $C$DW$479, DW_AT_TI_symbol_name("laserPwmParams")
    5372                            .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5373                            .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    5374                    
    5375                    $C$DW$480       .dwtag  DW_TAG_member
    5376                            .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$279)
    5377                            .dwattr $C$DW$480, DW_AT_name("tonePwmParams")
    5378                            .dwattr $C$DW$480, DW_AT_TI_symbol_name("tonePwmParams")
    5379                            .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{A955FC8F-DD62-468C-8CEC-7F5E7A3A0C22} PAGE   99

    5380                            .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    5381                    
    5382                    $C$DW$481       .dwtag  DW_TAG_member
    5383                            .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$605)
    5384                            .dwattr $C$DW$481, DW_AT_name("blinkClkStruct")
    5385                            .dwattr $C$DW$481, DW_AT_TI_symbol_name("blinkClkStruct")
    5386                            .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    5387                            .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    5388                    
    5389                    $C$DW$482       .dwtag  DW_TAG_member
    5390                            .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$605)
    5391                            .dwattr $C$DW$482, DW_AT_name("laserClkStruct")
    5392                            .dwattr $C$DW$482, DW_AT_TI_symbol_name("laserClkStruct")
    5393                            .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    5394                            .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    5395                    
    5396                    $C$DW$483       .dwtag  DW_TAG_member
    5397                            .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$605)
    5398                            .dwattr $C$DW$483, DW_AT_name("toneClkStruct")
    5399                            .dwattr $C$DW$483, DW_AT_TI_symbol_name("toneClkStruct")
    5400                            .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    5401                            .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    5402                    
    5403                            .dwendtag $C$DW$T$229
    5404                    
    5405                    
    5406                    $C$DW$T$865     .dwtag  DW_TAG_enumeration_type
    5407                            .dwattr $C$DW$T$865, DW_AT_name("CC13X0_LAUNCHXL_ADCBufName")
    5408                            .dwattr $C$DW$T$865, DW_AT_byte_size(0x01)
    5409                    $C$DW$484       .dwtag  DW_TAG_enumerator
    5410                            .dwattr $C$DW$484, DW_AT_name("CC13X0_LAUNCHXL_ADCBuf0")
    5411                            .dwattr $C$DW$484, DW_AT_const_value(0x00)
    5412                            .dwattr $C$DW$484, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5413                            .dwattr $C$DW$484, DW_AT_decl_line(0x129)
    5414                            .dwattr $C$DW$484, DW_AT_decl_column(0x05)
    5415                    
    5416                    $C$DW$485       .dwtag  DW_TAG_enumerator
    5417                            .dwattr $C$DW$485, DW_AT_name("CC13X0_LAUNCHXL_ADCBufCOUNT")
    5418                            .dwattr $C$DW$485, DW_AT_const_value(0x01)
    5419                            .dwattr $C$DW$485, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5420                            .dwattr $C$DW$485, DW_AT_decl_line(0x12a)
    5421                            .dwattr $C$DW$485, DW_AT_decl_column(0x05)
    5422                    
    5423                            .dwattr $C$DW$T$865, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC1
    5424                            .dwattr $C$DW$T$865, DW_AT_decl_line(0x128)
    5425                            .dwattr $C$DW$T$865, DW_AT_decl_column(0x0e)
    5426                            .dwendtag $C$DW$T$865
    5427                    
    5428                    $C$DW$T$866     .dwtag  DW_TAG_typedef
    5429                            .dwattr $C$DW$T$866, DW_AT_name("CC13X0_LAUNCHXL_ADCBufName")
    5430                            .dwattr $C$DW$T$866, DW_AT_type(*$C$DW$T$865)
    5431                            .dwattr $C$DW$T$866, DW_AT_language(DW_LANG_C)
    5432                            .dwattr $C$DW$T$866, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC1
    5433                            .dwattr $C$DW$T$866, DW_AT_decl_line(0x12b)
    5434                            .dwattr $C$DW$T$866, DW_AT_decl_column(0x03)
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{A955FC8F-DD62-468C-8CEC-7F5E7A3A0C22} PAGE  100

    5435                    
    5436                    
    5437                    $C$DW$T$867     .dwtag  DW_TAG_enumeration_type
    5438                            .dwattr $C$DW$T$867, DW_AT_name("CC13X0_LAUNCHXL_ADCName")
    5439                            .dwattr $C$DW$T$867, DW_AT_byte_size(0x01)
    5440                    $C$DW$486       .dwtag  DW_TAG_enumerator
    5441                            .dwattr $C$DW$486, DW_AT_name("CC13X0_LAUNCHXL_ADC0")
    5442                            .dwattr $C$DW$486, DW_AT_const_value(0x00)
    5443                            .dwattr $C$DW$486, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5444                            .dwattr $C$DW$486, DW_AT_decl_line(0x133)
    5445                            .dwattr $C$DW$486, DW_AT_decl_column(0x05)
    5446                    
    5447                    $C$DW$487       .dwtag  DW_TAG_enumerator
    5448                            .dwattr $C$DW$487, DW_AT_name("CC13X0_LAUNCHXL_ADC1")
    5449                            .dwattr $C$DW$487, DW_AT_const_value(0x01)
    5450                            .dwattr $C$DW$487, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5451                            .dwattr $C$DW$487, DW_AT_decl_line(0x134)
    5452                            .dwattr $C$DW$487, DW_AT_decl_column(0x05)
    5453                    
    5454                    $C$DW$488       .dwtag  DW_TAG_enumerator
    5455                            .dwattr $C$DW$488, DW_AT_name("CC13X0_LAUNCHXL_ADC2")
    5456                            .dwattr $C$DW$488, DW_AT_const_value(0x02)
    5457                            .dwattr $C$DW$488, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5458                            .dwattr $C$DW$488, DW_AT_decl_line(0x135)
    5459                            .dwattr $C$DW$488, DW_AT_decl_column(0x05)
    5460                    
    5461                    $C$DW$489       .dwtag  DW_TAG_enumerator
    5462                            .dwattr $C$DW$489, DW_AT_name("CC13X0_LAUNCHXL_ADC3")
    5463                            .dwattr $C$DW$489, DW_AT_const_value(0x03)
    5464                            .dwattr $C$DW$489, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5465                            .dwattr $C$DW$489, DW_AT_decl_line(0x136)
    5466                            .dwattr $C$DW$489, DW_AT_decl_column(0x05)
    5467                    
    5468                    $C$DW$490       .dwtag  DW_TAG_enumerator
    5469                            .dwattr $C$DW$490, DW_AT_name("CC13X0_LAUNCHXL_ADC4")
    5470                            .dwattr $C$DW$490, DW_AT_const_value(0x04)
    5471                            .dwattr $C$DW$490, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5472                            .dwattr $C$DW$490, DW_AT_decl_line(0x137)
    5473                            .dwattr $C$DW$490, DW_AT_decl_column(0x05)
    5474                    
    5475                    $C$DW$491       .dwtag  DW_TAG_enumerator
    5476                            .dwattr $C$DW$491, DW_AT_name("CC13X0_LAUNCHXL_ADC5")
    5477                            .dwattr $C$DW$491, DW_AT_const_value(0x05)
    5478                            .dwattr $C$DW$491, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5479                            .dwattr $C$DW$491, DW_AT_decl_line(0x138)
    5480                            .dwattr $C$DW$491, DW_AT_decl_column(0x05)
    5481                    
    5482                    $C$DW$492       .dwtag  DW_TAG_enumerator
    5483                            .dwattr $C$DW$492, DW_AT_name("CC13X0_LAUNCHXL_ADC6")
    5484                            .dwattr $C$DW$492, DW_AT_const_value(0x06)
    5485                            .dwattr $C$DW$492, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5486                            .dwattr $C$DW$492, DW_AT_decl_line(0x139)
    5487                            .dwattr $C$DW$492, DW_AT_decl_column(0x05)
    5488                    
    5489                    $C$DW$493       .dwtag  DW_TAG_enumerator
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{A955FC8F-DD62-468C-8CEC-7F5E7A3A0C22} PAGE  101

    5490                            .dwattr $C$DW$493, DW_AT_name("CC13X0_LAUNCHXL_ADC7")
    5491                            .dwattr $C$DW$493, DW_AT_const_value(0x07)
    5492                            .dwattr $C$DW$493, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5493                            .dwattr $C$DW$493, DW_AT_decl_line(0x13a)
    5494                            .dwattr $C$DW$493, DW_AT_decl_column(0x05)
    5495                    
    5496                    $C$DW$494       .dwtag  DW_TAG_enumerator
    5497                            .dwattr $C$DW$494, DW_AT_name("CC13X0_LAUNCHXL_ADCDCOUPL")
    5498                            .dwattr $C$DW$494, DW_AT_const_value(0x08)
    5499                            .dwattr $C$DW$494, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5500                            .dwattr $C$DW$494, DW_AT_decl_line(0x13b)
    5501                            .dwattr $C$DW$494, DW_AT_decl_column(0x05)
    5502                    
    5503                    $C$DW$495       .dwtag  DW_TAG_enumerator
    5504                            .dwattr $C$DW$495, DW_AT_name("CC13X0_LAUNCHXL_ADCVSS")
    5505                            .dwattr $C$DW$495, DW_AT_const_value(0x09)
    5506                            .dwattr $C$DW$495, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5507                            .dwattr $C$DW$495, DW_AT_decl_line(0x13c)
    5508                            .dwattr $C$DW$495, DW_AT_decl_column(0x05)
    5509                    
    5510                    $C$DW$496       .dwtag  DW_TAG_enumerator
    5511                            .dwattr $C$DW$496, DW_AT_name("CC13X0_LAUNCHXL_ADCVDDS")
    5512                            .dwattr $C$DW$496, DW_AT_const_value(0x0a)
    5513                            .dwattr $C$DW$496, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5514                            .dwattr $C$DW$496, DW_AT_decl_line(0x13d)
    5515                            .dwattr $C$DW$496, DW_AT_decl_column(0x05)
    5516                    
    5517                    $C$DW$497       .dwtag  DW_TAG_enumerator
    5518                            .dwattr $C$DW$497, DW_AT_name("CC13X0_LAUNCHXL_ADCCOUNT")
    5519                            .dwattr $C$DW$497, DW_AT_const_value(0x0b)
    5520                            .dwattr $C$DW$497, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5521                            .dwattr $C$DW$497, DW_AT_decl_line(0x13e)
    5522                            .dwattr $C$DW$497, DW_AT_decl_column(0x05)
    5523                    
    5524                            .dwattr $C$DW$T$867, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC1
    5525                            .dwattr $C$DW$T$867, DW_AT_decl_line(0x132)
    5526                            .dwattr $C$DW$T$867, DW_AT_decl_column(0x0e)
    5527                            .dwendtag $C$DW$T$867
    5528                    
    5529                    $C$DW$T$868     .dwtag  DW_TAG_typedef
    5530                            .dwattr $C$DW$T$868, DW_AT_name("CC13X0_LAUNCHXL_ADCName")
    5531                            .dwattr $C$DW$T$868, DW_AT_type(*$C$DW$T$867)
    5532                            .dwattr $C$DW$T$868, DW_AT_language(DW_LANG_C)
    5533                            .dwattr $C$DW$T$868, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC1
    5534                            .dwattr $C$DW$T$868, DW_AT_decl_line(0x13f)
    5535                            .dwattr $C$DW$T$868, DW_AT_decl_column(0x03)
    5536                    
    5537                    
    5538                    $C$DW$T$869     .dwtag  DW_TAG_enumeration_type
    5539                            .dwattr $C$DW$T$869, DW_AT_name("CC13X0_LAUNCHXL_CryptoName")
    5540                            .dwattr $C$DW$T$869, DW_AT_byte_size(0x01)
    5541                    $C$DW$498       .dwtag  DW_TAG_enumerator
    5542                            .dwattr $C$DW$498, DW_AT_name("CC13X0_LAUNCHXL_CRYPTO0")
    5543                            .dwattr $C$DW$498, DW_AT_const_value(0x00)
    5544                            .dwattr $C$DW$498, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{A955FC8F-DD62-468C-8CEC-7F5E7A3A0C22} PAGE  102

    5545                            .dwattr $C$DW$498, DW_AT_decl_line(0xd0)
    5546                            .dwattr $C$DW$498, DW_AT_decl_column(0x05)
    5547                    
    5548                    $C$DW$499       .dwtag  DW_TAG_enumerator
    5549                            .dwattr $C$DW$499, DW_AT_name("CC13X0_LAUNCHXL_CRYPTOCOUNT")
    5550                            .dwattr $C$DW$499, DW_AT_const_value(0x01)
    5551                            .dwattr $C$DW$499, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5552                            .dwattr $C$DW$499, DW_AT_decl_line(0xd2)
    5553                            .dwattr $C$DW$499, DW_AT_decl_column(0x05)
    5554                    
    5555                            .dwattr $C$DW$T$869, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC1
    5556                            .dwattr $C$DW$T$869, DW_AT_decl_line(0xcf)
    5557                            .dwattr $C$DW$T$869, DW_AT_decl_column(0x0e)
    5558                            .dwendtag $C$DW$T$869
    5559                    
    5560                    $C$DW$T$870     .dwtag  DW_TAG_typedef
    5561                            .dwattr $C$DW$T$870, DW_AT_name("CC13X0_LAUNCHXL_CryptoName")
    5562                            .dwattr $C$DW$T$870, DW_AT_type(*$C$DW$T$869)
    5563                            .dwattr $C$DW$T$870, DW_AT_language(DW_LANG_C)
    5564                            .dwattr $C$DW$T$870, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC1
    5565                            .dwattr $C$DW$T$870, DW_AT_decl_line(0xd3)
    5566                            .dwattr $C$DW$T$870, DW_AT_decl_column(0x03)
    5567                    
    5568                    
    5569                    $C$DW$T$871     .dwtag  DW_TAG_enumeration_type
    5570                            .dwattr $C$DW$T$871, DW_AT_name("CC13X0_LAUNCHXL_GPTimerName")
    5571                            .dwattr $C$DW$T$871, DW_AT_byte_size(0x01)
    5572                    $C$DW$500       .dwtag  DW_TAG_enumerator
    5573                            .dwattr $C$DW$500, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER0A")
    5574                            .dwattr $C$DW$500, DW_AT_const_value(0x00)
    5575                            .dwattr $C$DW$500, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5576                            .dwattr $C$DW$500, DW_AT_decl_line(0xfb)
    5577                            .dwattr $C$DW$500, DW_AT_decl_column(0x05)
    5578                    
    5579                    $C$DW$501       .dwtag  DW_TAG_enumerator
    5580                            .dwattr $C$DW$501, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER0B")
    5581                            .dwattr $C$DW$501, DW_AT_const_value(0x01)
    5582                            .dwattr $C$DW$501, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5583                            .dwattr $C$DW$501, DW_AT_decl_line(0xfc)
    5584                            .dwattr $C$DW$501, DW_AT_decl_column(0x05)
    5585                    
    5586                    $C$DW$502       .dwtag  DW_TAG_enumerator
    5587                            .dwattr $C$DW$502, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER1A")
    5588                            .dwattr $C$DW$502, DW_AT_const_value(0x02)
    5589                            .dwattr $C$DW$502, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5590                            .dwattr $C$DW$502, DW_AT_decl_line(0xfd)
    5591                            .dwattr $C$DW$502, DW_AT_decl_column(0x05)
    5592                    
    5593                    $C$DW$503       .dwtag  DW_TAG_enumerator
    5594                            .dwattr $C$DW$503, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER1B")
    5595                            .dwattr $C$DW$503, DW_AT_const_value(0x03)
    5596                            .dwattr $C$DW$503, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5597                            .dwattr $C$DW$503, DW_AT_decl_line(0xfe)
    5598                            .dwattr $C$DW$503, DW_AT_decl_column(0x05)
    5599                    
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:01 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{A955FC8F-DD62-468C-8CEC-7F5E7A3A0C22} PAGE  103

    5600                    $C$DW$504       .dwtag  DW_TAG_enumerator
    5601                            .dwattr $C$DW$504, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER2A")
    5602                            .dwattr $C$DW$504, DW_AT_const_value(0x04)
    5603                            .dwattr $C$DW$504, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5604                            .dwattr $C$DW$504, DW_AT_decl_line(0xff)
    5605                            .dwattr $C$DW$504, DW_AT_decl_column(0x05)
    5606                    
    5607                    $C$DW$505       .dwtag  DW_TAG_enumerator
    5608                            .dwattr $C$DW$505, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER2B")
    5609                            .dwattr $C$DW$505, DW_AT_const_value(0x05)
    5610                            .dwattr $C$DW$505, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5611                            .dwattr $C$DW$505, DW_AT_decl_line(0x100)
    5612                            .dwattr $C$DW$505, DW_AT_decl_column(0x05)
    5613                    
    5614                    $C$DW$506       .dwtag  DW_TAG_enumerator
    5615                            .dwattr $C$DW$506, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER3A")
    5616                            .dwattr $C$DW$506, DW_AT_const_value(0x06)
    5617                            .dwattr $C$DW$506, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5618                            .dwattr $C$DW$506, DW_AT_decl_line(0x101)
    5619                            .dwattr $C$DW$506, DW_AT_decl_column(0x05)
    5620                    
    5621                    $C$DW$507       .dwtag  DW_TAG_enumerator
    5622                            .dwattr $C$DW$507, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER3B")
    5623                            .dwattr $C$DW$507, DW_AT_const_value(0x07)
    5624                            .dwattr $C$DW$507, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5625                            .dwattr $C$DW$507, DW_AT_decl_line(0x102)
    5626                            .dwattr $C$DW$507, DW_AT_decl_column(0x05)
    5627                    
    5628                    $C$DW$508       .dwtag  DW_TAG_enumerator
    5629                            .dwattr $C$DW$508, DW_AT_name("CC13X0_LAUNCHXL_GPTIMERPARTSCOUNT")
    5630                            .dwattr $C$DW$508, DW_AT_const_value(0x08)
    5631                            .dwattr $C$DW$508, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5632                            .dwattr $C$DW$508, DW_AT_decl_line(0x103)
    5633                            .dwattr $C$DW$508, DW_AT_decl_column(0x05)
    5634                    
    5635                            .dwattr $C$DW$T$871, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC1
    5636                            .dwattr $C$DW$T$871, DW_AT_decl_line(0xf9)
    5637                            .dwattr $C$DW$T$871, DW_AT_decl_column(0x0e)
    5638                            .dwendtag $C$DW$T$871
    5639                    
    5640                    $C$DW$T$872     .dwtag  DW_TAG_typedef
    5641                            .dwattr $C$DW$T$872, DW_AT_name("CC13X0_LAUNCHXL_GPTimerName")
    5642                            .dwattr $C$DW$T$872, DW_AT_type(*$C$DW$T$871)
    5643                            .dwattr $C$DW$T$872, DW_AT_language(DW_LANG_C)
