TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E4017998-DDBA-48E5-AA2C-4C176E1EA0F7} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Thu Mar 08 21:09:39 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/LaunchPad/board_led.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\collector_cc1310lp\collector_cc1
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    4451                            .dwendtag $C$DW$T$846
    4452                    
    4453                    $C$DW$T$847     .dwtag  DW_TAG_typedef
    4454                            .dwattr $C$DW$T$847, DW_AT_name("ApiMac_MLMESubIE_t")
    4455                            .dwattr $C$DW$T$847, DW_AT_type(*$C$DW$T$846)
    4456                            .dwattr $C$DW$T$847, DW_AT_language(DW_LANG_C)
    4457                            .dwattr $C$DW$T$847, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicati
    4458                            .dwattr $C$DW$T$847, DW_AT_decl_line(0x43d)
    4459                            .dwattr $C$DW$T$847, DW_AT_decl_column(0x03)
    4460                    
    4461                    
    4462                    $C$DW$T$848     .dwtag  DW_TAG_enumeration_type
    4463                            .dwattr $C$DW$T$848, DW_AT_byte_size(0x01)
    4464                    $C$DW$412       .dwtag  DW_TAG_enumerator
    4465                            .dwattr $C$DW$412, DW_AT_name("ApiMac_wisunSubIE_USIE")
    4466                            .dwattr $C$DW$412, DW_AT_const_value(0x01)
    4467                            .dwattr $C$DW$412, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4468                            .dwattr $C$DW$412, DW_AT_decl_line(0x443)
    4469                            .dwattr $C$DW$412, DW_AT_decl_column(0x05)
    4470                    
    4471                    $C$DW$413       .dwtag  DW_TAG_enumerator
    4472                            .dwattr $C$DW$413, DW_AT_name("ApiMac_wisunSubIE_BSIE")
    4473                            .dwattr $C$DW$413, DW_AT_const_value(0x02)
    4474                            .dwattr $C$DW$413, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4475                            .dwattr $C$DW$413, DW_AT_decl_line(0x445)
    4476                            .dwattr $C$DW$413, DW_AT_decl_column(0x05)
    4477                    
    4478                    $C$DW$414       .dwtag  DW_TAG_enumerator
    4479                            .dwattr $C$DW$414, DW_AT_name("ApiMac_wisunSubIE_PANIE")
    4480                            .dwattr $C$DW$414, DW_AT_const_value(0x04)
    4481                            .dwattr $C$DW$414, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4482                            .dwattr $C$DW$414, DW_AT_decl_line(0x447)
    4483                            .dwattr $C$DW$414, DW_AT_decl_column(0x05)
    4484                    
    4485                    $C$DW$415       .dwtag  DW_TAG_enumerator
    4486                            .dwattr $C$DW$415, DW_AT_name("ApiMac_wisunSubIE_netNameIE")
    4487                            .dwattr $C$DW$415, DW_AT_const_value(0x05)
    4488                            .dwattr $C$DW$415, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4489                            .dwattr $C$DW$415, DW_AT_decl_line(0x449)
    4490                            .dwattr $C$DW$415, DW_AT_decl_column(0x05)
    4491                    
    4492                    $C$DW$416       .dwtag  DW_TAG_enumerator
    4493                            .dwattr $C$DW$416, DW_AT_name("ApiMac_wisunSubIE_PANVersionIE")
    4494                            .dwattr $C$DW$416, DW_AT_const_value(0x06)
    4495                            .dwattr $C$DW$416, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4496                            .dwattr $C$DW$416, DW_AT_decl_line(0x44b)
    4497                            .dwattr $C$DW$416, DW_AT_decl_column(0x05)
    4498                    
    4499                    $C$DW$417       .dwtag  DW_TAG_enumerator
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E4017998-DDBA-48E5-AA2C-4C176E1EA0F7} PAGE   83

    4500                            .dwattr $C$DW$417, DW_AT_name("ApiMac_wisunSubIE_GTKHashIE")
    4501                            .dwattr $C$DW$417, DW_AT_const_value(0x07)
    4502                            .dwattr $C$DW$417, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4503                            .dwattr $C$DW$417, DW_AT_decl_line(0x44d)
    4504                            .dwattr $C$DW$417, DW_AT_decl_column(0x05)
    4505                    
    4506                            .dwattr $C$DW$T$848, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicati
    4507                            .dwattr $C$DW$T$848, DW_AT_decl_line(0x441)
    4508                            .dwattr $C$DW$T$848, DW_AT_decl_column(0x01)
    4509                            .dwendtag $C$DW$T$848
    4510                    
    4511                    $C$DW$T$849     .dwtag  DW_TAG_typedef
    4512                            .dwattr $C$DW$T$849, DW_AT_name("ApiMac_wisunSubIE_t")
    4513                            .dwattr $C$DW$T$849, DW_AT_type(*$C$DW$T$848)
    4514                            .dwattr $C$DW$T$849, DW_AT_language(DW_LANG_C)
    4515                            .dwattr $C$DW$T$849, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicati
    4516                            .dwattr $C$DW$T$849, DW_AT_decl_line(0x44e)
    4517                            .dwattr $C$DW$T$849, DW_AT_decl_column(0x03)
    4518                    
    4519                    
    4520                    $C$DW$T$141     .dwtag  DW_TAG_structure_type
    4521                            .dwattr $C$DW$T$141, DW_AT_byte_size(0x02)
    4522                    $C$DW$418       .dwtag  DW_TAG_member
    4523                            .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$138)
    4524                            .dwattr $C$DW$418, DW_AT_name("state")
    4525                            .dwattr $C$DW$418, DW_AT_TI_symbol_name("state")
    4526                            .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4527                            .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4528                            .dwattr $C$DW$418, DW_AT_decl_file("../Application/LaunchPad/board_led.c")
    4529                            .dwattr $C$DW$418, DW_AT_decl_line(0x72)
    4530                            .dwattr $C$DW$418, DW_AT_decl_column(0x15)
    4531                    
    4532                    $C$DW$419       .dwtag  DW_TAG_member
    4533                            .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$140)
    4534                            .dwattr $C$DW$419, DW_AT_name("status")
    4535                            .dwattr $C$DW$419, DW_AT_TI_symbol_name("status")
    4536                            .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4537                            .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4538                            .dwattr $C$DW$419, DW_AT_decl_file("../Application/LaunchPad/board_led.c")
    4539                            .dwattr $C$DW$419, DW_AT_decl_line(0x73)
    4540                            .dwattr $C$DW$419, DW_AT_decl_column(0x11)
    4541                    
    4542                            .dwattr $C$DW$T$141, DW_AT_decl_file("../Application/LaunchPad/board_led.c")
    4543                            .dwattr $C$DW$T$141, DW_AT_decl_line(0x71)
    4544                            .dwattr $C$DW$T$141, DW_AT_decl_column(0x01)
    4545                            .dwendtag $C$DW$T$141
    4546                    
    4547                    
    4548                    $C$DW$T$227     .dwtag  DW_TAG_array_type
    4549                            .dwattr $C$DW$T$227, DW_AT_type(*$C$DW$T$141)
    4550                            .dwattr $C$DW$T$227, DW_AT_language(DW_LANG_C)
    4551                            .dwattr $C$DW$T$227, DW_AT_byte_size(0x0e)
    4552                    $C$DW$420       .dwtag  DW_TAG_subrange_type
    4553                            .dwattr $C$DW$420, DW_AT_upper_bound(0x06)
    4554                    
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E4017998-DDBA-48E5-AA2C-4C176E1EA0F7} PAGE   84

    4555                            .dwendtag $C$DW$T$227
    4556                    
    4557                    $C$DW$T$852     .dwtag  DW_TAG_typedef
    4558                            .dwattr $C$DW$T$852, DW_AT_name("board_led_status_t")
    4559                            .dwattr $C$DW$T$852, DW_AT_type(*$C$DW$T$141)
    4560                            .dwattr $C$DW$T$852, DW_AT_language(DW_LANG_C)
    4561                            .dwattr $C$DW$T$852, DW_AT_decl_file("../Application/LaunchPad/board_led.c")
    4562                            .dwattr $C$DW$T$852, DW_AT_decl_line(0x74)
    4563                            .dwattr $C$DW$T$852, DW_AT_decl_column(0x03)
    4564                    
    4565                    
    4566                    $C$DW$T$853     .dwtag  DW_TAG_array_type
    4567                            .dwattr $C$DW$T$853, DW_AT_type(*$C$DW$T$852)
    4568                            .dwattr $C$DW$T$853, DW_AT_language(DW_LANG_C)
    4569                            .dwattr $C$DW$T$853, DW_AT_byte_size(0x0e)
    4570                    $C$DW$421       .dwtag  DW_TAG_subrange_type
    4571                            .dwattr $C$DW$421, DW_AT_upper_bound(0x06)
    4572                    
    4573                            .dwendtag $C$DW$T$853
    4574                    
    4575                    
    4576                    $C$DW$T$142     .dwtag  DW_TAG_structure_type
    4577                            .dwattr $C$DW$T$142, DW_AT_byte_size(0x08)
    4578                    $C$DW$422       .dwtag  DW_TAG_member
    4579                            .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$10)
    4580                            .dwattr $C$DW$422, DW_AT_name("quot")
    4581                            .dwattr $C$DW$422, DW_AT_TI_symbol_name("quot")
    4582                            .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4583                            .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4584                            .dwattr $C$DW$422, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    4585                            .dwattr $C$DW$422, DW_AT_decl_line(0x5c)
    4586                            .dwattr $C$DW$422, DW_AT_decl_column(0x16)
    4587                    
    4588                    $C$DW$423       .dwtag  DW_TAG_member
    4589                            .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$10)
    4590                            .dwattr $C$DW$423, DW_AT_name("rem")
    4591                            .dwattr $C$DW$423, DW_AT_TI_symbol_name("rem")
    4592                            .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4593                            .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4594                            .dwattr $C$DW$423, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    4595                            .dwattr $C$DW$423, DW_AT_decl_line(0x5c)
    4596                            .dwattr $C$DW$423, DW_AT_decl_column(0x1c)
    4597                    
    4598                            .dwattr $C$DW$T$142, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    4599                            .dwattr $C$DW$T$142, DW_AT_decl_line(0x5c)
    4600                            .dwattr $C$DW$T$142, DW_AT_decl_column(0x10)
    4601                            .dwendtag $C$DW$T$142
    4602                    
    4603                    $C$DW$T$854     .dwtag  DW_TAG_typedef
    4604                            .dwattr $C$DW$T$854, DW_AT_name("div_t")
    4605                            .dwattr $C$DW$T$854, DW_AT_type(*$C$DW$T$142)
    4606                            .dwattr $C$DW$T$854, DW_AT_language(DW_LANG_C)
    4607                            .dwattr $C$DW$T$854, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    4608                            .dwattr $C$DW$T$854, DW_AT_decl_line(0x5c)
    4609                            .dwattr $C$DW$T$854, DW_AT_decl_column(0x23)
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E4017998-DDBA-48E5-AA2C-4C176E1EA0F7} PAGE   85

    4610                    
    4611                    
    4612                    $C$DW$T$143     .dwtag  DW_TAG_structure_type
    4613                            .dwattr $C$DW$T$143, DW_AT_byte_size(0x08)
    4614                    $C$DW$424       .dwtag  DW_TAG_member
    4615                            .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$10)
    4616                            .dwattr $C$DW$424, DW_AT_name("quot")
    4617                            .dwattr $C$DW$424, DW_AT_TI_symbol_name("quot")
    4618                            .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4619                            .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4620                            .dwattr $C$DW$424, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    4621                            .dwattr $C$DW$424, DW_AT_decl_line(0x5e)
    4622                            .dwattr $C$DW$424, DW_AT_decl_column(0x16)
    4623                    
    4624                    $C$DW$425       .dwtag  DW_TAG_member
    4625                            .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$10)
    4626                            .dwattr $C$DW$425, DW_AT_name("rem")
    4627                            .dwattr $C$DW$425, DW_AT_TI_symbol_name("rem")
    4628                            .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4629                            .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4630                            .dwattr $C$DW$425, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    4631                            .dwattr $C$DW$425, DW_AT_decl_line(0x5e)
    4632                            .dwattr $C$DW$425, DW_AT_decl_column(0x1c)
    4633                    
    4634                            .dwattr $C$DW$T$143, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    4635                            .dwattr $C$DW$T$143, DW_AT_decl_line(0x5e)
    4636                            .dwattr $C$DW$T$143, DW_AT_decl_column(0x10)
    4637                            .dwendtag $C$DW$T$143
    4638                    
    4639                    $C$DW$T$855     .dwtag  DW_TAG_typedef
    4640                            .dwattr $C$DW$T$855, DW_AT_name("ldiv_t")
    4641                            .dwattr $C$DW$T$855, DW_AT_type(*$C$DW$T$143)
    4642                            .dwattr $C$DW$T$855, DW_AT_language(DW_LANG_C)
    4643                            .dwattr $C$DW$T$855, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    4644                            .dwattr $C$DW$T$855, DW_AT_decl_line(0x5e)
    4645                            .dwattr $C$DW$T$855, DW_AT_decl_column(0x23)
    4646                    
    4647                    
    4648                    $C$DW$T$144     .dwtag  DW_TAG_structure_type
    4649                            .dwattr $C$DW$T$144, DW_AT_byte_size(0x10)
    4650                    $C$DW$426       .dwtag  DW_TAG_member
    4651                            .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$14)
    4652                            .dwattr $C$DW$426, DW_AT_name("quot")
    4653                            .dwattr $C$DW$426, DW_AT_TI_symbol_name("quot")
    4654                            .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4655                            .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4656                            .dwattr $C$DW$426, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    4657                            .dwattr $C$DW$426, DW_AT_decl_line(0x61)
    4658                            .dwattr $C$DW$426, DW_AT_decl_column(0x1c)
    4659                    
    4660                    $C$DW$427       .dwtag  DW_TAG_member
    4661                            .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$14)
    4662                            .dwattr $C$DW$427, DW_AT_name("rem")
    4663                            .dwattr $C$DW$427, DW_AT_TI_symbol_name("rem")
    4664                            .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E4017998-DDBA-48E5-AA2C-4C176E1EA0F7} PAGE   86

    4665                            .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4666                            .dwattr $C$DW$427, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    4667                            .dwattr $C$DW$427, DW_AT_decl_line(0x61)
    4668                            .dwattr $C$DW$427, DW_AT_decl_column(0x22)
    4669                    
    4670                            .dwattr $C$DW$T$144, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    4671                            .dwattr $C$DW$T$144, DW_AT_decl_line(0x61)
    4672                            .dwattr $C$DW$T$144, DW_AT_decl_column(0x10)
    4673                            .dwendtag $C$DW$T$144
    4674                    
    4675                    $C$DW$T$856     .dwtag  DW_TAG_typedef
    4676                            .dwattr $C$DW$T$856, DW_AT_name("lldiv_t")
    4677                            .dwattr $C$DW$T$856, DW_AT_type(*$C$DW$T$144)
    4678                            .dwattr $C$DW$T$856, DW_AT_language(DW_LANG_C)
    4679                            .dwattr $C$DW$T$856, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    4680                            .dwattr $C$DW$T$856, DW_AT_decl_line(0x61)
    4681                            .dwattr $C$DW$T$856, DW_AT_decl_column(0x29)
    4682                    
    4683                    
    4684                    $C$DW$T$149     .dwtag  DW_TAG_structure_type
    4685                            .dwattr $C$DW$T$149, DW_AT_byte_size(0x08)
    4686                    $C$DW$428       .dwtag  DW_TAG_member
    4687                            .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$147)
    4688                            .dwattr $C$DW$428, DW_AT_name("pointerStack")
    4689                            .dwattr $C$DW$428, DW_AT_TI_symbol_name("pointerStack")
    4690                            .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4691                            .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4692                            .dwattr $C$DW$428, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4693                            .dwattr $C$DW$428, DW_AT_decl_line(0x3f5)
    4694                            .dwattr $C$DW$428, DW_AT_decl_column(0x16)
    4695                    
    4696                    $C$DW$429       .dwtag  DW_TAG_member
    4697                            .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$148)
    4698                            .dwattr $C$DW$429, DW_AT_name("directAPI")
    4699                            .dwattr $C$DW$429, DW_AT_TI_symbol_name("directAPI")
    4700                            .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4701                            .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4702                            .dwattr $C$DW$429, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4703                            .dwattr $C$DW$429, DW_AT_decl_line(0x3f6)
    4704                            .dwattr $C$DW$429, DW_AT_decl_column(0x15)
    4705                    
    4706                            .dwattr $C$DW$T$149, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    4707                            .dwattr $C$DW$T$149, DW_AT_decl_line(0x3f4)
    4708                            .dwattr $C$DW$T$149, DW_AT_decl_column(0x01)
    4709                            .dwendtag $C$DW$T$149
    4710                    
    4711                    $C$DW$T$151     .dwtag  DW_TAG_typedef
    4712                            .dwattr $C$DW$T$151, DW_AT_name("icall_directAPIMsg_t")
    4713                            .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$149)
    4714                            .dwattr $C$DW$T$151, DW_AT_language(DW_LANG_C)
    4715                            .dwattr $C$DW$T$151, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    4716                            .dwattr $C$DW$T$151, DW_AT_decl_line(0x3f7)
    4717                            .dwattr $C$DW$T$151, DW_AT_decl_column(0x03)
    4718                    
    4719                    
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E4017998-DDBA-48E5-AA2C-4C176E1EA0F7} PAGE   87

    4720                    $C$DW$T$152     .dwtag  DW_TAG_structure_type
    4721                            .dwattr $C$DW$T$152, DW_AT_byte_size(0x14)
    4722                    $C$DW$430       .dwtag  DW_TAG_member
    4723                            .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$150)
    4724                            .dwattr $C$DW$430, DW_AT_name("hdr")
    4725                            .dwattr $C$DW$430, DW_AT_TI_symbol_name("hdr")
    4726                            .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4727                            .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4728                            .dwattr $C$DW$430, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4729                            .dwattr $C$DW$430, DW_AT_decl_line(0x3fb)
    4730                            .dwattr $C$DW$430, DW_AT_decl_column(0x10)
    4731                    
    4732                    $C$DW$431       .dwtag  DW_TAG_member
    4733                            .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$151)
    4734                            .dwattr $C$DW$431, DW_AT_name("msg")
    4735                            .dwattr $C$DW$431, DW_AT_TI_symbol_name("msg")
    4736                            .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4737                            .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4738                            .dwattr $C$DW$431, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4739                            .dwattr $C$DW$431, DW_AT_decl_line(0x3fc)
    4740                            .dwattr $C$DW$431, DW_AT_decl_column(0x1a)
    4741                    
    4742                            .dwattr $C$DW$T$152, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    4743                            .dwattr $C$DW$T$152, DW_AT_decl_line(0x3fa)
    4744                            .dwattr $C$DW$T$152, DW_AT_decl_column(0x01)
    4745                            .dwendtag $C$DW$T$152
    4746                    
    4747                    $C$DW$T$857     .dwtag  DW_TAG_typedef
    4748                            .dwattr $C$DW$T$857, DW_AT_name("icallLiteMsg_t")
    4749                            .dwattr $C$DW$T$857, DW_AT_type(*$C$DW$T$152)
    4750                            .dwattr $C$DW$T$857, DW_AT_language(DW_LANG_C)
    4751                            .dwattr $C$DW$T$857, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    4752                            .dwattr $C$DW$T$857, DW_AT_decl_line(0x3fd)
    4753                            .dwattr $C$DW$T$857, DW_AT_decl_column(0x03)
    4754                    
    4755                    
    4756                    $C$DW$T$193     .dwtag  DW_TAG_structure_type
    4757                            .dwattr $C$DW$T$193, DW_AT_byte_size(0x4c)
    4758                    $C$DW$432       .dwtag  DW_TAG_member
    4759                            .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$157)
    4760                            .dwattr $C$DW$432, DW_AT_name("Crc32")
    4761                            .dwattr $C$DW$432, DW_AT_TI_symbol_name("Crc32")
    4762                            .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4763                            .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4764                            .dwattr $C$DW$432, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4765                            .dwattr $C$DW$432, DW_AT_decl_line(0x76)
    4766                            .dwattr $C$DW$432, DW_AT_decl_column(0x25)
    4767                    
    4768                    $C$DW$433       .dwtag  DW_TAG_member
    4769                            .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$160)
    4770                            .dwattr $C$DW$433, DW_AT_name("FlashGetSize")
    4771                            .dwattr $C$DW$433, DW_AT_TI_symbol_name("FlashGetSize")
    4772                            .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4773                            .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    4774                            .dwattr $C$DW$433, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E4017998-DDBA-48E5-AA2C-4C176E1EA0F7} PAGE   88

    4775                            .dwattr $C$DW$433, DW_AT_decl_line(0x77)
    4776                            .dwattr $C$DW$433, DW_AT_decl_column(0x25)
    4777                    
    4778                    $C$DW$434       .dwtag  DW_TAG_member
    4779                            .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$161)
    4780                            .dwattr $C$DW$434, DW_AT_name("GetChipId")
    4781                            .dwattr $C$DW$434, DW_AT_TI_symbol_name("GetChipId")
    4782                            .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4783                            .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4784                            .dwattr $C$DW$434, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4785                            .dwattr $C$DW$434, DW_AT_decl_line(0x78)
    4786                            .dwattr $C$DW$434, DW_AT_decl_column(0x25)
    4787                    
    4788                    $C$DW$435       .dwtag  DW_TAG_member
    4789                            .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$164)
    4790                            .dwattr $C$DW$435, DW_AT_name("ReservedLocation1")
    4791                            .dwattr $C$DW$435, DW_AT_TI_symbol_name("ReservedLocation1")
    4792                            .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4793                            .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4794                            .dwattr $C$DW$435, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4795                            .dwattr $C$DW$435, DW_AT_decl_line(0x79)
    4796                            .dwattr $C$DW$435, DW_AT_decl_column(0x25)
    4797                    
    4798                    $C$DW$436       .dwtag  DW_TAG_member
    4799                            .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$165)
    4800                            .dwattr $C$DW$436, DW_AT_name("ReservedLocation2")
    4801                            .dwattr $C$DW$436, DW_AT_TI_symbol_name("ReservedLocation2")
    4802                            .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4803                            .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4804                            .dwattr $C$DW$436, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4805                            .dwattr $C$DW$436, DW_AT_decl_line(0x7a)
    4806                            .dwattr $C$DW$436, DW_AT_decl_column(0x25)
    4807                    
    4808                    $C$DW$437       .dwtag  DW_TAG_member
    4809                            .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$166)
    4810                            .dwattr $C$DW$437, DW_AT_name("ReservedLocation3")
    4811                            .dwattr $C$DW$437, DW_AT_TI_symbol_name("ReservedLocation3")
    4812                            .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4813                            .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4814                            .dwattr $C$DW$437, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4815                            .dwattr $C$DW$437, DW_AT_decl_line(0x7b)
    4816                            .dwattr $C$DW$437, DW_AT_decl_column(0x25)
    4817                    
    4818                    $C$DW$438       .dwtag  DW_TAG_member
    4819                            .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$169)
    4820                            .dwattr $C$DW$438, DW_AT_name("ResetDevice")
    4821                            .dwattr $C$DW$438, DW_AT_TI_symbol_name("ResetDevice")
    4822                            .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4823                            .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4824                            .dwattr $C$DW$438, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4825                            .dwattr $C$DW$438, DW_AT_decl_line(0x7c)
    4826                            .dwattr $C$DW$438, DW_AT_decl_column(0x25)
    4827                    
    4828                    $C$DW$439       .dwtag  DW_TAG_member
    4829                            .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$174)
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E4017998-DDBA-48E5-AA2C-4C176E1EA0F7} PAGE   89

    4830                            .dwattr $C$DW$439, DW_AT_name("Fletcher32")
    4831                            .dwattr $C$DW$439, DW_AT_TI_symbol_name("Fletcher32")
    4832                            .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4833                            .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4834                            .dwattr $C$DW$439, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4835                            .dwattr $C$DW$439, DW_AT_decl_line(0x7d)
    4836                            .dwattr $C$DW$439, DW_AT_decl_column(0x25)
    4837                    
    4838                    $C$DW$440       .dwtag  DW_TAG_member
    4839                            .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$178)
    4840                            .dwattr $C$DW$440, DW_AT_name("MinValue")
    4841                            .dwattr $C$DW$440, DW_AT_TI_symbol_name("MinValue")
    4842                            .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4843                            .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4844                            .dwattr $C$DW$440, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4845                            .dwattr $C$DW$440, DW_AT_decl_line(0x7e)
    4846                            .dwattr $C$DW$440, DW_AT_decl_column(0x25)
    4847                    
    4848                    $C$DW$441       .dwtag  DW_TAG_member
    4849                            .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$179)
    4850                            .dwattr $C$DW$441, DW_AT_name("MaxValue")
    4851                            .dwattr $C$DW$441, DW_AT_TI_symbol_name("MaxValue")
    4852                            .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4853                            .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4854                            .dwattr $C$DW$441, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4855                            .dwattr $C$DW$441, DW_AT_decl_line(0x7f)
    4856                            .dwattr $C$DW$441, DW_AT_decl_column(0x25)
    4857                    
    4858                    $C$DW$442       .dwtag  DW_TAG_member
    4859                            .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$180)
    4860                            .dwattr $C$DW$442, DW_AT_name("MeanValue")
    4861                            .dwattr $C$DW$442, DW_AT_TI_symbol_name("MeanValue")
    4862                            .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4863                            .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4864                            .dwattr $C$DW$442, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4865                            .dwattr $C$DW$442, DW_AT_decl_line(0x80)
    4866                            .dwattr $C$DW$442, DW_AT_decl_column(0x25)
    4867                    
    4868                    $C$DW$443       .dwtag  DW_TAG_member
    4869                            .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$181)
    4870                            .dwattr $C$DW$443, DW_AT_name("StandDeviationValue")
    4871                            .dwattr $C$DW$443, DW_AT_TI_symbol_name("StandDeviationValue")
    4872                            .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4873                            .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4874                            .dwattr $C$DW$443, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4875                            .dwattr $C$DW$443, DW_AT_decl_line(0x81)
    4876                            .dwattr $C$DW$443, DW_AT_decl_column(0x25)
    4877                    
    4878                    $C$DW$444       .dwtag  DW_TAG_member
    4879                            .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$184)
    4880                            .dwattr $C$DW$444, DW_AT_name("ReservedLocation4")
    4881                            .dwattr $C$DW$444, DW_AT_TI_symbol_name("ReservedLocation4")
    4882                            .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4883                            .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4884                            .dwattr $C$DW$444, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E4017998-DDBA-48E5-AA2C-4C176E1EA0F7} PAGE   90

    4885                            .dwattr $C$DW$444, DW_AT_decl_line(0x82)
    4886                            .dwattr $C$DW$444, DW_AT_decl_column(0x25)
    4887                    
    4888                    $C$DW$445       .dwtag  DW_TAG_member
    4889                            .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$185)
    4890                            .dwattr $C$DW$445, DW_AT_name("ReservedLocation5")
    4891                            .dwattr $C$DW$445, DW_AT_TI_symbol_name("ReservedLocation5")
    4892                            .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4893                            .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4894                            .dwattr $C$DW$445, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4895                            .dwattr $C$DW$445, DW_AT_decl_line(0x83)
    4896                            .dwattr $C$DW$445, DW_AT_decl_column(0x25)
    4897                    
    4898                    $C$DW$446       .dwtag  DW_TAG_member
    4899                            .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$186)
    4900                            .dwattr $C$DW$446, DW_AT_name("HFSourceSafeSwitch")
    4901                            .dwattr $C$DW$446, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    4902                            .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4903                            .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4904                            .dwattr $C$DW$446, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4905                            .dwattr $C$DW$446, DW_AT_decl_line(0x84)
    4906                            .dwattr $C$DW$446, DW_AT_decl_column(0x25)
    4907                    
    4908                    $C$DW$447       .dwtag  DW_TAG_member
    4909                            .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$189)
    4910                            .dwattr $C$DW$447, DW_AT_name("SelectCompAInput")
    4911                            .dwattr $C$DW$447, DW_AT_TI_symbol_name("SelectCompAInput")
    4912                            .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4913                            .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4914                            .dwattr $C$DW$447, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4915                            .dwattr $C$DW$447, DW_AT_decl_line(0x85)
    4916                            .dwattr $C$DW$447, DW_AT_decl_column(0x25)
    4917                    
    4918                    $C$DW$448       .dwtag  DW_TAG_member
    4919                            .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$190)
    4920                            .dwattr $C$DW$448, DW_AT_name("SelectCompARef")
    4921                            .dwattr $C$DW$448, DW_AT_TI_symbol_name("SelectCompARef")
    4922                            .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4923                            .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4924                            .dwattr $C$DW$448, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4925                            .dwattr $C$DW$448, DW_AT_decl_line(0x86)
    4926                            .dwattr $C$DW$448, DW_AT_decl_column(0x25)
    4927                    
    4928                    $C$DW$449       .dwtag  DW_TAG_member
    4929                            .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$191)
    4930                            .dwattr $C$DW$449, DW_AT_name("SelectADCCompBInput")
    4931                            .dwattr $C$DW$449, DW_AT_TI_symbol_name("SelectADCCompBInput")
    4932                            .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4933                            .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4934                            .dwattr $C$DW$449, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4935                            .dwattr $C$DW$449, DW_AT_decl_line(0x87)
    4936                            .dwattr $C$DW$449, DW_AT_decl_column(0x25)
    4937                    
    4938                    $C$DW$450       .dwtag  DW_TAG_member
    4939                            .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$192)
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E4017998-DDBA-48E5-AA2C-4C176E1EA0F7} PAGE   91

    4940                            .dwattr $C$DW$450, DW_AT_name("SelectCompBRef")
    4941                            .dwattr $C$DW$450, DW_AT_TI_symbol_name("SelectCompBRef")
    4942                            .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4943                            .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4944                            .dwattr $C$DW$450, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4945                            .dwattr $C$DW$450, DW_AT_decl_line(0x88)
    4946                            .dwattr $C$DW$450, DW_AT_decl_column(0x25)
    4947                    
    4948                            .dwattr $C$DW$T$193, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    4949                            .dwattr $C$DW$T$193, DW_AT_decl_line(0x75)
    4950                            .dwattr $C$DW$T$193, DW_AT_decl_column(0x01)
    4951                            .dwendtag $C$DW$T$193
    4952                    
    4953                    $C$DW$T$858     .dwtag  DW_TAG_typedef
    4954                            .dwattr $C$DW$T$858, DW_AT_name("HARD_API_T")
    4955                            .dwattr $C$DW$T$858, DW_AT_type(*$C$DW$T$193)
    4956                            .dwattr $C$DW$T$858, DW_AT_language(DW_LANG_C)
    4957                            .dwattr $C$DW$T$858, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    4958                            .dwattr $C$DW$T$858, DW_AT_decl_line(0x89)
    4959                            .dwattr $C$DW$T$858, DW_AT_decl_column(0x03)
    4960                    
    4961                    
    4962                    $C$DW$T$196     .dwtag  DW_TAG_structure_type
    4963                            .dwattr $C$DW$T$196, DW_AT_byte_size(0x08)
    4964                    $C$DW$451       .dwtag  DW_TAG_member
    4965                            .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$10)
    4966                            .dwattr $C$DW$451, DW_AT_name("length")
    4967                            .dwattr $C$DW$451, DW_AT_TI_symbol_name("length")
    4968                            .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4969                            .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4970                            .dwattr $C$DW$451, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    4971                            .dwattr $C$DW$451, DW_AT_decl_line(0x165)
    4972                            .dwattr $C$DW$451, DW_AT_decl_column(0x16)
    4973                    
    4974                    $C$DW$452       .dwtag  DW_TAG_member
    4975                            .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$195)
    4976                            .dwattr $C$DW$452, DW_AT_name("elem")
    4977                            .dwattr $C$DW$452, DW_AT_TI_symbol_name("elem")
    4978                            .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4979                            .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4980                            .dwattr $C$DW$452, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    4981                            .dwattr $C$DW$452, DW_AT_decl_line(0x165)
    4982                            .dwattr $C$DW$452, DW_AT_decl_column(0x3a)
    4983                    
    4984                            .dwattr $C$DW$T$196, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    4985                            .dwattr $C$DW$T$196, DW_AT_decl_line(0x165)
    4986                            .dwattr $C$DW$T$196, DW_AT_decl_column(0x10)
    4987                            .dwendtag $C$DW$T$196
    4988                    
    4989                    $C$DW$T$859     .dwtag  DW_TAG_typedef
    4990                            .dwattr $C$DW$T$859, DW_AT_name("__ARRAY1_ti_sysbios_knl_Swi_hooks")
    4991                            .dwattr $C$DW$T$859, DW_AT_type(*$C$DW$T$196)
    4992                            .dwattr $C$DW$T$859, DW_AT_language(DW_LANG_C)
    4993                            .dwattr $C$DW$T$859, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    4994                            .dwattr $C$DW$T$859, DW_AT_decl_line(0x165)
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E4017998-DDBA-48E5-AA2C-4C176E1EA0F7} PAGE   92

    4995                            .dwattr $C$DW$T$859, DW_AT_decl_column(0x42)
    4996                    
    4997                    
    4998                    $C$DW$T$199     .dwtag  DW_TAG_structure_type
    4999                            .dwattr $C$DW$T$199, DW_AT_byte_size(0x08)
    5000                    $C$DW$453       .dwtag  DW_TAG_member
    5001                            .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$10)
    5002                            .dwattr $C$DW$453, DW_AT_name("length")
    5003                            .dwattr $C$DW$453, DW_AT_TI_symbol_name("length")
    5004                            .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5005                            .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    5006                            .dwattr $C$DW$453, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    5007                            .dwattr $C$DW$453, DW_AT_decl_line(0x166)
    5008                            .dwattr $C$DW$453, DW_AT_decl_column(0x16)
    5009                    
    5010                    $C$DW$454       .dwtag  DW_TAG_member
    5011                            .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$198)
    5012                            .dwattr $C$DW$454, DW_AT_name("elem")
    5013                            .dwattr $C$DW$454, DW_AT_TI_symbol_name("elem")
    5014                            .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5015                            .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    5016                            .dwattr $C$DW$454, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    5017                            .dwattr $C$DW$454, DW_AT_decl_line(0x166)
    5018                            .dwattr $C$DW$454, DW_AT_decl_column(0x40)
    5019                    
    5020                            .dwattr $C$DW$T$199, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    5021                            .dwattr $C$DW$T$199, DW_AT_decl_line(0x166)
    5022                            .dwattr $C$DW$T$199, DW_AT_decl_column(0x10)
    5023                            .dwendtag $C$DW$T$199
    5024                    
    5025                    $C$DW$T$860     .dwtag  DW_TAG_typedef
    5026                            .dwattr $C$DW$T$860, DW_AT_name("__CARRAY1_ti_sysbios_knl_Swi_hooks")
    5027                            .dwattr $C$DW$T$860, DW_AT_type(*$C$DW$T$199)
    5028                            .dwattr $C$DW$T$860, DW_AT_language(DW_LANG_C)
    5029                            .dwattr $C$DW$T$860, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    5030                            .dwattr $C$DW$T$860, DW_AT_decl_line(0x166)
    5031                            .dwattr $C$DW$T$860, DW_AT_decl_column(0x48)
    5032                    
    5033                    $C$DW$T$861     .dwtag  DW_TAG_typedef
    5034                            .dwattr $C$DW$T$861, DW_AT_name("CT__ti_sysbios_knl_Swi_hooks")
    5035                            .dwattr $C$DW$T$861, DW_AT_type(*$C$DW$T$860)
    5036                            .dwattr $C$DW$T$861, DW_AT_language(DW_LANG_C)
    5037                            .dwattr $C$DW$T$861, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    5038                            .dwattr $C$DW$T$861, DW_AT_decl_line(0x168)
    5039                            .dwattr $C$DW$T$861, DW_AT_decl_column(0x2c)
    5040                    
    5041                    $C$DW$T$862     .dwtag  DW_TAG_typedef
    5042                            .dwattr $C$DW$T$862, DW_AT_name("__TA_ti_sysbios_knl_Swi_hooks")
    5043                            .dwattr $C$DW$T$862, DW_AT_type(*$C$DW$T$860)
    5044                            .dwattr $C$DW$T$862, DW_AT_language(DW_LANG_C)
    5045                            .dwattr $C$DW$T$862, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    5046                            .dwattr $C$DW$T$862, DW_AT_decl_line(0x167)
    5047                            .dwattr $C$DW$T$862, DW_AT_decl_column(0x2c)
    5048                    
    5049                    
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E4017998-DDBA-48E5-AA2C-4C176E1EA0F7} PAGE   93

    5050                    $C$DW$T$202     .dwtag  DW_TAG_structure_type
    5051                            .dwattr $C$DW$T$202, DW_AT_byte_size(0x0a)
    5052                    $C$DW$455       .dwtag  DW_TAG_member
    5053                            .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$219)
    5054                            .dwattr $C$DW$455, DW_AT_name("addr")
    5055                            .dwattr $C$DW$455, DW_AT_TI_symbol_name("addr")
    5056                            .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5057                            .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    5058                            .dwattr $C$DW$455, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5059                            .dwattr $C$DW$455, DW_AT_decl_line(0x4a7)
    5060                            .dwattr $C$DW$455, DW_AT_decl_column(0x07)
    5061                    
    5062                    $C$DW$456       .dwtag  DW_TAG_member
    5063                            .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$201)
    5064                            .dwattr $C$DW$456, DW_AT_name("addrMode")
    5065                            .dwattr $C$DW$456, DW_AT_TI_symbol_name("addrMode")
    5066                            .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5067                            .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    5068                            .dwattr $C$DW$456, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5069                            .dwattr $C$DW$456, DW_AT_decl_line(0x4aa)
    5070                            .dwattr $C$DW$456, DW_AT_decl_column(0x17)
    5071                    
    5072                            .dwattr $C$DW$T$202, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicati
    5073                            .dwattr $C$DW$T$202, DW_AT_decl_line(0x49c)
    5074                            .dwattr $C$DW$T$202, DW_AT_decl_column(0x01)
    5075                            .dwendtag $C$DW$T$202
    5076                    
    5077                    $C$DW$T$395     .dwtag  DW_TAG_typedef
    5078                            .dwattr $C$DW$T$395, DW_AT_name("ApiMac_sAddr_t")
    5079                            .dwattr $C$DW$T$395, DW_AT_type(*$C$DW$T$202)
    5080                            .dwattr $C$DW$T$395, DW_AT_language(DW_LANG_C)
    5081                            .dwattr $C$DW$T$395, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicati
    5082                            .dwattr $C$DW$T$395, DW_AT_decl_line(0x4ab)
    5083                            .dwattr $C$DW$T$395, DW_AT_decl_column(0x03)
    5084                    
    5085                    
    5086                    $C$DW$T$206     .dwtag  DW_TAG_structure_type
    5087                            .dwattr $C$DW$T$206, DW_AT_byte_size(0x40)
    5088                    $C$DW$457       .dwtag  DW_TAG_member
    5089                            .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$204)
    5090                            .dwattr $C$DW$457, DW_AT_name("beaconType")
    5091                            .dwattr $C$DW$457, DW_AT_TI_symbol_name("beaconType")
    5092                            .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5093                            .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    5094                            .dwattr $C$DW$457, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5095                            .dwattr $C$DW$457, DW_AT_decl_line(0x848)
    5096                            .dwattr $C$DW$457, DW_AT_decl_column(0x19)
    5097                    
    5098                    $C$DW$458       .dwtag  DW_TAG_member
    5099                            .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$153)
    5100                            .dwattr $C$DW$458, DW_AT_name("bsn")
    5101                            .dwattr $C$DW$458, DW_AT_TI_symbol_name("bsn")
    5102                            .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5103                            .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    5104                            .dwattr $C$DW$458, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E4017998-DDBA-48E5-AA2C-4C176E1EA0F7} PAGE   94

    5105                            .dwattr $C$DW$458, DW_AT_decl_line(0x84a)
    5106                            .dwattr $C$DW$458, DW_AT_decl_column(0x0d)
    5107                    
    5108                    $C$DW$459       .dwtag  DW_TAG_member
    5109                            .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$205)
    5110                            .dwattr $C$DW$459, DW_AT_name("panDesc")
    5111                            .dwattr $C$DW$459, DW_AT_TI_symbol_name("panDesc")
    5112                            .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5113                            .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    5114                            .dwattr $C$DW$459, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5115                            .dwattr $C$DW$459, DW_AT_decl_line(0x84c)
    5116                            .dwattr $C$DW$459, DW_AT_decl_column(0x16)
    5117                    
    5118                    $C$DW$460       .dwtag  DW_TAG_member
    5119                            .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$222)
    5120                            .dwattr $C$DW$460, DW_AT_name("beaconData")
    5121                            .dwattr $C$DW$460, DW_AT_TI_symbol_name("beaconData")
    5122                            .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5123                            .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    5124                            .dwattr $C$DW$460, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5125                            .dwattr $C$DW$460, DW_AT_decl_line(0x857)
    5126                            .dwattr $C$DW$460, DW_AT_decl_column(0x07)
    5127                    
    5128                            .dwattr $C$DW$T$206, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicati
    5129                            .dwattr $C$DW$T$206, DW_AT_decl_line(0x846)
    5130                            .dwattr $C$DW$T$206, DW_AT_decl_column(0x01)
    5131                            .dwendtag $C$DW$T$206
    5132                    
    5133                    $C$DW$T$307     .dwtag  DW_TAG_typedef
    5134                            .dwattr $C$DW$T$307, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
    5135                            .dwattr $C$DW$T$307, DW_AT_type(*$C$DW$T$206)
    5136                            .dwattr $C$DW$T$307, DW_AT_language(DW_LANG_C)
    5137                            .dwattr $C$DW$T$307, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicati
    5138                            .dwattr $C$DW$T$307, DW_AT_decl_line(0x858)
    5139                            .dwattr $C$DW$T$307, DW_AT_decl_column(0x03)
    5140                    
    5141                    $C$DW$T$308     .dwtag  DW_TAG_pointer_type
    5142                            .dwattr $C$DW$T$308, DW_AT_type(*$C$DW$T$307)
    5143                            .dwattr $C$DW$T$308, DW_AT_address_class(0x20)
    5144                    
    5145                    
    5146                    $C$DW$T$210     .dwtag  DW_TAG_union_type
    5147                            .dwattr $C$DW$T$210, DW_AT_byte_size(0x04)
    5148                    $C$DW$461       .dwtag  DW_TAG_member
    5149                            .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$207)
    5150                            .dwattr $C$DW$461, DW_AT_name("f")
    5151                            .dwattr $C$DW$461, DW_AT_TI_symbol_name("f")
    5152                            .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5153                            .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    5154                            .dwattr $C$DW$461, DW_AT_decl_file("C:/ti/xdctools_3_50_03_33_core/packages/xdc/std.h")
    5155                            .dwattr $C$DW$461, DW_AT_decl_line(0xb7)
    5156                            .dwattr $C$DW$461, DW_AT_decl_column(0x0f)
    5157                    
    5158                    $C$DW$462       .dwtag  DW_TAG_member
    5159                            .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$209)
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E4017998-DDBA-48E5-AA2C-4C176E1EA0F7} PAGE   95

    5160                            .dwattr $C$DW$462, DW_AT_name("a")
    5161                            .dwattr $C$DW$462, DW_AT_TI_symbol_name("a")
    5162                            .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5163                            .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    5164                            .dwattr $C$DW$462, DW_AT_decl_file("C:/ti/xdctools_3_50_03_33_core/packages/xdc/std.h")
    5165                            .dwattr $C$DW$462, DW_AT_decl_line(0xb8)
    5166                            .dwattr $C$DW$462, DW_AT_decl_column(0x0f)
    5167                    
    5168                            .dwattr $C$DW$T$210, DW_AT_decl_file("C:/ti/xdctools_3_50_03_33_core/packages/xdc/std.h")
    5169                            .dwattr $C$DW$T$210, DW_AT_decl_line(0xb6)
    5170                            .dwattr $C$DW$T$210, DW_AT_decl_column(0x0f)
    5171                            .dwendtag $C$DW$T$210
    5172                    
    5173                    $C$DW$T$863     .dwtag  DW_TAG_typedef
    5174                            .dwattr $C$DW$T$863, DW_AT_name("xdc_FloatData")
    5175                            .dwattr $C$DW$T$863, DW_AT_type(*$C$DW$T$210)
    5176                            .dwattr $C$DW$T$863, DW_AT_language(DW_LANG_C)
    5177                            .dwattr $C$DW$T$863, DW_AT_decl_file("C:/ti/xdctools_3_50_03_33_core/packages/xdc/std.h")
    5178                            .dwattr $C$DW$T$863, DW_AT_decl_line(0xb9)
    5179                            .dwattr $C$DW$T$863, DW_AT_decl_column(0x03)
    5180                    
    5181                    
    5182                    $C$DW$T$215     .dwtag  DW_TAG_union_type
    5183                            .dwattr $C$DW$T$215, DW_AT_byte_size(0x02)
    5184                    $C$DW$463       .dwtag  DW_TAG_member
    5185                            .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$212)
    5186                            .dwattr $C$DW$463, DW_AT_name("entityId")
    5187                            .dwattr $C$DW$463, DW_AT_TI_symbol_name("entityId")
    5188                            .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5189                            .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    5190                            .dwattr $C$DW$463, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    5191                            .dwattr $C$DW$463, DW_AT_decl_line(0x1fe)
    5192                            .dwattr $C$DW$463, DW_AT_decl_column(0x14)
    5193                    
    5194                    $C$DW$464       .dwtag  DW_TAG_member
    5195                            .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$214)
    5196                            .dwattr $C$DW$464, DW_AT_name("servId")
    5197                            .dwattr $C$DW$464, DW_AT_TI_symbol_name("servId")
    5198                            .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5199                            .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    5200                            .dwattr $C$DW$464, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    5201                            .dwattr $C$DW$464, DW_AT_decl_line(0x200)
    5202                            .dwattr $C$DW$464, DW_AT_decl_column(0x17)
    5203                    
    5204                            .dwattr $C$DW$T$215, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    5205                            .dwattr $C$DW$T$215, DW_AT_decl_line(0x1fc)
    5206                            .dwattr $C$DW$T$215, DW_AT_decl_column(0x03)
    5207                            .dwendtag $C$DW$T$215
    5208                    
    5209                    
    5210                    $C$DW$T$216     .dwtag  DW_TAG_union_type
    5211                            .dwattr $C$DW$T$216, DW_AT_byte_size(0x02)
    5212                    $C$DW$465       .dwtag  DW_TAG_member
    5213                            .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$214)
    5214                            .dwattr $C$DW$465, DW_AT_name("servId")
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E4017998-DDBA-48E5-AA2C-4C176E1EA0F7} PAGE   96

    5215                            .dwattr $C$DW$465, DW_AT_TI_symbol_name("servId")
    5216                            .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5217                            .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    5218                            .dwattr $C$DW$465, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    5219                            .dwattr $C$DW$465, DW_AT_decl_line(0x211)
    5220                            .dwattr $C$DW$465, DW_AT_decl_column(0x17)
    5221                    
    5222                    $C$DW$466       .dwtag  DW_TAG_member
    5223                            .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$212)
    5224                            .dwattr $C$DW$466, DW_AT_name("entityId")
    5225                            .dwattr $C$DW$466, DW_AT_TI_symbol_name("entityId")
    5226                            .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5227                            .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    5228                            .dwattr $C$DW$466, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    5229                            .dwattr $C$DW$466, DW_AT_decl_line(0x213)
    5230                            .dwattr $C$DW$466, DW_AT_decl_column(0x14)
    5231                    
    5232                            .dwattr $C$DW$T$216, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    5233                            .dwattr $C$DW$T$216, DW_AT_decl_line(0x20f)
    5234                            .dwattr $C$DW$T$216, DW_AT_decl_column(0x03)
    5235                            .dwendtag $C$DW$T$216
    5236                    
    5237                    
    5238                    $C$DW$T$219     .dwtag  DW_TAG_union_type
    5239                            .dwattr $C$DW$T$219, DW_AT_byte_size(0x08)
    5240                    $C$DW$467       .dwtag  DW_TAG_member
    5241                            .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$170)
    5242                            .dwattr $C$DW$467, DW_AT_name("shortAddr")
    5243                            .dwattr $C$DW$467, DW_AT_TI_symbol_name("shortAddr")
    5244                            .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5245                            .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    5246                            .dwattr $C$DW$467, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5247                            .dwattr $C$DW$467, DW_AT_decl_line(0x4a4)
    5248                            .dwattr $C$DW$467, DW_AT_decl_column(0x12)
    5249                    
    5250                    $C$DW$468       .dwtag  DW_TAG_member
    5251                            .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$218)
    5252                            .dwattr $C$DW$468, DW_AT_name("extAddr")
    5253                            .dwattr $C$DW$468, DW_AT_TI_symbol_name("extAddr")
    5254                            .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5255                            .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    5256                            .dwattr $C$DW$468, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5257                            .dwattr $C$DW$468, DW_AT_decl_line(0x4a6)
    5258                            .dwattr $C$DW$468, DW_AT_decl_column(0x1b)
    5259                    
    5260                            .dwattr $C$DW$T$219, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicati
    5261                            .dwattr $C$DW$T$219, DW_AT_decl_line(0x4a2)
    5262                            .dwattr $C$DW$T$219, DW_AT_decl_column(0x05)
    5263                            .dwendtag $C$DW$T$219
    5264                    
    5265                    
    5266                    $C$DW$T$222     .dwtag  DW_TAG_union_type
    5267                            .dwattr $C$DW$T$222, DW_AT_byte_size(0x18)
    5268                    $C$DW$469       .dwtag  DW_TAG_member
    5269                            .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$220)
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E4017998-DDBA-48E5-AA2C-4C176E1EA0F7} PAGE   97

    5270                            .dwattr $C$DW$469, DW_AT_name("beacon")
    5271                            .dwattr $C$DW$469, DW_AT_TI_symbol_name("beacon")
    5272                            .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5273                            .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    5274                            .dwattr $C$DW$469, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5275                            .dwattr $C$DW$469, DW_AT_decl_line(0x854)
    5276                            .dwattr $C$DW$469, DW_AT_decl_column(0x1d)
    5277                    
    5278                    $C$DW$470       .dwtag  DW_TAG_member
    5279                            .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$221)
    5280                            .dwattr $C$DW$470, DW_AT_name("eBeacon")
    5281                            .dwattr $C$DW$470, DW_AT_TI_symbol_name("eBeacon")
    5282                            .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5283                            .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    5284                            .dwattr $C$DW$470, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5285                            .dwattr $C$DW$470, DW_AT_decl_line(0x856)
    5286                            .dwattr $C$DW$470, DW_AT_decl_column(0x1e)
    5287                    
    5288                            .dwattr $C$DW$T$222, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicati
    5289                            .dwattr $C$DW$T$222, DW_AT_decl_line(0x852)
    5290                            .dwattr $C$DW$T$222, DW_AT_decl_column(0x05)
    5291                            .dwendtag $C$DW$T$222
    5292                    
    5293                    
    5294                    $C$DW$T$224     .dwtag  DW_TAG_union_type
    5295                            .dwattr $C$DW$T$224, DW_AT_byte_size(0x04)
    5296                    $C$DW$471       .dwtag  DW_TAG_member
    5297                            .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$154)
    5298                            .dwattr $C$DW$471, DW_AT_name("pEnergyDetect")
    5299                            .dwattr $C$DW$471, DW_AT_TI_symbol_name("pEnergyDetect")
    5300                            .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5301                            .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    5302                            .dwattr $C$DW$471, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5303                            .dwattr $C$DW$471, DW_AT_decl_line(0x876)
    5304                            .dwattr $C$DW$471, DW_AT_decl_column(0x12)
    5305                    
    5306                    $C$DW$472       .dwtag  DW_TAG_member
    5307                            .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$223)
    5308                            .dwattr $C$DW$472, DW_AT_name("pPanDescriptor")
    5309                            .dwattr $C$DW$472, DW_AT_TI_symbol_name("pPanDescriptor")
    5310                            .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5311                            .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    5312                            .dwattr $C$DW$472, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5313                            .dwattr $C$DW$472, DW_AT_decl_line(0x878)
    5314                            .dwattr $C$DW$472, DW_AT_decl_column(0x1b)
    5315                    
    5316                            .dwattr $C$DW$T$224, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicati
    5317                            .dwattr $C$DW$T$224, DW_AT_decl_line(0x874)
    5318                            .dwattr $C$DW$T$224, DW_AT_decl_column(0x05)
    5319                            .dwendtag $C$DW$T$224
    5320                    
    5321                    
    5322                    $C$DW$T$229     .dwtag  DW_TAG_structure_type
    5323                            .dwattr $C$DW$T$229, DW_AT_name(".ggroup1")
    5324                            .dwattr $C$DW$T$229, DW_AT_byte_size(0xdc)
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E4017998-DDBA-48E5-AA2C-4C176E1EA0F7} PAGE   98

    5325                    $C$DW$473       .dwtag  DW_TAG_member
    5326                            .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$225)
    5327                            .dwattr $C$DW$473, DW_AT_name("ledPinHandle")
    5328                            .dwattr $C$DW$473, DW_AT_TI_symbol_name("ledPinHandle")
    5329                            .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5330                            .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    5331                    
    5332                    $C$DW$474       .dwtag  DW_TAG_member
    5333                            .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$226)
    5334                            .dwattr $C$DW$474, DW_AT_name("laserPwm")
    5335                            .dwattr $C$DW$474, DW_AT_TI_symbol_name("laserPwm")
    5336                            .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5337                            .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    5338                    
    5339                    $C$DW$475       .dwtag  DW_TAG_member
    5340                            .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$226)
    5341                            .dwattr $C$DW$475, DW_AT_name("tonePwm")
    5342                            .dwattr $C$DW$475, DW_AT_TI_symbol_name("tonePwm")
    5343                            .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5344                            .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    5345                    
    5346                    $C$DW$476       .dwtag  DW_TAG_member
    5347                            .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$243)
    5348                            .dwattr $C$DW$476, DW_AT_name("ledPinState")
    5349                            .dwattr $C$DW$476, DW_AT_TI_symbol_name("ledPinState")
    5350                            .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5351                            .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    5352                    
    5353                    $C$DW$477       .dwtag  DW_TAG_member
    5354                            .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$227)
    5355                            .dwattr $C$DW$477, DW_AT_name("ledStatus")
    5356                            .dwattr $C$DW$477, DW_AT_TI_symbol_name("ledStatus")
    5357                            .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5358                            .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    5359                    
    5360                    $C$DW$478       .dwtag  DW_TAG_member
    5361                            .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$228)
    5362                            .dwattr $C$DW$478, DW_AT_name("ledPinTable")
    5363                            .dwattr $C$DW$478, DW_AT_TI_symbol_name("ledPinTable")
    5364                            .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5365                            .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    5366                    
    5367                    $C$DW$479       .dwtag  DW_TAG_member
    5368                            .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$279)
    5369                            .dwattr $C$DW$479, DW_AT_name("laserPwmParams")
    5370                            .dwattr $C$DW$479, DW_AT_TI_symbol_name("laserPwmParams")
    5371                            .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5372                            .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    5373                    
    5374                    $C$DW$480       .dwtag  DW_TAG_member
    5375                            .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$279)
    5376                            .dwattr $C$DW$480, DW_AT_name("tonePwmParams")
    5377                            .dwattr $C$DW$480, DW_AT_TI_symbol_name("tonePwmParams")
    5378                            .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    5379                            .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E4017998-DDBA-48E5-AA2C-4C176E1EA0F7} PAGE   99

    5380                    
    5381                    $C$DW$481       .dwtag  DW_TAG_member
    5382                            .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$605)
    5383                            .dwattr $C$DW$481, DW_AT_name("blinkClkStruct")
    5384                            .dwattr $C$DW$481, DW_AT_TI_symbol_name("blinkClkStruct")
    5385                            .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    5386                            .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    5387                    
    5388                    $C$DW$482       .dwtag  DW_TAG_member
    5389                            .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$605)
    5390                            .dwattr $C$DW$482, DW_AT_name("laserClkStruct")
    5391                            .dwattr $C$DW$482, DW_AT_TI_symbol_name("laserClkStruct")
    5392                            .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    5393                            .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    5394                    
    5395                    $C$DW$483       .dwtag  DW_TAG_member
    5396                            .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$605)
    5397                            .dwattr $C$DW$483, DW_AT_name("toneClkStruct")
    5398                            .dwattr $C$DW$483, DW_AT_TI_symbol_name("toneClkStruct")
    5399                            .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    5400                            .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    5401                    
    5402                            .dwendtag $C$DW$T$229
    5403                    
    5404                    
    5405                    $C$DW$T$865     .dwtag  DW_TAG_enumeration_type
    5406                            .dwattr $C$DW$T$865, DW_AT_name("CC13X0_LAUNCHXL_ADCBufName")
    5407                            .dwattr $C$DW$T$865, DW_AT_byte_size(0x01)
    5408                    $C$DW$484       .dwtag  DW_TAG_enumerator
    5409                            .dwattr $C$DW$484, DW_AT_name("CC13X0_LAUNCHXL_ADCBuf0")
    5410                            .dwattr $C$DW$484, DW_AT_const_value(0x00)
    5411                            .dwattr $C$DW$484, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5412                            .dwattr $C$DW$484, DW_AT_decl_line(0x129)
    5413                            .dwattr $C$DW$484, DW_AT_decl_column(0x05)
    5414                    
    5415                    $C$DW$485       .dwtag  DW_TAG_enumerator
    5416                            .dwattr $C$DW$485, DW_AT_name("CC13X0_LAUNCHXL_ADCBufCOUNT")
    5417                            .dwattr $C$DW$485, DW_AT_const_value(0x01)
    5418                            .dwattr $C$DW$485, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5419                            .dwattr $C$DW$485, DW_AT_decl_line(0x12a)
    5420                            .dwattr $C$DW$485, DW_AT_decl_column(0x05)
    5421                    
    5422                            .dwattr $C$DW$T$865, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC1
    5423                            .dwattr $C$DW$T$865, DW_AT_decl_line(0x128)
    5424                            .dwattr $C$DW$T$865, DW_AT_decl_column(0x0e)
    5425                            .dwendtag $C$DW$T$865
    5426                    
    5427                    $C$DW$T$866     .dwtag  DW_TAG_typedef
    5428                            .dwattr $C$DW$T$866, DW_AT_name("CC13X0_LAUNCHXL_ADCBufName")
    5429                            .dwattr $C$DW$T$866, DW_AT_type(*$C$DW$T$865)
    5430                            .dwattr $C$DW$T$866, DW_AT_language(DW_LANG_C)
    5431                            .dwattr $C$DW$T$866, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC1
    5432                            .dwattr $C$DW$T$866, DW_AT_decl_line(0x12b)
    5433                            .dwattr $C$DW$T$866, DW_AT_decl_column(0x03)
    5434                    
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E4017998-DDBA-48E5-AA2C-4C176E1EA0F7} PAGE  100

    5435                    
    5436                    $C$DW$T$867     .dwtag  DW_TAG_enumeration_type
    5437                            .dwattr $C$DW$T$867, DW_AT_name("CC13X0_LAUNCHXL_ADCName")
    5438                            .dwattr $C$DW$T$867, DW_AT_byte_size(0x01)
    5439                    $C$DW$486       .dwtag  DW_TAG_enumerator
    5440                            .dwattr $C$DW$486, DW_AT_name("CC13X0_LAUNCHXL_ADC0")
    5441                            .dwattr $C$DW$486, DW_AT_const_value(0x00)
    5442                            .dwattr $C$DW$486, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5443                            .dwattr $C$DW$486, DW_AT_decl_line(0x133)
    5444                            .dwattr $C$DW$486, DW_AT_decl_column(0x05)
    5445                    
    5446                    $C$DW$487       .dwtag  DW_TAG_enumerator
    5447                            .dwattr $C$DW$487, DW_AT_name("CC13X0_LAUNCHXL_ADC1")
    5448                            .dwattr $C$DW$487, DW_AT_const_value(0x01)
    5449                            .dwattr $C$DW$487, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5450                            .dwattr $C$DW$487, DW_AT_decl_line(0x134)
    5451                            .dwattr $C$DW$487, DW_AT_decl_column(0x05)
    5452                    
    5453                    $C$DW$488       .dwtag  DW_TAG_enumerator
    5454                            .dwattr $C$DW$488, DW_AT_name("CC13X0_LAUNCHXL_ADC2")
    5455                            .dwattr $C$DW$488, DW_AT_const_value(0x02)
    5456                            .dwattr $C$DW$488, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5457                            .dwattr $C$DW$488, DW_AT_decl_line(0x135)
    5458                            .dwattr $C$DW$488, DW_AT_decl_column(0x05)
    5459                    
    5460                    $C$DW$489       .dwtag  DW_TAG_enumerator
    5461                            .dwattr $C$DW$489, DW_AT_name("CC13X0_LAUNCHXL_ADC3")
    5462                            .dwattr $C$DW$489, DW_AT_const_value(0x03)
    5463                            .dwattr $C$DW$489, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5464                            .dwattr $C$DW$489, DW_AT_decl_line(0x136)
    5465                            .dwattr $C$DW$489, DW_AT_decl_column(0x05)
    5466                    
    5467                    $C$DW$490       .dwtag  DW_TAG_enumerator
    5468                            .dwattr $C$DW$490, DW_AT_name("CC13X0_LAUNCHXL_ADC4")
    5469                            .dwattr $C$DW$490, DW_AT_const_value(0x04)
    5470                            .dwattr $C$DW$490, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5471                            .dwattr $C$DW$490, DW_AT_decl_line(0x137)
    5472                            .dwattr $C$DW$490, DW_AT_decl_column(0x05)
    5473                    
    5474                    $C$DW$491       .dwtag  DW_TAG_enumerator
    5475                            .dwattr $C$DW$491, DW_AT_name("CC13X0_LAUNCHXL_ADC5")
    5476                            .dwattr $C$DW$491, DW_AT_const_value(0x05)
    5477                            .dwattr $C$DW$491, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5478                            .dwattr $C$DW$491, DW_AT_decl_line(0x138)
    5479                            .dwattr $C$DW$491, DW_AT_decl_column(0x05)
    5480                    
    5481                    $C$DW$492       .dwtag  DW_TAG_enumerator
    5482                            .dwattr $C$DW$492, DW_AT_name("CC13X0_LAUNCHXL_ADC6")
    5483                            .dwattr $C$DW$492, DW_AT_const_value(0x06)
    5484                            .dwattr $C$DW$492, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5485                            .dwattr $C$DW$492, DW_AT_decl_line(0x139)
    5486                            .dwattr $C$DW$492, DW_AT_decl_column(0x05)
    5487                    
    5488                    $C$DW$493       .dwtag  DW_TAG_enumerator
    5489                            .dwattr $C$DW$493, DW_AT_name("CC13X0_LAUNCHXL_ADC7")
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E4017998-DDBA-48E5-AA2C-4C176E1EA0F7} PAGE  101

    5490                            .dwattr $C$DW$493, DW_AT_const_value(0x07)
    5491                            .dwattr $C$DW$493, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5492                            .dwattr $C$DW$493, DW_AT_decl_line(0x13a)
    5493                            .dwattr $C$DW$493, DW_AT_decl_column(0x05)
    5494                    
    5495                    $C$DW$494       .dwtag  DW_TAG_enumerator
    5496                            .dwattr $C$DW$494, DW_AT_name("CC13X0_LAUNCHXL_ADCDCOUPL")
    5497                            .dwattr $C$DW$494, DW_AT_const_value(0x08)
    5498                            .dwattr $C$DW$494, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5499                            .dwattr $C$DW$494, DW_AT_decl_line(0x13b)
    5500                            .dwattr $C$DW$494, DW_AT_decl_column(0x05)
    5501                    
    5502                    $C$DW$495       .dwtag  DW_TAG_enumerator
    5503                            .dwattr $C$DW$495, DW_AT_name("CC13X0_LAUNCHXL_ADCVSS")
    5504                            .dwattr $C$DW$495, DW_AT_const_value(0x09)
    5505                            .dwattr $C$DW$495, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5506                            .dwattr $C$DW$495, DW_AT_decl_line(0x13c)
    5507                            .dwattr $C$DW$495, DW_AT_decl_column(0x05)
    5508                    
    5509                    $C$DW$496       .dwtag  DW_TAG_enumerator
    5510                            .dwattr $C$DW$496, DW_AT_name("CC13X0_LAUNCHXL_ADCVDDS")
    5511                            .dwattr $C$DW$496, DW_AT_const_value(0x0a)
    5512                            .dwattr $C$DW$496, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5513                            .dwattr $C$DW$496, DW_AT_decl_line(0x13d)
    5514                            .dwattr $C$DW$496, DW_AT_decl_column(0x05)
    5515                    
    5516                    $C$DW$497       .dwtag  DW_TAG_enumerator
    5517                            .dwattr $C$DW$497, DW_AT_name("CC13X0_LAUNCHXL_ADCCOUNT")
    5518                            .dwattr $C$DW$497, DW_AT_const_value(0x0b)
    5519                            .dwattr $C$DW$497, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5520                            .dwattr $C$DW$497, DW_AT_decl_line(0x13e)
    5521                            .dwattr $C$DW$497, DW_AT_decl_column(0x05)
    5522                    
    5523                            .dwattr $C$DW$T$867, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC1
    5524                            .dwattr $C$DW$T$867, DW_AT_decl_line(0x132)
    5525                            .dwattr $C$DW$T$867, DW_AT_decl_column(0x0e)
    5526                            .dwendtag $C$DW$T$867
    5527                    
    5528                    $C$DW$T$868     .dwtag  DW_TAG_typedef
    5529                            .dwattr $C$DW$T$868, DW_AT_name("CC13X0_LAUNCHXL_ADCName")
    5530                            .dwattr $C$DW$T$868, DW_AT_type(*$C$DW$T$867)
    5531                            .dwattr $C$DW$T$868, DW_AT_language(DW_LANG_C)
    5532                            .dwattr $C$DW$T$868, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC1
    5533                            .dwattr $C$DW$T$868, DW_AT_decl_line(0x13f)
    5534                            .dwattr $C$DW$T$868, DW_AT_decl_column(0x03)
    5535                    
    5536                    
    5537                    $C$DW$T$869     .dwtag  DW_TAG_enumeration_type
    5538                            .dwattr $C$DW$T$869, DW_AT_name("CC13X0_LAUNCHXL_CryptoName")
    5539                            .dwattr $C$DW$T$869, DW_AT_byte_size(0x01)
    5540                    $C$DW$498       .dwtag  DW_TAG_enumerator
    5541                            .dwattr $C$DW$498, DW_AT_name("CC13X0_LAUNCHXL_CRYPTO0")
    5542                            .dwattr $C$DW$498, DW_AT_const_value(0x00)
    5543                            .dwattr $C$DW$498, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5544                            .dwattr $C$DW$498, DW_AT_decl_line(0xd0)
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E4017998-DDBA-48E5-AA2C-4C176E1EA0F7} PAGE  102

    5545                            .dwattr $C$DW$498, DW_AT_decl_column(0x05)
    5546                    
    5547                    $C$DW$499       .dwtag  DW_TAG_enumerator
    5548                            .dwattr $C$DW$499, DW_AT_name("CC13X0_LAUNCHXL_CRYPTOCOUNT")
    5549                            .dwattr $C$DW$499, DW_AT_const_value(0x01)
    5550                            .dwattr $C$DW$499, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5551                            .dwattr $C$DW$499, DW_AT_decl_line(0xd2)
    5552                            .dwattr $C$DW$499, DW_AT_decl_column(0x05)
    5553                    
    5554                            .dwattr $C$DW$T$869, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC1
    5555                            .dwattr $C$DW$T$869, DW_AT_decl_line(0xcf)
    5556                            .dwattr $C$DW$T$869, DW_AT_decl_column(0x0e)
    5557                            .dwendtag $C$DW$T$869
    5558                    
    5559                    $C$DW$T$870     .dwtag  DW_TAG_typedef
    5560                            .dwattr $C$DW$T$870, DW_AT_name("CC13X0_LAUNCHXL_CryptoName")
    5561                            .dwattr $C$DW$T$870, DW_AT_type(*$C$DW$T$869)
    5562                            .dwattr $C$DW$T$870, DW_AT_language(DW_LANG_C)
    5563                            .dwattr $C$DW$T$870, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC1
    5564                            .dwattr $C$DW$T$870, DW_AT_decl_line(0xd3)
    5565                            .dwattr $C$DW$T$870, DW_AT_decl_column(0x03)
    5566                    
    5567                    
    5568                    $C$DW$T$871     .dwtag  DW_TAG_enumeration_type
    5569                            .dwattr $C$DW$T$871, DW_AT_name("CC13X0_LAUNCHXL_GPTimerName")
    5570                            .dwattr $C$DW$T$871, DW_AT_byte_size(0x01)
    5571                    $C$DW$500       .dwtag  DW_TAG_enumerator
    5572                            .dwattr $C$DW$500, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER0A")
    5573                            .dwattr $C$DW$500, DW_AT_const_value(0x00)
    5574                            .dwattr $C$DW$500, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5575                            .dwattr $C$DW$500, DW_AT_decl_line(0xfb)
    5576                            .dwattr $C$DW$500, DW_AT_decl_column(0x05)
    5577                    
    5578                    $C$DW$501       .dwtag  DW_TAG_enumerator
    5579                            .dwattr $C$DW$501, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER0B")
    5580                            .dwattr $C$DW$501, DW_AT_const_value(0x01)
    5581                            .dwattr $C$DW$501, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5582                            .dwattr $C$DW$501, DW_AT_decl_line(0xfc)
    5583                            .dwattr $C$DW$501, DW_AT_decl_column(0x05)
    5584                    
    5585                    $C$DW$502       .dwtag  DW_TAG_enumerator
    5586                            .dwattr $C$DW$502, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER1A")
    5587                            .dwattr $C$DW$502, DW_AT_const_value(0x02)
    5588                            .dwattr $C$DW$502, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5589                            .dwattr $C$DW$502, DW_AT_decl_line(0xfd)
    5590                            .dwattr $C$DW$502, DW_AT_decl_column(0x05)
    5591                    
    5592                    $C$DW$503       .dwtag  DW_TAG_enumerator
    5593                            .dwattr $C$DW$503, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER1B")
    5594                            .dwattr $C$DW$503, DW_AT_const_value(0x03)
    5595                            .dwattr $C$DW$503, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5596                            .dwattr $C$DW$503, DW_AT_decl_line(0xfe)
    5597                            .dwattr $C$DW$503, DW_AT_decl_column(0x05)
    5598                    
    5599                    $C$DW$504       .dwtag  DW_TAG_enumerator
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:40 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E4017998-DDBA-48E5-AA2C-4C176E1EA0F7} PAGE  103

    5600                            .dwattr $C$DW$504, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER2A")
    5601                            .dwattr $C$DW$504, DW_AT_const_value(0x04)
    5602                            .dwattr $C$DW$504, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5603                            .dwattr $C$DW$504, DW_AT_decl_line(0xff)
    5604                            .dwattr $C$DW$504, DW_AT_decl_column(0x05)
    5605                    
    5606                    $C$DW$505       .dwtag  DW_TAG_enumerator
    5607                            .dwattr $C$DW$505, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER2B")
    5608                            .dwattr $C$DW$505, DW_AT_const_value(0x05)
    5609                            .dwattr $C$DW$505, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5610                            .dwattr $C$DW$505, DW_AT_decl_line(0x100)
    5611                            .dwattr $C$DW$505, DW_AT_decl_column(0x05)
    5612                    
    5613                    $C$DW$506       .dwtag  DW_TAG_enumerator
    5614                            .dwattr $C$DW$506, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER3A")
    5615                            .dwattr $C$DW$506, DW_AT_const_value(0x06)
    5616                            .dwattr $C$DW$506, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5617                            .dwattr $C$DW$506, DW_AT_decl_line(0x101)
    5618                            .dwattr $C$DW$506, DW_AT_decl_column(0x05)
    5619                    
    5620                    $C$DW$507       .dwtag  DW_TAG_enumerator
    5621                            .dwattr $C$DW$507, DW_AT_name("CC13X0_LAUNCHXL_GPTIMER3B")
    5622                            .dwattr $C$DW$507, DW_AT_const_value(0x07)
    5623                            .dwattr $C$DW$507, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5624                            .dwattr $C$DW$507, DW_AT_decl_line(0x102)
    5625                            .dwattr $C$DW$507, DW_AT_decl_column(0x05)
    5626                    
    5627                    $C$DW$508       .dwtag  DW_TAG_enumerator
    5628                            .dwattr $C$DW$508, DW_AT_name("CC13X0_LAUNCHXL_GPTIMERPARTSCOUNT")
    5629                            .dwattr $C$DW$508, DW_AT_const_value(0x08)
    5630                            .dwattr $C$DW$508, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC131
    5631                            .dwattr $C$DW$508, DW_AT_decl_line(0x103)
    5632                            .dwattr $C$DW$508, DW_AT_decl_column(0x05)
    5633                    
    5634                            .dwattr $C$DW$T$871, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\examples\rtos\CC1
    5635                            .dwattr $C$DW$T$871, DW_AT_decl_line(0xf9)
    5636                            .dwattr $C$DW$T$871, DW_AT_decl_column(0x0e)
    5637                            .dwendtag $C$DW$T$871
    5638                    
    5639                    $C$DW$T$872     .dwtag  DW_TAG_typedef
    5640                            .dwattr $C$DW$T$872, DW_AT_name("CC13X0_LAUNCHXL_GPTimerName")
    5641                            .dwattr $C$DW$T$872, DW_AT_type(*$C$DW$T$871)
    5642                            .dwattr $C$DW$T$872, DW_AT_language(DW_LANG_C)
