TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{187828DC-36B9-4F47-A09C-6A769FE6548F} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Thu Mar 08 21:09:38 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/LaunchPad/CC13X0_LAUNCHXL.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\collector_cc1310lp\collector_cc1
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    1431                            .dwattr $C$DW$95, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
    1432                            .dwattr $C$DW$95, DW_AT_decl_line(0x2de)
    1433                            .dwattr $C$DW$95, DW_AT_decl_column(0x05)
    1434                    
    1435                    $C$DW$96        .dwtag  DW_TAG_enumerator
    1436                            .dwattr $C$DW$96, DW_AT_name("RF_StatSuccess")
    1437                            .dwattr $C$DW$96, DW_AT_const_value(0x83)
    1438                            .dwattr $C$DW$96, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
    1439                            .dwattr $C$DW$96, DW_AT_decl_line(0x2df)
    1440                            .dwattr $C$DW$96, DW_AT_decl_column(0x05)
    1441                    
    1442                            .dwattr $C$DW$T$1193, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/driver
    1443                            .dwattr $C$DW$T$1193, DW_AT_decl_line(0x2d6)
    1444                            .dwattr $C$DW$T$1193, DW_AT_decl_column(0x0e)
    1445                            .dwendtag $C$DW$T$1193
    1446                    
    1447                    $C$DW$T$1194    .dwtag  DW_TAG_typedef
    1448                            .dwattr $C$DW$T$1194, DW_AT_name("RF_Stat")
    1449                            .dwattr $C$DW$T$1194, DW_AT_type(*$C$DW$T$1193)
    1450                            .dwattr $C$DW$T$1194, DW_AT_language(DW_LANG_C)
    1451                            .dwattr $C$DW$T$1194, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/driver
    1452                            .dwattr $C$DW$T$1194, DW_AT_decl_line(0x2e0)
    1453                            .dwattr $C$DW$T$1194, DW_AT_decl_column(0x03)
    1454                    
    1455                    
    1456                    $C$DW$T$1195    .dwtag  DW_TAG_enumeration_type
    1457                            .dwattr $C$DW$T$1195, DW_AT_byte_size(0x01)
    1458                    $C$DW$97        .dwtag  DW_TAG_enumerator
    1459                            .dwattr $C$DW$97, DW_AT_name("RF_GET_CURR_CMD")
    1460                            .dwattr $C$DW$97, DW_AT_const_value(0x00)
    1461                            .dwattr $C$DW$97, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
    1462                            .dwattr $C$DW$97, DW_AT_decl_line(0x3aa)
    1463                            .dwattr $C$DW$97, DW_AT_decl_column(0x05)
    1464                    
    1465                    $C$DW$98        .dwtag  DW_TAG_enumerator
    1466                            .dwattr $C$DW$98, DW_AT_name("RF_GET_AVAIL_RAT_CH")
    1467                            .dwattr $C$DW$98, DW_AT_const_value(0x01)
    1468                            .dwattr $C$DW$98, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
    1469                            .dwattr $C$DW$98, DW_AT_decl_line(0x3ab)
    1470                            .dwattr $C$DW$98, DW_AT_decl_column(0x05)
    1471                    
    1472                    $C$DW$99        .dwtag  DW_TAG_enumerator
    1473                            .dwattr $C$DW$99, DW_AT_name("RF_GET_RADIO_STATE")
    1474                            .dwattr $C$DW$99, DW_AT_const_value(0x02)
    1475                            .dwattr $C$DW$99, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
    1476                            .dwattr $C$DW$99, DW_AT_decl_line(0x3ac)
    1477                            .dwattr $C$DW$99, DW_AT_decl_column(0x05)
    1478                    
    1479                    $C$DW$100       .dwtag  DW_TAG_enumerator
    1480                            .dwattr $C$DW$100, DW_AT_name("RF_GET_SCHEDULE_MAP")
    1481                            .dwattr $C$DW$100, DW_AT_const_value(0x03)
    1482                            .dwattr $C$DW$100, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    1483                            .dwattr $C$DW$100, DW_AT_decl_line(0x3ad)
    1484                            .dwattr $C$DW$100, DW_AT_decl_column(0x05)
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{187828DC-36B9-4F47-A09C-6A769FE6548F} PAGE   28

    1485                    
    1486                            .dwattr $C$DW$T$1195, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/driver
    1487                            .dwattr $C$DW$T$1195, DW_AT_decl_line(0x3a9)
    1488                            .dwattr $C$DW$T$1195, DW_AT_decl_column(0x0e)
    1489                            .dwendtag $C$DW$T$1195
    1490                    
    1491                    $C$DW$T$1196    .dwtag  DW_TAG_typedef
    1492                            .dwattr $C$DW$T$1196, DW_AT_name("RF_InfoType")
    1493                            .dwattr $C$DW$T$1196, DW_AT_type(*$C$DW$T$1195)
    1494                            .dwattr $C$DW$T$1196, DW_AT_language(DW_LANG_C)
    1495                            .dwattr $C$DW$T$1196, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/driver
    1496                            .dwattr $C$DW$T$1196, DW_AT_decl_line(0x3ae)
    1497                            .dwattr $C$DW$T$1196, DW_AT_decl_column(0x03)
    1498                    
    1499                    
    1500                    $C$DW$T$110     .dwtag  DW_TAG_structure_type
    1501                            .dwattr $C$DW$T$110, DW_AT_byte_size(0x04)
    1502                    $C$DW$101       .dwtag  DW_TAG_member
    1503                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$109)
    1504                            .dwattr $C$DW$101, DW_AT_name("hwiCpe0Priority")
    1505                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("hwiCpe0Priority")
    1506                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1507                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1508                            .dwattr $C$DW$101, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    1509                            .dwattr $C$DW$101, DW_AT_decl_line(0x33b)
    1510                            .dwattr $C$DW$101, DW_AT_decl_column(0x15)
    1511                    
    1512                    $C$DW$102       .dwtag  DW_TAG_member
    1513                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$109)
    1514                            .dwattr $C$DW$102, DW_AT_name("hwiHwPriority")
    1515                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("hwiHwPriority")
    1516                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1517                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1518                            .dwattr $C$DW$102, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    1519                            .dwattr $C$DW$102, DW_AT_decl_line(0x33c)
    1520                            .dwattr $C$DW$102, DW_AT_decl_column(0x15)
    1521                    
    1522                    $C$DW$103       .dwtag  DW_TAG_member
    1523                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$109)
    1524                            .dwattr $C$DW$103, DW_AT_name("swiCpe0Priority")
    1525                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("swiCpe0Priority")
    1526                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1527                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1528                            .dwattr $C$DW$103, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    1529                            .dwattr $C$DW$103, DW_AT_decl_line(0x33d)
    1530                            .dwattr $C$DW$103, DW_AT_decl_column(0x15)
    1531                    
    1532                    $C$DW$104       .dwtag  DW_TAG_member
    1533                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$109)
    1534                            .dwattr $C$DW$104, DW_AT_name("swiHwPriority")
    1535                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("swiHwPriority")
    1536                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1537                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1538                            .dwattr $C$DW$104, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    1539                            .dwattr $C$DW$104, DW_AT_decl_line(0x33e)
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{187828DC-36B9-4F47-A09C-6A769FE6548F} PAGE   29

    1540                            .dwattr $C$DW$104, DW_AT_decl_column(0x15)
    1541                    
    1542                            .dwattr $C$DW$T$110, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers
    1543                            .dwattr $C$DW$T$110, DW_AT_decl_line(0x33a)
    1544                            .dwattr $C$DW$T$110, DW_AT_decl_column(0x10)
    1545                            .dwendtag $C$DW$T$110
    1546                    
    1547                    $C$DW$T$1197    .dwtag  DW_TAG_typedef
    1548                            .dwattr $C$DW$T$1197, DW_AT_name("RFCC26XX_HWAttrs")
    1549                            .dwattr $C$DW$T$1197, DW_AT_type(*$C$DW$T$110)
    1550                            .dwattr $C$DW$T$1197, DW_AT_language(DW_LANG_C)
    1551                            .dwattr $C$DW$T$1197, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/driver
    1552                            .dwattr $C$DW$T$1197, DW_AT_decl_line(0x33f)
    1553                            .dwattr $C$DW$T$1197, DW_AT_decl_column(0x03)
    1554                    
    1555                    $C$DW$T$1198    .dwtag  DW_TAG_const_type
    1556                            .dwattr $C$DW$T$1198, DW_AT_type(*$C$DW$T$1197)
    1557                    
    1558                    
    1559                    $C$DW$T$112     .dwtag  DW_TAG_structure_type
    1560                            .dwattr $C$DW$T$112, DW_AT_byte_size(0x08)
    1561                    $C$DW$105       .dwtag  DW_TAG_member
    1562                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$111)
    1563                            .dwattr $C$DW$105, DW_AT_name("fg")
    1564                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("fg")
    1565                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1566                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1567                            .dwattr $C$DW$105, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/display/D
    1568                            .dwattr $C$DW$105, DW_AT_decl_line(0x53)
    1569                            .dwattr $C$DW$105, DW_AT_decl_column(0x0e)
    1570                    
    1571                    $C$DW$106       .dwtag  DW_TAG_member
    1572                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$111)
    1573                            .dwattr $C$DW$106, DW_AT_name("bg")
    1574                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("bg")
    1575                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1576                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1577                            .dwattr $C$DW$106, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/display/D
    1578                            .dwattr $C$DW$106, DW_AT_decl_line(0x54)
    1579                            .dwattr $C$DW$106, DW_AT_decl_column(0x0e)
    1580                    
    1581                            .dwattr $C$DW$T$112, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/display
    1582                            .dwattr $C$DW$T$112, DW_AT_decl_line(0x52)
    1583                            .dwattr $C$DW$T$112, DW_AT_decl_column(0x01)
    1584                            .dwendtag $C$DW$T$112
    1585                    
    1586                    $C$DW$T$418     .dwtag  DW_TAG_typedef
    1587                            .dwattr $C$DW$T$418, DW_AT_name("DisplaySharpColor_t")
    1588                            .dwattr $C$DW$T$418, DW_AT_type(*$C$DW$T$112)
    1589                            .dwattr $C$DW$T$418, DW_AT_language(DW_LANG_C)
    1590                            .dwattr $C$DW$T$418, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/display
    1591                            .dwattr $C$DW$T$418, DW_AT_decl_line(0x55)
    1592                            .dwattr $C$DW$T$418, DW_AT_decl_column(0x03)
    1593                    
    1594                    
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{187828DC-36B9-4F47-A09C-6A769FE6548F} PAGE   30

    1595                    $C$DW$T$116     .dwtag  DW_TAG_structure_type
    1596                            .dwattr $C$DW$T$116, DW_AT_byte_size(0x08)
    1597                    $C$DW$107       .dwtag  DW_TAG_member
    1598                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$10)
    1599                            .dwattr $C$DW$107, DW_AT_name("length")
    1600                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("length")
    1601                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1602                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1603                            .dwattr $C$DW$107, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    1604                            .dwattr $C$DW$107, DW_AT_decl_line(0x36f)
    1605                            .dwattr $C$DW$107, DW_AT_decl_column(0x16)
    1606                    
    1607                    $C$DW$108       .dwtag  DW_TAG_member
    1608                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$115)
    1609                            .dwattr $C$DW$108, DW_AT_name("elem")
    1610                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("elem")
    1611                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1612                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1613                            .dwattr $C$DW$108, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    1614                            .dwattr $C$DW$108, DW_AT_decl_line(0x36f)
    1615                            .dwattr $C$DW$108, DW_AT_decl_column(0x44)
    1616                    
    1617                            .dwattr $C$DW$T$116, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    1618                            .dwattr $C$DW$T$116, DW_AT_decl_line(0x36f)
    1619                            .dwattr $C$DW$T$116, DW_AT_decl_column(0x10)
    1620                            .dwendtag $C$DW$T$116
    1621                    
    1622                    $C$DW$T$1199    .dwtag  DW_TAG_typedef
    1623                            .dwattr $C$DW$T$1199, DW_AT_name("__ARRAY1_ti_sysbios_family_arm_m3_Hwi_hooks")
    1624                            .dwattr $C$DW$T$1199, DW_AT_type(*$C$DW$T$116)
    1625                            .dwattr $C$DW$T$1199, DW_AT_language(DW_LANG_C)
    1626                            .dwattr $C$DW$T$1199, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pa
    1627                            .dwattr $C$DW$T$1199, DW_AT_decl_line(0x36f)
    1628                            .dwattr $C$DW$T$1199, DW_AT_decl_column(0x4c)
    1629                    
    1630                    
    1631                    $C$DW$T$119     .dwtag  DW_TAG_structure_type
    1632                            .dwattr $C$DW$T$119, DW_AT_byte_size(0x08)
    1633                    $C$DW$109       .dwtag  DW_TAG_member
    1634                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$10)
    1635                            .dwattr $C$DW$109, DW_AT_name("length")
    1636                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("length")
    1637                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1638                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1639                            .dwattr $C$DW$109, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    1640                            .dwattr $C$DW$109, DW_AT_decl_line(0x370)
    1641                            .dwattr $C$DW$109, DW_AT_decl_column(0x16)
    1642                    
    1643                    $C$DW$110       .dwtag  DW_TAG_member
    1644                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$118)
    1645                            .dwattr $C$DW$110, DW_AT_name("elem")
    1646                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("elem")
    1647                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1648                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1649                            .dwattr $C$DW$110, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{187828DC-36B9-4F47-A09C-6A769FE6548F} PAGE   31

    1650                            .dwattr $C$DW$110, DW_AT_decl_line(0x370)
    1651                            .dwattr $C$DW$110, DW_AT_decl_column(0x4a)
    1652                    
    1653                            .dwattr $C$DW$T$119, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    1654                            .dwattr $C$DW$T$119, DW_AT_decl_line(0x370)
    1655                            .dwattr $C$DW$T$119, DW_AT_decl_column(0x10)
    1656                            .dwendtag $C$DW$T$119
    1657                    
    1658                    $C$DW$T$1200    .dwtag  DW_TAG_typedef
    1659                            .dwattr $C$DW$T$1200, DW_AT_name("__CARRAY1_ti_sysbios_family_arm_m3_Hwi_hooks")
    1660                            .dwattr $C$DW$T$1200, DW_AT_type(*$C$DW$T$119)
    1661                            .dwattr $C$DW$T$1200, DW_AT_language(DW_LANG_C)
    1662                            .dwattr $C$DW$T$1200, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pa
    1663                            .dwattr $C$DW$T$1200, DW_AT_decl_line(0x370)
    1664                            .dwattr $C$DW$T$1200, DW_AT_decl_column(0x52)
    1665                    
    1666                    $C$DW$T$1201    .dwtag  DW_TAG_typedef
    1667                            .dwattr $C$DW$T$1201, DW_AT_name("CT__ti_sysbios_family_arm_m3_Hwi_hooks")
    1668                            .dwattr $C$DW$T$1201, DW_AT_type(*$C$DW$T$1200)
    1669                            .dwattr $C$DW$T$1201, DW_AT_language(DW_LANG_C)
    1670                            .dwattr $C$DW$T$1201, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pa
    1671                            .dwattr $C$DW$T$1201, DW_AT_decl_line(0x372)
    1672                            .dwattr $C$DW$T$1201, DW_AT_decl_column(0x36)
    1673                    
    1674                    $C$DW$T$1202    .dwtag  DW_TAG_typedef
    1675                            .dwattr $C$DW$T$1202, DW_AT_name("__TA_ti_sysbios_family_arm_m3_Hwi_hooks")
    1676                            .dwattr $C$DW$T$1202, DW_AT_type(*$C$DW$T$1200)
    1677                            .dwattr $C$DW$T$1202, DW_AT_language(DW_LANG_C)
    1678                            .dwattr $C$DW$T$1202, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pa
    1679                            .dwattr $C$DW$T$1202, DW_AT_decl_line(0x371)
    1680                            .dwattr $C$DW$T$1202, DW_AT_decl_column(0x36)
    1681                    
    1682                    
    1683                    $C$DW$T$159     .dwtag  DW_TAG_structure_type
    1684                            .dwattr $C$DW$T$159, DW_AT_byte_size(0x4c)
    1685                    $C$DW$111       .dwtag  DW_TAG_member
    1686                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$123)
    1687                            .dwattr $C$DW$111, DW_AT_name("Crc32")
    1688                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("Crc32")
    1689                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1690                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1691                            .dwattr $C$DW$111, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1692                            .dwattr $C$DW$111, DW_AT_decl_line(0x76)
    1693                            .dwattr $C$DW$111, DW_AT_decl_column(0x25)
    1694                    
    1695                    $C$DW$112       .dwtag  DW_TAG_member
    1696                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$126)
    1697                            .dwattr $C$DW$112, DW_AT_name("FlashGetSize")
    1698                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("FlashGetSize")
    1699                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1700                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1701                            .dwattr $C$DW$112, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1702                            .dwattr $C$DW$112, DW_AT_decl_line(0x77)
    1703                            .dwattr $C$DW$112, DW_AT_decl_column(0x25)
    1704                    
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{187828DC-36B9-4F47-A09C-6A769FE6548F} PAGE   32

    1705                    $C$DW$113       .dwtag  DW_TAG_member
    1706                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$127)
    1707                            .dwattr $C$DW$113, DW_AT_name("GetChipId")
    1708                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("GetChipId")
    1709                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1710                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1711                            .dwattr $C$DW$113, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1712                            .dwattr $C$DW$113, DW_AT_decl_line(0x78)
    1713                            .dwattr $C$DW$113, DW_AT_decl_column(0x25)
    1714                    
    1715                    $C$DW$114       .dwtag  DW_TAG_member
    1716                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$130)
    1717                            .dwattr $C$DW$114, DW_AT_name("ReservedLocation1")
    1718                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("ReservedLocation1")
    1719                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1720                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1721                            .dwattr $C$DW$114, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1722                            .dwattr $C$DW$114, DW_AT_decl_line(0x79)
    1723                            .dwattr $C$DW$114, DW_AT_decl_column(0x25)
    1724                    
    1725                    $C$DW$115       .dwtag  DW_TAG_member
    1726                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$131)
    1727                            .dwattr $C$DW$115, DW_AT_name("ReservedLocation2")
    1728                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("ReservedLocation2")
    1729                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1730                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1731                            .dwattr $C$DW$115, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1732                            .dwattr $C$DW$115, DW_AT_decl_line(0x7a)
    1733                            .dwattr $C$DW$115, DW_AT_decl_column(0x25)
    1734                    
    1735                    $C$DW$116       .dwtag  DW_TAG_member
    1736                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$132)
    1737                            .dwattr $C$DW$116, DW_AT_name("ReservedLocation3")
    1738                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("ReservedLocation3")
    1739                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1740                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1741                            .dwattr $C$DW$116, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1742                            .dwattr $C$DW$116, DW_AT_decl_line(0x7b)
    1743                            .dwattr $C$DW$116, DW_AT_decl_column(0x25)
    1744                    
    1745                    $C$DW$117       .dwtag  DW_TAG_member
    1746                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$135)
    1747                            .dwattr $C$DW$117, DW_AT_name("ResetDevice")
    1748                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("ResetDevice")
    1749                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1750                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1751                            .dwattr $C$DW$117, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1752                            .dwattr $C$DW$117, DW_AT_decl_line(0x7c)
    1753                            .dwattr $C$DW$117, DW_AT_decl_column(0x25)
    1754                    
    1755                    $C$DW$118       .dwtag  DW_TAG_member
    1756                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$140)
    1757                            .dwattr $C$DW$118, DW_AT_name("Fletcher32")
    1758                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("Fletcher32")
    1759                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{187828DC-36B9-4F47-A09C-6A769FE6548F} PAGE   33

    1760                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1761                            .dwattr $C$DW$118, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1762                            .dwattr $C$DW$118, DW_AT_decl_line(0x7d)
    1763                            .dwattr $C$DW$118, DW_AT_decl_column(0x25)
    1764                    
    1765                    $C$DW$119       .dwtag  DW_TAG_member
    1766                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$144)
    1767                            .dwattr $C$DW$119, DW_AT_name("MinValue")
    1768                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("MinValue")
    1769                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1770                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1771                            .dwattr $C$DW$119, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1772                            .dwattr $C$DW$119, DW_AT_decl_line(0x7e)
    1773                            .dwattr $C$DW$119, DW_AT_decl_column(0x25)
    1774                    
    1775                    $C$DW$120       .dwtag  DW_TAG_member
    1776                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$145)
    1777                            .dwattr $C$DW$120, DW_AT_name("MaxValue")
    1778                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("MaxValue")
    1779                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1780                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1781                            .dwattr $C$DW$120, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1782                            .dwattr $C$DW$120, DW_AT_decl_line(0x7f)
    1783                            .dwattr $C$DW$120, DW_AT_decl_column(0x25)
    1784                    
    1785                    $C$DW$121       .dwtag  DW_TAG_member
    1786                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$146)
    1787                            .dwattr $C$DW$121, DW_AT_name("MeanValue")
    1788                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("MeanValue")
    1789                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1790                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1791                            .dwattr $C$DW$121, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1792                            .dwattr $C$DW$121, DW_AT_decl_line(0x80)
    1793                            .dwattr $C$DW$121, DW_AT_decl_column(0x25)
    1794                    
    1795                    $C$DW$122       .dwtag  DW_TAG_member
    1796                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$147)
    1797                            .dwattr $C$DW$122, DW_AT_name("StandDeviationValue")
    1798                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("StandDeviationValue")
    1799                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1800                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1801                            .dwattr $C$DW$122, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1802                            .dwattr $C$DW$122, DW_AT_decl_line(0x81)
    1803                            .dwattr $C$DW$122, DW_AT_decl_column(0x25)
    1804                    
    1805                    $C$DW$123       .dwtag  DW_TAG_member
    1806                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$150)
    1807                            .dwattr $C$DW$123, DW_AT_name("ReservedLocation4")
    1808                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("ReservedLocation4")
    1809                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1810                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1811                            .dwattr $C$DW$123, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1812                            .dwattr $C$DW$123, DW_AT_decl_line(0x82)
    1813                            .dwattr $C$DW$123, DW_AT_decl_column(0x25)
    1814                    
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{187828DC-36B9-4F47-A09C-6A769FE6548F} PAGE   34

    1815                    $C$DW$124       .dwtag  DW_TAG_member
    1816                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$151)
    1817                            .dwattr $C$DW$124, DW_AT_name("ReservedLocation5")
    1818                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("ReservedLocation5")
    1819                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1820                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1821                            .dwattr $C$DW$124, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1822                            .dwattr $C$DW$124, DW_AT_decl_line(0x83)
    1823                            .dwattr $C$DW$124, DW_AT_decl_column(0x25)
    1824                    
    1825                    $C$DW$125       .dwtag  DW_TAG_member
    1826                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$152)
    1827                            .dwattr $C$DW$125, DW_AT_name("HFSourceSafeSwitch")
    1828                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    1829                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1830                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1831                            .dwattr $C$DW$125, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1832                            .dwattr $C$DW$125, DW_AT_decl_line(0x84)
    1833                            .dwattr $C$DW$125, DW_AT_decl_column(0x25)
    1834                    
    1835                    $C$DW$126       .dwtag  DW_TAG_member
    1836                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$155)
    1837                            .dwattr $C$DW$126, DW_AT_name("SelectCompAInput")
    1838                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("SelectCompAInput")
    1839                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1840                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1841                            .dwattr $C$DW$126, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1842                            .dwattr $C$DW$126, DW_AT_decl_line(0x85)
    1843                            .dwattr $C$DW$126, DW_AT_decl_column(0x25)
    1844                    
    1845                    $C$DW$127       .dwtag  DW_TAG_member
    1846                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$156)
    1847                            .dwattr $C$DW$127, DW_AT_name("SelectCompARef")
    1848                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("SelectCompARef")
    1849                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1850                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1851                            .dwattr $C$DW$127, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1852                            .dwattr $C$DW$127, DW_AT_decl_line(0x86)
    1853                            .dwattr $C$DW$127, DW_AT_decl_column(0x25)
    1854                    
    1855                    $C$DW$128       .dwtag  DW_TAG_member
    1856                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$157)
    1857                            .dwattr $C$DW$128, DW_AT_name("SelectADCCompBInput")
    1858                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("SelectADCCompBInput")
    1859                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1860                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1861                            .dwattr $C$DW$128, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1862                            .dwattr $C$DW$128, DW_AT_decl_line(0x87)
    1863                            .dwattr $C$DW$128, DW_AT_decl_column(0x25)
    1864                    
    1865                    $C$DW$129       .dwtag  DW_TAG_member
    1866                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$158)
    1867                            .dwattr $C$DW$129, DW_AT_name("SelectCompBRef")
    1868                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("SelectCompBRef")
    1869                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{187828DC-36B9-4F47-A09C-6A769FE6548F} PAGE   35

    1870                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1871                            .dwattr $C$DW$129, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1872                            .dwattr $C$DW$129, DW_AT_decl_line(0x88)
    1873                            .dwattr $C$DW$129, DW_AT_decl_column(0x25)
    1874                    
    1875                            .dwattr $C$DW$T$159, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    1876                            .dwattr $C$DW$T$159, DW_AT_decl_line(0x75)
    1877                            .dwattr $C$DW$T$159, DW_AT_decl_column(0x01)
    1878                            .dwendtag $C$DW$T$159
    1879                    
    1880                    $C$DW$T$1203    .dwtag  DW_TAG_typedef
    1881                            .dwattr $C$DW$T$1203, DW_AT_name("HARD_API_T")
    1882                            .dwattr $C$DW$T$1203, DW_AT_type(*$C$DW$T$159)
    1883                            .dwattr $C$DW$T$1203, DW_AT_language(DW_LANG_C)
    1884                            .dwattr $C$DW$T$1203, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\device
    1885                            .dwattr $C$DW$T$1203, DW_AT_decl_line(0x89)
    1886                            .dwattr $C$DW$T$1203, DW_AT_decl_column(0x03)
    1887                    
    1888                    
    1889                    $C$DW$T$163     .dwtag  DW_TAG_structure_type
    1890                            .dwattr $C$DW$T$163, DW_AT_byte_size(0x10)
    1891                    $C$DW$130       .dwtag  DW_TAG_member
    1892                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$161)
    1893                            .dwattr $C$DW$130, DW_AT_name("pvSrcEndAddr")
    1894                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("pvSrcEndAddr")
    1895                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1896                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1897                            .dwattr $C$DW$130, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1898                            .dwattr $C$DW$130, DW_AT_decl_line(0x69)
    1899                            .dwattr $C$DW$130, DW_AT_decl_column(0x14)
    1900                    
    1901                    $C$DW$131       .dwtag  DW_TAG_member
    1902                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$161)
    1903                            .dwattr $C$DW$131, DW_AT_name("pvDstEndAddr")
    1904                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("pvDstEndAddr")
    1905                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1906                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1907                            .dwattr $C$DW$131, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1908                            .dwattr $C$DW$131, DW_AT_decl_line(0x6a)
    1909                            .dwattr $C$DW$131, DW_AT_decl_column(0x14)
    1910                    
    1911                    $C$DW$132       .dwtag  DW_TAG_member
    1912                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$162)
    1913                            .dwattr $C$DW$132, DW_AT_name("ui32Control")
    1914                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("ui32Control")
    1915                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1916                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1917                            .dwattr $C$DW$132, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1918                            .dwattr $C$DW$132, DW_AT_decl_line(0x6b)
    1919                            .dwattr $C$DW$132, DW_AT_decl_column(0x17)
    1920                    
    1921                    $C$DW$133       .dwtag  DW_TAG_member
    1922                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$162)
    1923                            .dwattr $C$DW$133, DW_AT_name("ui32Spare")
    1924                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("ui32Spare")
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{187828DC-36B9-4F47-A09C-6A769FE6548F} PAGE   36

    1925                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1926                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1927                            .dwattr $C$DW$133, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1928                            .dwattr $C$DW$133, DW_AT_decl_line(0x6c)
    1929                            .dwattr $C$DW$133, DW_AT_decl_column(0x17)
    1930                    
    1931                            .dwattr $C$DW$T$163, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    1932                            .dwattr $C$DW$T$163, DW_AT_decl_line(0x68)
    1933                            .dwattr $C$DW$T$163, DW_AT_decl_column(0x01)
    1934                            .dwendtag $C$DW$T$163
    1935                    
    1936                    $C$DW$T$1204    .dwtag  DW_TAG_typedef
    1937                            .dwattr $C$DW$T$1204, DW_AT_name("tDMAControlTable")
    1938                            .dwattr $C$DW$T$1204, DW_AT_type(*$C$DW$T$163)
    1939                            .dwattr $C$DW$T$1204, DW_AT_language(DW_LANG_C)
    1940                            .dwattr $C$DW$T$1204, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/device
    1941                            .dwattr $C$DW$T$1204, DW_AT_decl_line(0x6e)
    1942                            .dwattr $C$DW$T$1204, DW_AT_decl_column(0x01)
    1943                    
    1944                    
    1945                    $C$DW$T$164     .dwtag  DW_TAG_structure_type
    1946                            .dwattr $C$DW$T$164, DW_AT_byte_size(0x08)
    1947                    $C$DW$134       .dwtag  DW_TAG_member
    1948                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$120)
    1949                            .dwattr $C$DW$134, DW_AT_name("pCurrEntry")
    1950                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("pCurrEntry")
    1951                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1952                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1953                            .dwattr $C$DW$134, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1954                            .dwattr $C$DW$134, DW_AT_decl_line(0x41)
    1955                            .dwattr $C$DW$134, DW_AT_decl_column(0x0d)
    1956                    
    1957                    $C$DW$135       .dwtag  DW_TAG_member
    1958                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$120)
    1959                            .dwattr $C$DW$135, DW_AT_name("pLastEntry")
    1960                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("pLastEntry")
    1961                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1962                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1963                            .dwattr $C$DW$135, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1964                            .dwattr $C$DW$135, DW_AT_decl_line(0x42)
    1965                            .dwattr $C$DW$135, DW_AT_decl_column(0x0d)
    1966                    
    1967                            .dwattr $C$DW$T$164, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    1968                            .dwattr $C$DW$T$164, DW_AT_decl_line(0x40)
    1969                            .dwattr $C$DW$T$164, DW_AT_decl_column(0x10)
    1970                            .dwendtag $C$DW$T$164
    1971                    
    1972                    $C$DW$T$757     .dwtag  DW_TAG_typedef
    1973                            .dwattr $C$DW$T$757, DW_AT_name("dataQueue_t")
    1974                            .dwattr $C$DW$T$757, DW_AT_type(*$C$DW$T$164)
    1975                            .dwattr $C$DW$T$757, DW_AT_language(DW_LANG_C)
    1976                            .dwattr $C$DW$T$757, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    1977                            .dwattr $C$DW$T$757, DW_AT_decl_line(0x43)
    1978                            .dwattr $C$DW$T$757, DW_AT_decl_column(0x03)
    1979                    
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{187828DC-36B9-4F47-A09C-6A769FE6548F} PAGE   37

    1980                    $C$DW$T$758     .dwtag  DW_TAG_pointer_type
    1981                            .dwattr $C$DW$T$758, DW_AT_type(*$C$DW$T$757)
    1982                            .dwattr $C$DW$T$758, DW_AT_address_class(0x20)
    1983                    
    1984                    
    1985                    $C$DW$T$165     .dwtag  DW_TAG_structure_type
    1986                            .dwattr $C$DW$T$165, DW_AT_byte_size(0x01)
    1987                    $C$DW$136       .dwtag  DW_TAG_member
    1988                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$109)
    1989                            .dwattr $C$DW$136, DW_AT_name("triggerType")
    1990                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("triggerType")
    1991                            .dwattr $C$DW$136, DW_AT_bit_offset(0x04)
    1992                            .dwattr $C$DW$136, DW_AT_bit_size(0x04)
    1993                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1994                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1995                            .dwattr $C$DW$136, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1996                            .dwattr $C$DW$136, DW_AT_decl_line(0x77)
    1997                            .dwattr $C$DW$136, DW_AT_decl_column(0x0f)
    1998                    
    1999                    $C$DW$137       .dwtag  DW_TAG_member
    2000                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$109)
    2001                            .dwattr $C$DW$137, DW_AT_name("bEnaCmd")
    2002                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("bEnaCmd")
    2003                            .dwattr $C$DW$137, DW_AT_bit_offset(0x03)
    2004                            .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    2005                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2006                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2007                            .dwattr $C$DW$137, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2008                            .dwattr $C$DW$137, DW_AT_decl_line(0x78)
    2009                            .dwattr $C$DW$137, DW_AT_decl_column(0x0f)
    2010                    
    2011                    $C$DW$138       .dwtag  DW_TAG_member
    2012                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$109)
    2013                            .dwattr $C$DW$138, DW_AT_name("triggerNo")
    2014                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("triggerNo")
    2015                            .dwattr $C$DW$138, DW_AT_bit_offset(0x01)
    2016                            .dwattr $C$DW$138, DW_AT_bit_size(0x02)
    2017                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2018                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2019                            .dwattr $C$DW$138, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2020                            .dwattr $C$DW$138, DW_AT_decl_line(0x7a)
    2021                            .dwattr $C$DW$138, DW_AT_decl_column(0x0f)
    2022                    
    2023                    $C$DW$139       .dwtag  DW_TAG_member
    2024                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$109)
    2025                            .dwattr $C$DW$139, DW_AT_name("pastTrig")
    2026                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("pastTrig")
    2027                            .dwattr $C$DW$139, DW_AT_bit_offset(0x00)
    2028                            .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    2029                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2030                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2031                            .dwattr $C$DW$139, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2032                            .dwattr $C$DW$139, DW_AT_decl_line(0x7b)
    2033                            .dwattr $C$DW$139, DW_AT_decl_column(0x0f)
    2034                    
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{187828DC-36B9-4F47-A09C-6A769FE6548F} PAGE   38

    2035                            .dwattr $C$DW$T$165, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2036                            .dwattr $C$DW$T$165, DW_AT_decl_line(0x76)
    2037                            .dwattr $C$DW$T$165, DW_AT_decl_column(0x0b)
    2038                            .dwendtag $C$DW$T$165
    2039                    
    2040                    
    2041                    $C$DW$T$166     .dwtag  DW_TAG_structure_type
    2042                            .dwattr $C$DW$T$166, DW_AT_byte_size(0x01)
    2043                    $C$DW$140       .dwtag  DW_TAG_member
    2044                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$109)
    2045                            .dwattr $C$DW$140, DW_AT_name("rule")
    2046                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("rule")
    2047                            .dwattr $C$DW$140, DW_AT_bit_offset(0x04)
    2048                            .dwattr $C$DW$140, DW_AT_bit_size(0x04)
    2049                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2050                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2051                            .dwattr $C$DW$140, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2052                            .dwattr $C$DW$140, DW_AT_decl_line(0x7f)
    2053                            .dwattr $C$DW$140, DW_AT_decl_column(0x0f)
    2054                    
    2055                    $C$DW$141       .dwtag  DW_TAG_member
    2056                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$109)
    2057                            .dwattr $C$DW$141, DW_AT_name("nSkip")
    2058                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("nSkip")
    2059                            .dwattr $C$DW$141, DW_AT_bit_offset(0x00)
    2060                            .dwattr $C$DW$141, DW_AT_bit_size(0x04)
    2061                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2062                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2063                            .dwattr $C$DW$141, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2064                            .dwattr $C$DW$141, DW_AT_decl_line(0x80)
    2065                            .dwattr $C$DW$141, DW_AT_decl_column(0x0f)
    2066                    
    2067                            .dwattr $C$DW$T$166, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2068                            .dwattr $C$DW$T$166, DW_AT_decl_line(0x7e)
    2069                            .dwattr $C$DW$T$166, DW_AT_decl_column(0x0b)
    2070                            .dwendtag $C$DW$T$166
    2071                    
    2072                    
    2073                    $C$DW$T$167     .dwtag  DW_TAG_structure_type
    2074                            .dwattr $C$DW$T$167, DW_AT_byte_size(0x01)
    2075                    $C$DW$142       .dwtag  DW_TAG_member
    2076                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$109)
    2077                            .dwattr $C$DW$142, DW_AT_name("triggerType")
    2078                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("triggerType")
    2079                            .dwattr $C$DW$142, DW_AT_bit_offset(0x04)
    2080                            .dwattr $C$DW$142, DW_AT_bit_size(0x04)
    2081                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2082                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2083                            .dwattr $C$DW$142, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2084                            .dwattr $C$DW$142, DW_AT_decl_line(0x92)
    2085                            .dwattr $C$DW$142, DW_AT_decl_column(0x0f)
    2086                    
    2087                    $C$DW$143       .dwtag  DW_TAG_member
    2088                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$109)
    2089                            .dwattr $C$DW$143, DW_AT_name("bEnaCmd")
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{187828DC-36B9-4F47-A09C-6A769FE6548F} PAGE   39

    2090                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("bEnaCmd")
    2091                            .dwattr $C$DW$143, DW_AT_bit_offset(0x03)
    2092                            .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    2093                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2094                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2095                            .dwattr $C$DW$143, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2096                            .dwattr $C$DW$143, DW_AT_decl_line(0x93)
    2097                            .dwattr $C$DW$143, DW_AT_decl_column(0x0f)
    2098                    
    2099                    $C$DW$144       .dwtag  DW_TAG_member
    2100                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$109)
    2101                            .dwattr $C$DW$144, DW_AT_name("triggerNo")
    2102                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("triggerNo")
    2103                            .dwattr $C$DW$144, DW_AT_bit_offset(0x01)
    2104                            .dwattr $C$DW$144, DW_AT_bit_size(0x02)
    2105                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2106                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2107                            .dwattr $C$DW$144, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2108                            .dwattr $C$DW$144, DW_AT_decl_line(0x95)
    2109                            .dwattr $C$DW$144, DW_AT_decl_column(0x0f)
    2110                    
    2111                    $C$DW$145       .dwtag  DW_TAG_member
    2112                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$109)
    2113                            .dwattr $C$DW$145, DW_AT_name("pastTrig")
    2114                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("pastTrig")
    2115                            .dwattr $C$DW$145, DW_AT_bit_offset(0x00)
    2116                            .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    2117                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2118                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2119                            .dwattr $C$DW$145, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2120                            .dwattr $C$DW$145, DW_AT_decl_line(0x96)
    2121                            .dwattr $C$DW$145, DW_AT_decl_column(0x0f)
    2122                    
    2123                            .dwattr $C$DW$T$167, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2124                            .dwattr $C$DW$T$167, DW_AT_decl_line(0x91)
    2125                            .dwattr $C$DW$T$167, DW_AT_decl_column(0x0b)
    2126                            .dwendtag $C$DW$T$167
    2127                    
    2128                    
    2129                    $C$DW$T$168     .dwtag  DW_TAG_structure_type
    2130                            .dwattr $C$DW$T$168, DW_AT_byte_size(0x01)
    2131                    $C$DW$146       .dwtag  DW_TAG_member
    2132                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$109)
    2133                            .dwattr $C$DW$146, DW_AT_name("rule")
    2134                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("rule")
    2135                            .dwattr $C$DW$146, DW_AT_bit_offset(0x04)
    2136                            .dwattr $C$DW$146, DW_AT_bit_size(0x04)
    2137                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2138                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2139                            .dwattr $C$DW$146, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2140                            .dwattr $C$DW$146, DW_AT_decl_line(0x9a)
    2141                            .dwattr $C$DW$146, DW_AT_decl_column(0x0f)
    2142                    
    2143                    $C$DW$147       .dwtag  DW_TAG_member
    2144                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$109)
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{187828DC-36B9-4F47-A09C-6A769FE6548F} PAGE   40

    2145                            .dwattr $C$DW$147, DW_AT_name("nSkip")
    2146                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("nSkip")
    2147                            .dwattr $C$DW$147, DW_AT_bit_offset(0x00)
    2148                            .dwattr $C$DW$147, DW_AT_bit_size(0x04)
    2149                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2150                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2151                            .dwattr $C$DW$147, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2152                            .dwattr $C$DW$147, DW_AT_decl_line(0x9b)
    2153                            .dwattr $C$DW$147, DW_AT_decl_column(0x0f)
    2154                    
    2155                            .dwattr $C$DW$T$168, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2156                            .dwattr $C$DW$T$168, DW_AT_decl_line(0x99)
    2157                            .dwattr $C$DW$T$168, DW_AT_decl_column(0x0b)
    2158                            .dwendtag $C$DW$T$168
    2159                    
    2160                    
    2161                    $C$DW$T$169     .dwtag  DW_TAG_structure_type
    2162                            .dwattr $C$DW$T$169, DW_AT_byte_size(0x01)
    2163                    $C$DW$148       .dwtag  DW_TAG_member
    2164                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$109)
    2165                            .dwattr $C$DW$148, DW_AT_name("triggerType")
    2166                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("triggerType")
    2167                            .dwattr $C$DW$148, DW_AT_bit_offset(0x04)
    2168                            .dwattr $C$DW$148, DW_AT_bit_size(0x04)
    2169                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2170                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2171                            .dwattr $C$DW$148, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2172                            .dwattr $C$DW$148, DW_AT_decl_line(0xad)
    2173                            .dwattr $C$DW$148, DW_AT_decl_column(0x0f)
    2174                    
    2175                    $C$DW$149       .dwtag  DW_TAG_member
    2176                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$109)
    2177                            .dwattr $C$DW$149, DW_AT_name("bEnaCmd")
    2178                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("bEnaCmd")
    2179                            .dwattr $C$DW$149, DW_AT_bit_offset(0x03)
    2180                            .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    2181                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2182                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2183                            .dwattr $C$DW$149, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2184                            .dwattr $C$DW$149, DW_AT_decl_line(0xae)
    2185                            .dwattr $C$DW$149, DW_AT_decl_column(0x0f)
    2186                    
    2187                    $C$DW$150       .dwtag  DW_TAG_member
    2188                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$109)
    2189                            .dwattr $C$DW$150, DW_AT_name("triggerNo")
    2190                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("triggerNo")
    2191                            .dwattr $C$DW$150, DW_AT_bit_offset(0x01)
    2192                            .dwattr $C$DW$150, DW_AT_bit_size(0x02)
    2193                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2194                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2195                            .dwattr $C$DW$150, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2196                            .dwattr $C$DW$150, DW_AT_decl_line(0xb0)
    2197                            .dwattr $C$DW$150, DW_AT_decl_column(0x0f)
    2198                    
    2199                    $C$DW$151       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{187828DC-36B9-4F47-A09C-6A769FE6548F} PAGE   41

    2200                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$109)
    2201                            .dwattr $C$DW$151, DW_AT_name("pastTrig")
    2202                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("pastTrig")
    2203                            .dwattr $C$DW$151, DW_AT_bit_offset(0x00)
    2204                            .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    2205                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2206                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2207                            .dwattr $C$DW$151, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2208                            .dwattr $C$DW$151, DW_AT_decl_line(0xb1)
    2209                            .dwattr $C$DW$151, DW_AT_decl_column(0x0f)
    2210                    
    2211                            .dwattr $C$DW$T$169, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2212                            .dwattr $C$DW$T$169, DW_AT_decl_line(0xac)
    2213                            .dwattr $C$DW$T$169, DW_AT_decl_column(0x0b)
    2214                            .dwendtag $C$DW$T$169
    2215                    
    2216                    
    2217                    $C$DW$T$170     .dwtag  DW_TAG_structure_type
    2218                            .dwattr $C$DW$T$170, DW_AT_byte_size(0x01)
    2219                    $C$DW$152       .dwtag  DW_TAG_member
    2220                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$109)
    2221                            .dwattr $C$DW$152, DW_AT_name("rule")
    2222                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("rule")
    2223                            .dwattr $C$DW$152, DW_AT_bit_offset(0x04)
    2224                            .dwattr $C$DW$152, DW_AT_bit_size(0x04)
    2225                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2226                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2227                            .dwattr $C$DW$152, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2228                            .dwattr $C$DW$152, DW_AT_decl_line(0xb5)
    2229                            .dwattr $C$DW$152, DW_AT_decl_column(0x0f)
    2230                    
    2231                    $C$DW$153       .dwtag  DW_TAG_member
    2232                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$109)
    2233                            .dwattr $C$DW$153, DW_AT_name("nSkip")
    2234                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("nSkip")
    2235                            .dwattr $C$DW$153, DW_AT_bit_offset(0x00)
    2236                            .dwattr $C$DW$153, DW_AT_bit_size(0x04)
    2237                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2238                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2239                            .dwattr $C$DW$153, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2240                            .dwattr $C$DW$153, DW_AT_decl_line(0xb6)
    2241                            .dwattr $C$DW$153, DW_AT_decl_column(0x0f)
    2242                    
    2243                            .dwattr $C$DW$T$170, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2244                            .dwattr $C$DW$T$170, DW_AT_decl_line(0xb4)
    2245                            .dwattr $C$DW$T$170, DW_AT_decl_column(0x0b)
    2246                            .dwendtag $C$DW$T$170
    2247                    
    2248                    
    2249                    $C$DW$T$171     .dwtag  DW_TAG_structure_type
    2250                            .dwattr $C$DW$T$171, DW_AT_byte_size(0x02)
    2251                    $C$DW$154       .dwtag  DW_TAG_member
    2252                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$136)
    2253                            .dwattr $C$DW$154, DW_AT_name("frontEndMode")
    2254                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("frontEndMode")
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{187828DC-36B9-4F47-A09C-6A769FE6548F} PAGE   42

    2255                            .dwattr $C$DW$154, DW_AT_bit_offset(0x0d)
    2256                            .dwattr $C$DW$154, DW_AT_bit_size(0x03)
    2257                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2258                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2259                            .dwattr $C$DW$154, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2260                            .dwattr $C$DW$154, DW_AT_decl_line(0xc3)
    2261                            .dwattr $C$DW$154, DW_AT_decl_column(0x10)
    2262                    
    2263                    $C$DW$155       .dwtag  DW_TAG_member
    2264                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$136)
    2265                            .dwattr $C$DW$155, DW_AT_name("biasMode")
    2266                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("biasMode")
    2267                            .dwattr $C$DW$155, DW_AT_bit_offset(0x0c)
    2268                            .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    2269                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2270                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2271                            .dwattr $C$DW$155, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2272                            .dwattr $C$DW$155, DW_AT_decl_line(0xc9)
    2273                            .dwattr $C$DW$155, DW_AT_decl_column(0x10)
    2274                    
    2275                    $C$DW$156       .dwtag  DW_TAG_member
    2276                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$136)
    2277                            .dwattr $C$DW$156, DW_AT_name("analogCfgMode")
    2278                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("analogCfgMode")
    2279                            .dwattr $C$DW$156, DW_AT_bit_offset(0x06)
    2280                            .dwattr $C$DW$156, DW_AT_bit_size(0x06)
    2281                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2282                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2283                            .dwattr $C$DW$156, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2284                            .dwattr $C$DW$156, DW_AT_decl_line(0xcb)
    2285                            .dwattr $C$DW$156, DW_AT_decl_column(0x10)
    2286                    
    2287                    $C$DW$157       .dwtag  DW_TAG_member
    2288                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$136)
    2289                            .dwattr $C$DW$157, DW_AT_name("bNoFsPowerUp")
    2290                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("bNoFsPowerUp")
    2291                            .dwattr $C$DW$157, DW_AT_bit_offset(0x05)
    2292                            .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    2293                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2294                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2295                            .dwattr $C$DW$157, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2296                            .dwattr $C$DW$157, DW_AT_decl_line(0xd2)
    2297                            .dwattr $C$DW$157, DW_AT_decl_column(0x10)
    2298                    
    2299                            .dwattr $C$DW$T$171, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2300                            .dwattr $C$DW$T$171, DW_AT_decl_line(0xc2)
    2301                            .dwattr $C$DW$T$171, DW_AT_decl_column(0x0b)
    2302                            .dwendtag $C$DW$T$171
    2303                    
    2304                    
    2305                    $C$DW$T$172     .dwtag  DW_TAG_structure_type
    2306                            .dwattr $C$DW$T$172, DW_AT_byte_size(0x01)
    2307                    $C$DW$158       .dwtag  DW_TAG_member
    2308                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$109)
    2309                            .dwattr $C$DW$158, DW_AT_name("triggerType")
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{187828DC-36B9-4F47-A09C-6A769FE6548F} PAGE   43

    2310                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("triggerType")
    2311                            .dwattr $C$DW$158, DW_AT_bit_offset(0x04)
    2312                            .dwattr $C$DW$158, DW_AT_bit_size(0x04)
    2313                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2314                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2315                            .dwattr $C$DW$158, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2316                            .dwattr $C$DW$158, DW_AT_decl_line(0xe8)
    2317                            .dwattr $C$DW$158, DW_AT_decl_column(0x0f)
    2318                    
    2319                    $C$DW$159       .dwtag  DW_TAG_member
    2320                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$109)
    2321                            .dwattr $C$DW$159, DW_AT_name("bEnaCmd")
    2322                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("bEnaCmd")
    2323                            .dwattr $C$DW$159, DW_AT_bit_offset(0x03)
    2324                            .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    2325                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2326                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2327                            .dwattr $C$DW$159, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2328                            .dwattr $C$DW$159, DW_AT_decl_line(0xe9)
    2329                            .dwattr $C$DW$159, DW_AT_decl_column(0x0f)
    2330                    
    2331                    $C$DW$160       .dwtag  DW_TAG_member
    2332                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$109)
    2333                            .dwattr $C$DW$160, DW_AT_name("triggerNo")
    2334                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("triggerNo")
    2335                            .dwattr $C$DW$160, DW_AT_bit_offset(0x01)
    2336                            .dwattr $C$DW$160, DW_AT_bit_size(0x02)
    2337                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2338                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2339                            .dwattr $C$DW$160, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2340                            .dwattr $C$DW$160, DW_AT_decl_line(0xeb)
    2341                            .dwattr $C$DW$160, DW_AT_decl_column(0x0f)
    2342                    
    2343                    $C$DW$161       .dwtag  DW_TAG_member
    2344                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$109)
    2345                            .dwattr $C$DW$161, DW_AT_name("pastTrig")
    2346                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("pastTrig")
    2347                            .dwattr $C$DW$161, DW_AT_bit_offset(0x00)
    2348                            .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    2349                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2350                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2351                            .dwattr $C$DW$161, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2352                            .dwattr $C$DW$161, DW_AT_decl_line(0xec)
    2353                            .dwattr $C$DW$161, DW_AT_decl_column(0x0f)
    2354                    
    2355                            .dwattr $C$DW$T$172, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2356                            .dwattr $C$DW$T$172, DW_AT_decl_line(0xe7)
    2357                            .dwattr $C$DW$T$172, DW_AT_decl_column(0x0b)
    2358                            .dwendtag $C$DW$T$172
    2359                    
    2360                    
    2361                    $C$DW$T$173     .dwtag  DW_TAG_structure_type
    2362                            .dwattr $C$DW$T$173, DW_AT_byte_size(0x01)
    2363                    $C$DW$162       .dwtag  DW_TAG_member
    2364                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$109)
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{187828DC-36B9-4F47-A09C-6A769FE6548F} PAGE   44

    2365                            .dwattr $C$DW$162, DW_AT_name("rule")
    2366                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("rule")
    2367                            .dwattr $C$DW$162, DW_AT_bit_offset(0x04)
    2368                            .dwattr $C$DW$162, DW_AT_bit_size(0x04)
    2369                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2370                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2371                            .dwattr $C$DW$162, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2372                            .dwattr $C$DW$162, DW_AT_decl_line(0xf0)
    2373                            .dwattr $C$DW$162, DW_AT_decl_column(0x0f)
    2374                    
    2375                    $C$DW$163       .dwtag  DW_TAG_member
    2376                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$109)
    2377                            .dwattr $C$DW$163, DW_AT_name("nSkip")
    2378                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("nSkip")
    2379                            .dwattr $C$DW$163, DW_AT_bit_offset(0x00)
    2380                            .dwattr $C$DW$163, DW_AT_bit_size(0x04)
    2381                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2382                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2383                            .dwattr $C$DW$163, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2384                            .dwattr $C$DW$163, DW_AT_decl_line(0xf1)
    2385                            .dwattr $C$DW$163, DW_AT_decl_column(0x0f)
    2386                    
    2387                            .dwattr $C$DW$T$173, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2388                            .dwattr $C$DW$T$173, DW_AT_decl_line(0xef)
    2389                            .dwattr $C$DW$T$173, DW_AT_decl_column(0x0b)
    2390                            .dwendtag $C$DW$T$173
    2391                    
    2392                    
    2393                    $C$DW$T$174     .dwtag  DW_TAG_structure_type
    2394                            .dwattr $C$DW$T$174, DW_AT_byte_size(0x01)
    2395                    $C$DW$164       .dwtag  DW_TAG_member
    2396                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$109)
    2397                            .dwattr $C$DW$164, DW_AT_name("bTxMode")
    2398                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("bTxMode")
    2399                            .dwattr $C$DW$164, DW_AT_bit_offset(0x07)
    2400                            .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    2401                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2402                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2403                            .dwattr $C$DW$164, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2404                            .dwattr $C$DW$164, DW_AT_decl_line(0xf6)
    2405                            .dwattr $C$DW$164, DW_AT_decl_column(0x0f)
    2406                    
    2407                    $C$DW$165       .dwtag  DW_TAG_member
    2408                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$109)
    2409                            .dwattr $C$DW$165, DW_AT_name("refFreq")
    2410                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("refFreq")
    2411                            .dwattr $C$DW$165, DW_AT_bit_offset(0x01)
    2412                            .dwattr $C$DW$165, DW_AT_bit_size(0x06)
    2413                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2414                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2415                            .dwattr $C$DW$165, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2416                            .dwattr $C$DW$165, DW_AT_decl_line(0xf8)
    2417                            .dwattr $C$DW$165, DW_AT_decl_column(0x0f)
    2418                    
    2419                            .dwattr $C$DW$T$174, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{187828DC-36B9-4F47-A09C-6A769FE6548F} PAGE   45

    2420                            .dwattr $C$DW$T$174, DW_AT_decl_line(0xf5)
    2421                            .dwattr $C$DW$T$174, DW_AT_decl_column(0x0b)
    2422                            .dwendtag $C$DW$T$174
    2423                    
    2424                    
    2425                    $C$DW$T$175     .dwtag  DW_TAG_structure_type
    2426                            .dwattr $C$DW$T$175, DW_AT_byte_size(0x01)
    2427                    $C$DW$166       .dwtag  DW_TAG_member
    2428                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$109)
    2429                            .dwattr $C$DW$166, DW_AT_name("triggerType")
    2430                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("triggerType")
    2431                            .dwattr $C$DW$166, DW_AT_bit_offset(0x04)
    2432                            .dwattr $C$DW$166, DW_AT_bit_size(0x04)
    2433                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2434                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2435                            .dwattr $C$DW$166, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2436                            .dwattr $C$DW$166, DW_AT_decl_line(0x10f)
    2437                            .dwattr $C$DW$166, DW_AT_decl_column(0x0f)
    2438                    
    2439                    $C$DW$167       .dwtag  DW_TAG_member
    2440                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$109)
    2441                            .dwattr $C$DW$167, DW_AT_name("bEnaCmd")
    2442                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("bEnaCmd")
    2443                            .dwattr $C$DW$167, DW_AT_bit_offset(0x03)
    2444                            .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    2445                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2446                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2447                            .dwattr $C$DW$167, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2448                            .dwattr $C$DW$167, DW_AT_decl_line(0x110)
    2449                            .dwattr $C$DW$167, DW_AT_decl_column(0x0f)
    2450                    
    2451                    $C$DW$168       .dwtag  DW_TAG_member
    2452                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$109)
    2453                            .dwattr $C$DW$168, DW_AT_name("triggerNo")
    2454                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("triggerNo")
    2455                            .dwattr $C$DW$168, DW_AT_bit_offset(0x01)
    2456                            .dwattr $C$DW$168, DW_AT_bit_size(0x02)
    2457                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2458                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2459                            .dwattr $C$DW$168, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2460                            .dwattr $C$DW$168, DW_AT_decl_line(0x112)
    2461                            .dwattr $C$DW$168, DW_AT_decl_column(0x0f)
    2462                    
    2463                    $C$DW$169       .dwtag  DW_TAG_member
    2464                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$109)
    2465                            .dwattr $C$DW$169, DW_AT_name("pastTrig")
    2466                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("pastTrig")
    2467                            .dwattr $C$DW$169, DW_AT_bit_offset(0x00)
    2468                            .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    2469                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2470                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2471                            .dwattr $C$DW$169, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2472                            .dwattr $C$DW$169, DW_AT_decl_line(0x113)
    2473                            .dwattr $C$DW$169, DW_AT_decl_column(0x0f)
    2474                    
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{187828DC-36B9-4F47-A09C-6A769FE6548F} PAGE   46

    2475                            .dwattr $C$DW$T$175, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2476                            .dwattr $C$DW$T$175, DW_AT_decl_line(0x10e)
    2477                            .dwattr $C$DW$T$175, DW_AT_decl_column(0x0b)
    2478                            .dwendtag $C$DW$T$175
    2479                    
    2480                    
    2481                    $C$DW$T$176     .dwtag  DW_TAG_structure_type
    2482                            .dwattr $C$DW$T$176, DW_AT_byte_size(0x01)
    2483                    $C$DW$170       .dwtag  DW_TAG_member
    2484                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$109)
    2485                            .dwattr $C$DW$170, DW_AT_name("rule")
    2486                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("rule")
    2487                            .dwattr $C$DW$170, DW_AT_bit_offset(0x04)
    2488                            .dwattr $C$DW$170, DW_AT_bit_size(0x04)
    2489                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2490                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2491                            .dwattr $C$DW$170, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2492                            .dwattr $C$DW$170, DW_AT_decl_line(0x117)
    2493                            .dwattr $C$DW$170, DW_AT_decl_column(0x0f)
    2494                    
    2495                    $C$DW$171       .dwtag  DW_TAG_member
    2496                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$109)
    2497                            .dwattr $C$DW$171, DW_AT_name("nSkip")
    2498                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("nSkip")
    2499                            .dwattr $C$DW$171, DW_AT_bit_offset(0x00)
    2500                            .dwattr $C$DW$171, DW_AT_bit_size(0x04)
    2501                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2502                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2503                            .dwattr $C$DW$171, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2504                            .dwattr $C$DW$171, DW_AT_decl_line(0x118)
    2505                            .dwattr $C$DW$171, DW_AT_decl_column(0x0f)
    2506                    
    2507                            .dwattr $C$DW$T$176, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2508                            .dwattr $C$DW$T$176, DW_AT_decl_line(0x116)
    2509                            .dwattr $C$DW$T$176, DW_AT_decl_column(0x0b)
    2510                            .dwendtag $C$DW$T$176
    2511                    
    2512                    
    2513                    $C$DW$T$177     .dwtag  DW_TAG_structure_type
    2514                            .dwattr $C$DW$T$177, DW_AT_byte_size(0x01)
    2515                    $C$DW$172       .dwtag  DW_TAG_member
    2516                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$109)
    2517                            .dwattr $C$DW$172, DW_AT_name("triggerType")
    2518                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("triggerType")
    2519                            .dwattr $C$DW$172, DW_AT_bit_offset(0x04)
    2520                            .dwattr $C$DW$172, DW_AT_bit_size(0x04)
    2521                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2522                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2523                            .dwattr $C$DW$172, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2524                            .dwattr $C$DW$172, DW_AT_decl_line(0x12a)
    2525                            .dwattr $C$DW$172, DW_AT_decl_column(0x0f)
    2526                    
    2527                    $C$DW$173       .dwtag  DW_TAG_member
    2528                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$109)
    2529                            .dwattr $C$DW$173, DW_AT_name("bEnaCmd")
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{187828DC-36B9-4F47-A09C-6A769FE6548F} PAGE   47

    2530                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("bEnaCmd")
    2531                            .dwattr $C$DW$173, DW_AT_bit_offset(0x03)
    2532                            .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    2533                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2534                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2535                            .dwattr $C$DW$173, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2536                            .dwattr $C$DW$173, DW_AT_decl_line(0x12b)
    2537                            .dwattr $C$DW$173, DW_AT_decl_column(0x0f)
    2538                    
    2539                    $C$DW$174       .dwtag  DW_TAG_member
    2540                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$109)
    2541                            .dwattr $C$DW$174, DW_AT_name("triggerNo")
    2542                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("triggerNo")
    2543                            .dwattr $C$DW$174, DW_AT_bit_offset(0x01)
    2544                            .dwattr $C$DW$174, DW_AT_bit_size(0x02)
    2545                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2546                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2547                            .dwattr $C$DW$174, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2548                            .dwattr $C$DW$174, DW_AT_decl_line(0x12d)
    2549                            .dwattr $C$DW$174, DW_AT_decl_column(0x0f)
    2550                    
    2551                    $C$DW$175       .dwtag  DW_TAG_member
    2552                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$109)
    2553                            .dwattr $C$DW$175, DW_AT_name("pastTrig")
    2554                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("pastTrig")
    2555                            .dwattr $C$DW$175, DW_AT_bit_offset(0x00)
    2556                            .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    2557                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2558                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2559                            .dwattr $C$DW$175, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2560                            .dwattr $C$DW$175, DW_AT_decl_line(0x12e)
    2561                            .dwattr $C$DW$175, DW_AT_decl_column(0x0f)
    2562                    
    2563                            .dwattr $C$DW$T$177, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2564                            .dwattr $C$DW$T$177, DW_AT_decl_line(0x129)
    2565                            .dwattr $C$DW$T$177, DW_AT_decl_column(0x0b)
    2566                            .dwendtag $C$DW$T$177
    2567                    
    2568                    
    2569                    $C$DW$T$178     .dwtag  DW_TAG_structure_type
    2570                            .dwattr $C$DW$T$178, DW_AT_byte_size(0x01)
    2571                    $C$DW$176       .dwtag  DW_TAG_member
    2572                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$109)
    2573                            .dwattr $C$DW$176, DW_AT_name("rule")
    2574                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("rule")
    2575                            .dwattr $C$DW$176, DW_AT_bit_offset(0x04)
    2576                            .dwattr $C$DW$176, DW_AT_bit_size(0x04)
    2577                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2578                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2579                            .dwattr $C$DW$176, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2580                            .dwattr $C$DW$176, DW_AT_decl_line(0x132)
    2581                            .dwattr $C$DW$176, DW_AT_decl_column(0x0f)
    2582                    
    2583                    $C$DW$177       .dwtag  DW_TAG_member
    2584                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$109)
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{187828DC-36B9-4F47-A09C-6A769FE6548F} PAGE   48

    2585                            .dwattr $C$DW$177, DW_AT_name("nSkip")
    2586                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("nSkip")
    2587                            .dwattr $C$DW$177, DW_AT_bit_offset(0x00)
    2588                            .dwattr $C$DW$177, DW_AT_bit_size(0x04)
    2589                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2590                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2591                            .dwattr $C$DW$177, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2592                            .dwattr $C$DW$177, DW_AT_decl_line(0x133)
    2593                            .dwattr $C$DW$177, DW_AT_decl_column(0x0f)
    2594                    
    2595                            .dwattr $C$DW$T$178, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2596                            .dwattr $C$DW$T$178, DW_AT_decl_line(0x131)
    2597                            .dwattr $C$DW$T$178, DW_AT_decl_column(0x0b)
    2598                            .dwendtag $C$DW$T$178
    2599                    
    2600                    
    2601                    $C$DW$T$179     .dwtag  DW_TAG_structure_type
    2602                            .dwattr $C$DW$T$179, DW_AT_byte_size(0x01)
    2603                    $C$DW$178       .dwtag  DW_TAG_member
    2604                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$109)
    2605                            .dwattr $C$DW$178, DW_AT_name("bEnaFifo")
    2606                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("bEnaFifo")
    2607                            .dwattr $C$DW$178, DW_AT_bit_offset(0x07)
