TI ARM Assembler PC v16.9.4 Sat Apr 14 16:44:00 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AE9389C3-EA2B-4BE7-B8DB-B83C5F22A9BD} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Sat Apr 14 16:43:59 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/LaunchPad/CC13X0_LAUNCHXL.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\collector_cc1310lp\collector_cc1
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    1432                            .dwattr $C$DW$95, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
    1433                            .dwattr $C$DW$95, DW_AT_decl_line(0x2de)
    1434                            .dwattr $C$DW$95, DW_AT_decl_column(0x05)
    1435                    
    1436                    $C$DW$96        .dwtag  DW_TAG_enumerator
    1437                            .dwattr $C$DW$96, DW_AT_name("RF_StatSuccess")
    1438                            .dwattr $C$DW$96, DW_AT_const_value(0x83)
    1439                            .dwattr $C$DW$96, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
    1440                            .dwattr $C$DW$96, DW_AT_decl_line(0x2df)
    1441                            .dwattr $C$DW$96, DW_AT_decl_column(0x05)
    1442                    
    1443                            .dwattr $C$DW$T$1193, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/driver
    1444                            .dwattr $C$DW$T$1193, DW_AT_decl_line(0x2d6)
    1445                            .dwattr $C$DW$T$1193, DW_AT_decl_column(0x0e)
    1446                            .dwendtag $C$DW$T$1193
    1447                    
    1448                    $C$DW$T$1194    .dwtag  DW_TAG_typedef
    1449                            .dwattr $C$DW$T$1194, DW_AT_name("RF_Stat")
    1450                            .dwattr $C$DW$T$1194, DW_AT_type(*$C$DW$T$1193)
    1451                            .dwattr $C$DW$T$1194, DW_AT_language(DW_LANG_C)
    1452                            .dwattr $C$DW$T$1194, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/driver
    1453                            .dwattr $C$DW$T$1194, DW_AT_decl_line(0x2e0)
    1454                            .dwattr $C$DW$T$1194, DW_AT_decl_column(0x03)
    1455                    
    1456                    
    1457                    $C$DW$T$1195    .dwtag  DW_TAG_enumeration_type
    1458                            .dwattr $C$DW$T$1195, DW_AT_byte_size(0x01)
    1459                    $C$DW$97        .dwtag  DW_TAG_enumerator
    1460                            .dwattr $C$DW$97, DW_AT_name("RF_GET_CURR_CMD")
    1461                            .dwattr $C$DW$97, DW_AT_const_value(0x00)
    1462                            .dwattr $C$DW$97, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
    1463                            .dwattr $C$DW$97, DW_AT_decl_line(0x3aa)
    1464                            .dwattr $C$DW$97, DW_AT_decl_column(0x05)
    1465                    
    1466                    $C$DW$98        .dwtag  DW_TAG_enumerator
    1467                            .dwattr $C$DW$98, DW_AT_name("RF_GET_AVAIL_RAT_CH")
    1468                            .dwattr $C$DW$98, DW_AT_const_value(0x01)
    1469                            .dwattr $C$DW$98, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
    1470                            .dwattr $C$DW$98, DW_AT_decl_line(0x3ab)
    1471                            .dwattr $C$DW$98, DW_AT_decl_column(0x05)
    1472                    
    1473                    $C$DW$99        .dwtag  DW_TAG_enumerator
    1474                            .dwattr $C$DW$99, DW_AT_name("RF_GET_RADIO_STATE")
    1475                            .dwattr $C$DW$99, DW_AT_const_value(0x02)
    1476                            .dwattr $C$DW$99, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
    1477                            .dwattr $C$DW$99, DW_AT_decl_line(0x3ac)
    1478                            .dwattr $C$DW$99, DW_AT_decl_column(0x05)
    1479                    
    1480                    $C$DW$100       .dwtag  DW_TAG_enumerator
    1481                            .dwattr $C$DW$100, DW_AT_name("RF_GET_SCHEDULE_MAP")
    1482                            .dwattr $C$DW$100, DW_AT_const_value(0x03)
    1483                            .dwattr $C$DW$100, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    1484                            .dwattr $C$DW$100, DW_AT_decl_line(0x3ad)
TI ARM Assembler PC v16.9.4 Sat Apr 14 16:44:00 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AE9389C3-EA2B-4BE7-B8DB-B83C5F22A9BD} PAGE   28

    1485                            .dwattr $C$DW$100, DW_AT_decl_column(0x05)
    1486                    
    1487                            .dwattr $C$DW$T$1195, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/driver
    1488                            .dwattr $C$DW$T$1195, DW_AT_decl_line(0x3a9)
    1489                            .dwattr $C$DW$T$1195, DW_AT_decl_column(0x0e)
    1490                            .dwendtag $C$DW$T$1195
    1491                    
    1492                    $C$DW$T$1196    .dwtag  DW_TAG_typedef
    1493                            .dwattr $C$DW$T$1196, DW_AT_name("RF_InfoType")
    1494                            .dwattr $C$DW$T$1196, DW_AT_type(*$C$DW$T$1195)
    1495                            .dwattr $C$DW$T$1196, DW_AT_language(DW_LANG_C)
    1496                            .dwattr $C$DW$T$1196, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/driver
    1497                            .dwattr $C$DW$T$1196, DW_AT_decl_line(0x3ae)
    1498                            .dwattr $C$DW$T$1196, DW_AT_decl_column(0x03)
    1499                    
    1500                    
    1501                    $C$DW$T$110     .dwtag  DW_TAG_structure_type
    1502                            .dwattr $C$DW$T$110, DW_AT_byte_size(0x04)
    1503                    $C$DW$101       .dwtag  DW_TAG_member
    1504                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$109)
    1505                            .dwattr $C$DW$101, DW_AT_name("hwiCpe0Priority")
    1506                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("hwiCpe0Priority")
    1507                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1508                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1509                            .dwattr $C$DW$101, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    1510                            .dwattr $C$DW$101, DW_AT_decl_line(0x33b)
    1511                            .dwattr $C$DW$101, DW_AT_decl_column(0x15)
    1512                    
    1513                    $C$DW$102       .dwtag  DW_TAG_member
    1514                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$109)
    1515                            .dwattr $C$DW$102, DW_AT_name("hwiHwPriority")
    1516                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("hwiHwPriority")
    1517                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1518                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1519                            .dwattr $C$DW$102, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    1520                            .dwattr $C$DW$102, DW_AT_decl_line(0x33c)
    1521                            .dwattr $C$DW$102, DW_AT_decl_column(0x15)
    1522                    
    1523                    $C$DW$103       .dwtag  DW_TAG_member
    1524                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$109)
    1525                            .dwattr $C$DW$103, DW_AT_name("swiCpe0Priority")
    1526                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("swiCpe0Priority")
    1527                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1528                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1529                            .dwattr $C$DW$103, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    1530                            .dwattr $C$DW$103, DW_AT_decl_line(0x33d)
    1531                            .dwattr $C$DW$103, DW_AT_decl_column(0x15)
    1532                    
    1533                    $C$DW$104       .dwtag  DW_TAG_member
    1534                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$109)
    1535                            .dwattr $C$DW$104, DW_AT_name("swiHwPriority")
    1536                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("swiHwPriority")
    1537                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1538                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1539                            .dwattr $C$DW$104, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
TI ARM Assembler PC v16.9.4 Sat Apr 14 16:44:00 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AE9389C3-EA2B-4BE7-B8DB-B83C5F22A9BD} PAGE   29

    1540                            .dwattr $C$DW$104, DW_AT_decl_line(0x33e)
    1541                            .dwattr $C$DW$104, DW_AT_decl_column(0x15)
    1542                    
    1543                            .dwattr $C$DW$T$110, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers
    1544                            .dwattr $C$DW$T$110, DW_AT_decl_line(0x33a)
    1545                            .dwattr $C$DW$T$110, DW_AT_decl_column(0x10)
    1546                            .dwendtag $C$DW$T$110
    1547                    
    1548                    $C$DW$T$1197    .dwtag  DW_TAG_typedef
    1549                            .dwattr $C$DW$T$1197, DW_AT_name("RFCC26XX_HWAttrs")
    1550                            .dwattr $C$DW$T$1197, DW_AT_type(*$C$DW$T$110)
    1551                            .dwattr $C$DW$T$1197, DW_AT_language(DW_LANG_C)
    1552                            .dwattr $C$DW$T$1197, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/driver
    1553                            .dwattr $C$DW$T$1197, DW_AT_decl_line(0x33f)
    1554                            .dwattr $C$DW$T$1197, DW_AT_decl_column(0x03)
    1555                    
    1556                    $C$DW$T$1198    .dwtag  DW_TAG_const_type
    1557                            .dwattr $C$DW$T$1198, DW_AT_type(*$C$DW$T$1197)
    1558                    
    1559                    
    1560                    $C$DW$T$112     .dwtag  DW_TAG_structure_type
    1561                            .dwattr $C$DW$T$112, DW_AT_byte_size(0x08)
    1562                    $C$DW$105       .dwtag  DW_TAG_member
    1563                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$111)
    1564                            .dwattr $C$DW$105, DW_AT_name("fg")
    1565                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("fg")
    1566                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1567                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1568                            .dwattr $C$DW$105, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/display/D
    1569                            .dwattr $C$DW$105, DW_AT_decl_line(0x53)
    1570                            .dwattr $C$DW$105, DW_AT_decl_column(0x0e)
    1571                    
    1572                    $C$DW$106       .dwtag  DW_TAG_member
    1573                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$111)
    1574                            .dwattr $C$DW$106, DW_AT_name("bg")
    1575                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("bg")
    1576                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1577                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1578                            .dwattr $C$DW$106, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/display/D
    1579                            .dwattr $C$DW$106, DW_AT_decl_line(0x54)
    1580                            .dwattr $C$DW$106, DW_AT_decl_column(0x0e)
    1581                    
    1582                            .dwattr $C$DW$T$112, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/display
    1583                            .dwattr $C$DW$T$112, DW_AT_decl_line(0x52)
    1584                            .dwattr $C$DW$T$112, DW_AT_decl_column(0x01)
    1585                            .dwendtag $C$DW$T$112
    1586                    
    1587                    $C$DW$T$418     .dwtag  DW_TAG_typedef
    1588                            .dwattr $C$DW$T$418, DW_AT_name("DisplaySharpColor_t")
    1589                            .dwattr $C$DW$T$418, DW_AT_type(*$C$DW$T$112)
    1590                            .dwattr $C$DW$T$418, DW_AT_language(DW_LANG_C)
    1591                            .dwattr $C$DW$T$418, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/display
    1592                            .dwattr $C$DW$T$418, DW_AT_decl_line(0x55)
    1593                            .dwattr $C$DW$T$418, DW_AT_decl_column(0x03)
    1594                    
TI ARM Assembler PC v16.9.4 Sat Apr 14 16:44:00 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AE9389C3-EA2B-4BE7-B8DB-B83C5F22A9BD} PAGE   30

    1595                    
    1596                    $C$DW$T$116     .dwtag  DW_TAG_structure_type
    1597                            .dwattr $C$DW$T$116, DW_AT_byte_size(0x08)
    1598                    $C$DW$107       .dwtag  DW_TAG_member
    1599                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$10)
    1600                            .dwattr $C$DW$107, DW_AT_name("length")
    1601                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("length")
    1602                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1603                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1604                            .dwattr $C$DW$107, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    1605                            .dwattr $C$DW$107, DW_AT_decl_line(0x36f)
    1606                            .dwattr $C$DW$107, DW_AT_decl_column(0x16)
    1607                    
    1608                    $C$DW$108       .dwtag  DW_TAG_member
    1609                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$115)
    1610                            .dwattr $C$DW$108, DW_AT_name("elem")
    1611                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("elem")
    1612                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1613                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1614                            .dwattr $C$DW$108, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    1615                            .dwattr $C$DW$108, DW_AT_decl_line(0x36f)
    1616                            .dwattr $C$DW$108, DW_AT_decl_column(0x44)
    1617                    
    1618                            .dwattr $C$DW$T$116, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    1619                            .dwattr $C$DW$T$116, DW_AT_decl_line(0x36f)
    1620                            .dwattr $C$DW$T$116, DW_AT_decl_column(0x10)
    1621                            .dwendtag $C$DW$T$116
    1622                    
    1623                    $C$DW$T$1199    .dwtag  DW_TAG_typedef
    1624                            .dwattr $C$DW$T$1199, DW_AT_name("__ARRAY1_ti_sysbios_family_arm_m3_Hwi_hooks")
    1625                            .dwattr $C$DW$T$1199, DW_AT_type(*$C$DW$T$116)
    1626                            .dwattr $C$DW$T$1199, DW_AT_language(DW_LANG_C)
    1627                            .dwattr $C$DW$T$1199, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pa
    1628                            .dwattr $C$DW$T$1199, DW_AT_decl_line(0x36f)
    1629                            .dwattr $C$DW$T$1199, DW_AT_decl_column(0x4c)
    1630                    
    1631                    
    1632                    $C$DW$T$119     .dwtag  DW_TAG_structure_type
    1633                            .dwattr $C$DW$T$119, DW_AT_byte_size(0x08)
    1634                    $C$DW$109       .dwtag  DW_TAG_member
    1635                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$10)
    1636                            .dwattr $C$DW$109, DW_AT_name("length")
    1637                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("length")
    1638                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1639                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1640                            .dwattr $C$DW$109, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    1641                            .dwattr $C$DW$109, DW_AT_decl_line(0x370)
    1642                            .dwattr $C$DW$109, DW_AT_decl_column(0x16)
    1643                    
    1644                    $C$DW$110       .dwtag  DW_TAG_member
    1645                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$118)
    1646                            .dwattr $C$DW$110, DW_AT_name("elem")
    1647                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("elem")
    1648                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1649                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Sat Apr 14 16:44:00 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AE9389C3-EA2B-4BE7-B8DB-B83C5F22A9BD} PAGE   31

    1650                            .dwattr $C$DW$110, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    1651                            .dwattr $C$DW$110, DW_AT_decl_line(0x370)
    1652                            .dwattr $C$DW$110, DW_AT_decl_column(0x4a)
    1653                    
    1654                            .dwattr $C$DW$T$119, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    1655                            .dwattr $C$DW$T$119, DW_AT_decl_line(0x370)
    1656                            .dwattr $C$DW$T$119, DW_AT_decl_column(0x10)
    1657                            .dwendtag $C$DW$T$119
    1658                    
    1659                    $C$DW$T$1200    .dwtag  DW_TAG_typedef
    1660                            .dwattr $C$DW$T$1200, DW_AT_name("__CARRAY1_ti_sysbios_family_arm_m3_Hwi_hooks")
    1661                            .dwattr $C$DW$T$1200, DW_AT_type(*$C$DW$T$119)
    1662                            .dwattr $C$DW$T$1200, DW_AT_language(DW_LANG_C)
    1663                            .dwattr $C$DW$T$1200, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pa
    1664                            .dwattr $C$DW$T$1200, DW_AT_decl_line(0x370)
    1665                            .dwattr $C$DW$T$1200, DW_AT_decl_column(0x52)
    1666                    
    1667                    $C$DW$T$1201    .dwtag  DW_TAG_typedef
    1668                            .dwattr $C$DW$T$1201, DW_AT_name("CT__ti_sysbios_family_arm_m3_Hwi_hooks")
    1669                            .dwattr $C$DW$T$1201, DW_AT_type(*$C$DW$T$1200)
    1670                            .dwattr $C$DW$T$1201, DW_AT_language(DW_LANG_C)
    1671                            .dwattr $C$DW$T$1201, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pa
    1672                            .dwattr $C$DW$T$1201, DW_AT_decl_line(0x372)
    1673                            .dwattr $C$DW$T$1201, DW_AT_decl_column(0x36)
    1674                    
    1675                    $C$DW$T$1202    .dwtag  DW_TAG_typedef
    1676                            .dwattr $C$DW$T$1202, DW_AT_name("__TA_ti_sysbios_family_arm_m3_Hwi_hooks")
    1677                            .dwattr $C$DW$T$1202, DW_AT_type(*$C$DW$T$1200)
    1678                            .dwattr $C$DW$T$1202, DW_AT_language(DW_LANG_C)
    1679                            .dwattr $C$DW$T$1202, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pa
    1680                            .dwattr $C$DW$T$1202, DW_AT_decl_line(0x371)
    1681                            .dwattr $C$DW$T$1202, DW_AT_decl_column(0x36)
    1682                    
    1683                    
    1684                    $C$DW$T$159     .dwtag  DW_TAG_structure_type
    1685                            .dwattr $C$DW$T$159, DW_AT_byte_size(0x4c)
    1686                    $C$DW$111       .dwtag  DW_TAG_member
    1687                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$123)
    1688                            .dwattr $C$DW$111, DW_AT_name("Crc32")
    1689                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("Crc32")
    1690                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1691                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1692                            .dwattr $C$DW$111, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1693                            .dwattr $C$DW$111, DW_AT_decl_line(0x76)
    1694                            .dwattr $C$DW$111, DW_AT_decl_column(0x25)
    1695                    
    1696                    $C$DW$112       .dwtag  DW_TAG_member
    1697                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$126)
    1698                            .dwattr $C$DW$112, DW_AT_name("FlashGetSize")
    1699                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("FlashGetSize")
    1700                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1701                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1702                            .dwattr $C$DW$112, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1703                            .dwattr $C$DW$112, DW_AT_decl_line(0x77)
    1704                            .dwattr $C$DW$112, DW_AT_decl_column(0x25)
TI ARM Assembler PC v16.9.4 Sat Apr 14 16:44:00 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AE9389C3-EA2B-4BE7-B8DB-B83C5F22A9BD} PAGE   32

    1705                    
    1706                    $C$DW$113       .dwtag  DW_TAG_member
    1707                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$127)
    1708                            .dwattr $C$DW$113, DW_AT_name("GetChipId")
    1709                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("GetChipId")
    1710                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1711                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1712                            .dwattr $C$DW$113, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1713                            .dwattr $C$DW$113, DW_AT_decl_line(0x78)
    1714                            .dwattr $C$DW$113, DW_AT_decl_column(0x25)
    1715                    
    1716                    $C$DW$114       .dwtag  DW_TAG_member
    1717                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$130)
    1718                            .dwattr $C$DW$114, DW_AT_name("ReservedLocation1")
    1719                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("ReservedLocation1")
    1720                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1721                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1722                            .dwattr $C$DW$114, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1723                            .dwattr $C$DW$114, DW_AT_decl_line(0x79)
    1724                            .dwattr $C$DW$114, DW_AT_decl_column(0x25)
    1725                    
    1726                    $C$DW$115       .dwtag  DW_TAG_member
    1727                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$131)
    1728                            .dwattr $C$DW$115, DW_AT_name("ReservedLocation2")
    1729                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("ReservedLocation2")
    1730                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1731                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1732                            .dwattr $C$DW$115, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1733                            .dwattr $C$DW$115, DW_AT_decl_line(0x7a)
    1734                            .dwattr $C$DW$115, DW_AT_decl_column(0x25)
    1735                    
    1736                    $C$DW$116       .dwtag  DW_TAG_member
    1737                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$132)
    1738                            .dwattr $C$DW$116, DW_AT_name("ReservedLocation3")
    1739                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("ReservedLocation3")
    1740                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1741                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1742                            .dwattr $C$DW$116, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1743                            .dwattr $C$DW$116, DW_AT_decl_line(0x7b)
    1744                            .dwattr $C$DW$116, DW_AT_decl_column(0x25)
    1745                    
    1746                    $C$DW$117       .dwtag  DW_TAG_member
    1747                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$135)
    1748                            .dwattr $C$DW$117, DW_AT_name("ResetDevice")
    1749                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("ResetDevice")
    1750                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1751                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1752                            .dwattr $C$DW$117, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1753                            .dwattr $C$DW$117, DW_AT_decl_line(0x7c)
    1754                            .dwattr $C$DW$117, DW_AT_decl_column(0x25)
    1755                    
    1756                    $C$DW$118       .dwtag  DW_TAG_member
    1757                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$140)
    1758                            .dwattr $C$DW$118, DW_AT_name("Fletcher32")
    1759                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("Fletcher32")
TI ARM Assembler PC v16.9.4 Sat Apr 14 16:44:00 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AE9389C3-EA2B-4BE7-B8DB-B83C5F22A9BD} PAGE   33

    1760                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1761                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1762                            .dwattr $C$DW$118, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1763                            .dwattr $C$DW$118, DW_AT_decl_line(0x7d)
    1764                            .dwattr $C$DW$118, DW_AT_decl_column(0x25)
    1765                    
    1766                    $C$DW$119       .dwtag  DW_TAG_member
    1767                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$144)
    1768                            .dwattr $C$DW$119, DW_AT_name("MinValue")
    1769                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("MinValue")
    1770                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1771                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1772                            .dwattr $C$DW$119, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1773                            .dwattr $C$DW$119, DW_AT_decl_line(0x7e)
    1774                            .dwattr $C$DW$119, DW_AT_decl_column(0x25)
    1775                    
    1776                    $C$DW$120       .dwtag  DW_TAG_member
    1777                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$145)
    1778                            .dwattr $C$DW$120, DW_AT_name("MaxValue")
    1779                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("MaxValue")
    1780                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1781                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1782                            .dwattr $C$DW$120, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1783                            .dwattr $C$DW$120, DW_AT_decl_line(0x7f)
    1784                            .dwattr $C$DW$120, DW_AT_decl_column(0x25)
    1785                    
    1786                    $C$DW$121       .dwtag  DW_TAG_member
    1787                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$146)
    1788                            .dwattr $C$DW$121, DW_AT_name("MeanValue")
    1789                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("MeanValue")
    1790                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1791                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1792                            .dwattr $C$DW$121, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1793                            .dwattr $C$DW$121, DW_AT_decl_line(0x80)
    1794                            .dwattr $C$DW$121, DW_AT_decl_column(0x25)
    1795                    
    1796                    $C$DW$122       .dwtag  DW_TAG_member
    1797                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$147)
    1798                            .dwattr $C$DW$122, DW_AT_name("StandDeviationValue")
    1799                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("StandDeviationValue")
    1800                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1801                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1802                            .dwattr $C$DW$122, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1803                            .dwattr $C$DW$122, DW_AT_decl_line(0x81)
    1804                            .dwattr $C$DW$122, DW_AT_decl_column(0x25)
    1805                    
    1806                    $C$DW$123       .dwtag  DW_TAG_member
    1807                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$150)
    1808                            .dwattr $C$DW$123, DW_AT_name("ReservedLocation4")
    1809                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("ReservedLocation4")
    1810                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1811                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1812                            .dwattr $C$DW$123, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1813                            .dwattr $C$DW$123, DW_AT_decl_line(0x82)
    1814                            .dwattr $C$DW$123, DW_AT_decl_column(0x25)
TI ARM Assembler PC v16.9.4 Sat Apr 14 16:44:00 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AE9389C3-EA2B-4BE7-B8DB-B83C5F22A9BD} PAGE   34

    1815                    
    1816                    $C$DW$124       .dwtag  DW_TAG_member
    1817                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$151)
    1818                            .dwattr $C$DW$124, DW_AT_name("ReservedLocation5")
    1819                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("ReservedLocation5")
    1820                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1821                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1822                            .dwattr $C$DW$124, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1823                            .dwattr $C$DW$124, DW_AT_decl_line(0x83)
    1824                            .dwattr $C$DW$124, DW_AT_decl_column(0x25)
    1825                    
    1826                    $C$DW$125       .dwtag  DW_TAG_member
    1827                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$152)
    1828                            .dwattr $C$DW$125, DW_AT_name("HFSourceSafeSwitch")
    1829                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    1830                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1831                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1832                            .dwattr $C$DW$125, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1833                            .dwattr $C$DW$125, DW_AT_decl_line(0x84)
    1834                            .dwattr $C$DW$125, DW_AT_decl_column(0x25)
    1835                    
    1836                    $C$DW$126       .dwtag  DW_TAG_member
    1837                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$155)
    1838                            .dwattr $C$DW$126, DW_AT_name("SelectCompAInput")
    1839                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("SelectCompAInput")
    1840                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1841                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1842                            .dwattr $C$DW$126, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1843                            .dwattr $C$DW$126, DW_AT_decl_line(0x85)
    1844                            .dwattr $C$DW$126, DW_AT_decl_column(0x25)
    1845                    
    1846                    $C$DW$127       .dwtag  DW_TAG_member
    1847                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$156)
    1848                            .dwattr $C$DW$127, DW_AT_name("SelectCompARef")
    1849                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("SelectCompARef")
    1850                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1851                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1852                            .dwattr $C$DW$127, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1853                            .dwattr $C$DW$127, DW_AT_decl_line(0x86)
    1854                            .dwattr $C$DW$127, DW_AT_decl_column(0x25)
    1855                    
    1856                    $C$DW$128       .dwtag  DW_TAG_member
    1857                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$157)
    1858                            .dwattr $C$DW$128, DW_AT_name("SelectADCCompBInput")
    1859                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("SelectADCCompBInput")
    1860                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1861                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1862                            .dwattr $C$DW$128, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1863                            .dwattr $C$DW$128, DW_AT_decl_line(0x87)
    1864                            .dwattr $C$DW$128, DW_AT_decl_column(0x25)
    1865                    
    1866                    $C$DW$129       .dwtag  DW_TAG_member
    1867                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$158)
    1868                            .dwattr $C$DW$129, DW_AT_name("SelectCompBRef")
    1869                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("SelectCompBRef")
TI ARM Assembler PC v16.9.4 Sat Apr 14 16:44:00 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AE9389C3-EA2B-4BE7-B8DB-B83C5F22A9BD} PAGE   35

    1870                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1871                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1872                            .dwattr $C$DW$129, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1873                            .dwattr $C$DW$129, DW_AT_decl_line(0x88)
    1874                            .dwattr $C$DW$129, DW_AT_decl_column(0x25)
    1875                    
    1876                            .dwattr $C$DW$T$159, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    1877                            .dwattr $C$DW$T$159, DW_AT_decl_line(0x75)
    1878                            .dwattr $C$DW$T$159, DW_AT_decl_column(0x01)
    1879                            .dwendtag $C$DW$T$159
    1880                    
    1881                    $C$DW$T$1203    .dwtag  DW_TAG_typedef
    1882                            .dwattr $C$DW$T$1203, DW_AT_name("HARD_API_T")
    1883                            .dwattr $C$DW$T$1203, DW_AT_type(*$C$DW$T$159)
    1884                            .dwattr $C$DW$T$1203, DW_AT_language(DW_LANG_C)
    1885                            .dwattr $C$DW$T$1203, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\device
    1886                            .dwattr $C$DW$T$1203, DW_AT_decl_line(0x89)
    1887                            .dwattr $C$DW$T$1203, DW_AT_decl_column(0x03)
    1888                    
    1889                    
    1890                    $C$DW$T$163     .dwtag  DW_TAG_structure_type
    1891                            .dwattr $C$DW$T$163, DW_AT_byte_size(0x10)
    1892                    $C$DW$130       .dwtag  DW_TAG_member
    1893                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$161)
    1894                            .dwattr $C$DW$130, DW_AT_name("pvSrcEndAddr")
    1895                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("pvSrcEndAddr")
    1896                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1897                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1898                            .dwattr $C$DW$130, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1899                            .dwattr $C$DW$130, DW_AT_decl_line(0x69)
    1900                            .dwattr $C$DW$130, DW_AT_decl_column(0x14)
    1901                    
    1902                    $C$DW$131       .dwtag  DW_TAG_member
    1903                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$161)
    1904                            .dwattr $C$DW$131, DW_AT_name("pvDstEndAddr")
    1905                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("pvDstEndAddr")
    1906                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1907                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1908                            .dwattr $C$DW$131, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1909                            .dwattr $C$DW$131, DW_AT_decl_line(0x6a)
    1910                            .dwattr $C$DW$131, DW_AT_decl_column(0x14)
    1911                    
    1912                    $C$DW$132       .dwtag  DW_TAG_member
    1913                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$162)
    1914                            .dwattr $C$DW$132, DW_AT_name("ui32Control")
    1915                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("ui32Control")
    1916                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1917                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1918                            .dwattr $C$DW$132, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1919                            .dwattr $C$DW$132, DW_AT_decl_line(0x6b)
    1920                            .dwattr $C$DW$132, DW_AT_decl_column(0x17)
    1921                    
    1922                    $C$DW$133       .dwtag  DW_TAG_member
    1923                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$162)
    1924                            .dwattr $C$DW$133, DW_AT_name("ui32Spare")
TI ARM Assembler PC v16.9.4 Sat Apr 14 16:44:00 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AE9389C3-EA2B-4BE7-B8DB-B83C5F22A9BD} PAGE   36

    1925                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("ui32Spare")
    1926                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1927                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1928                            .dwattr $C$DW$133, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1929                            .dwattr $C$DW$133, DW_AT_decl_line(0x6c)
    1930                            .dwattr $C$DW$133, DW_AT_decl_column(0x17)
    1931                    
    1932                            .dwattr $C$DW$T$163, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    1933                            .dwattr $C$DW$T$163, DW_AT_decl_line(0x68)
    1934                            .dwattr $C$DW$T$163, DW_AT_decl_column(0x01)
    1935                            .dwendtag $C$DW$T$163
    1936                    
    1937                    $C$DW$T$1204    .dwtag  DW_TAG_typedef
    1938                            .dwattr $C$DW$T$1204, DW_AT_name("tDMAControlTable")
    1939                            .dwattr $C$DW$T$1204, DW_AT_type(*$C$DW$T$163)
    1940                            .dwattr $C$DW$T$1204, DW_AT_language(DW_LANG_C)
    1941                            .dwattr $C$DW$T$1204, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/device
    1942                            .dwattr $C$DW$T$1204, DW_AT_decl_line(0x6e)
    1943                            .dwattr $C$DW$T$1204, DW_AT_decl_column(0x01)
    1944                    
    1945                    
    1946                    $C$DW$T$164     .dwtag  DW_TAG_structure_type
    1947                            .dwattr $C$DW$T$164, DW_AT_byte_size(0x08)
    1948                    $C$DW$134       .dwtag  DW_TAG_member
    1949                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$120)
    1950                            .dwattr $C$DW$134, DW_AT_name("pCurrEntry")
    1951                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("pCurrEntry")
    1952                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1953                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1954                            .dwattr $C$DW$134, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1955                            .dwattr $C$DW$134, DW_AT_decl_line(0x41)
    1956                            .dwattr $C$DW$134, DW_AT_decl_column(0x0d)
    1957                    
    1958                    $C$DW$135       .dwtag  DW_TAG_member
    1959                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$120)
    1960                            .dwattr $C$DW$135, DW_AT_name("pLastEntry")
    1961                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("pLastEntry")
    1962                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1963                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1964                            .dwattr $C$DW$135, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1965                            .dwattr $C$DW$135, DW_AT_decl_line(0x42)
    1966                            .dwattr $C$DW$135, DW_AT_decl_column(0x0d)
    1967                    
    1968                            .dwattr $C$DW$T$164, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    1969                            .dwattr $C$DW$T$164, DW_AT_decl_line(0x40)
    1970                            .dwattr $C$DW$T$164, DW_AT_decl_column(0x10)
    1971                            .dwendtag $C$DW$T$164
    1972                    
    1973                    $C$DW$T$757     .dwtag  DW_TAG_typedef
    1974                            .dwattr $C$DW$T$757, DW_AT_name("dataQueue_t")
    1975                            .dwattr $C$DW$T$757, DW_AT_type(*$C$DW$T$164)
    1976                            .dwattr $C$DW$T$757, DW_AT_language(DW_LANG_C)
    1977                            .dwattr $C$DW$T$757, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    1978                            .dwattr $C$DW$T$757, DW_AT_decl_line(0x43)
    1979                            .dwattr $C$DW$T$757, DW_AT_decl_column(0x03)
TI ARM Assembler PC v16.9.4 Sat Apr 14 16:44:00 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AE9389C3-EA2B-4BE7-B8DB-B83C5F22A9BD} PAGE   37

    1980                    
    1981                    $C$DW$T$758     .dwtag  DW_TAG_pointer_type
    1982                            .dwattr $C$DW$T$758, DW_AT_type(*$C$DW$T$757)
    1983                            .dwattr $C$DW$T$758, DW_AT_address_class(0x20)
    1984                    
    1985                    
    1986                    $C$DW$T$165     .dwtag  DW_TAG_structure_type
    1987                            .dwattr $C$DW$T$165, DW_AT_byte_size(0x01)
    1988                    $C$DW$136       .dwtag  DW_TAG_member
    1989                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$109)
    1990                            .dwattr $C$DW$136, DW_AT_name("triggerType")
    1991                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("triggerType")
    1992                            .dwattr $C$DW$136, DW_AT_bit_offset(0x04)
    1993                            .dwattr $C$DW$136, DW_AT_bit_size(0x04)
    1994                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1995                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1996                            .dwattr $C$DW$136, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1997                            .dwattr $C$DW$136, DW_AT_decl_line(0x77)
    1998                            .dwattr $C$DW$136, DW_AT_decl_column(0x0f)
    1999                    
    2000                    $C$DW$137       .dwtag  DW_TAG_member
    2001                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$109)
    2002                            .dwattr $C$DW$137, DW_AT_name("bEnaCmd")
    2003                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("bEnaCmd")
    2004                            .dwattr $C$DW$137, DW_AT_bit_offset(0x03)
    2005                            .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    2006                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2007                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2008                            .dwattr $C$DW$137, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2009                            .dwattr $C$DW$137, DW_AT_decl_line(0x78)
    2010                            .dwattr $C$DW$137, DW_AT_decl_column(0x0f)
    2011                    
    2012                    $C$DW$138       .dwtag  DW_TAG_member
    2013                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$109)
    2014                            .dwattr $C$DW$138, DW_AT_name("triggerNo")
    2015                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("triggerNo")
    2016                            .dwattr $C$DW$138, DW_AT_bit_offset(0x01)
    2017                            .dwattr $C$DW$138, DW_AT_bit_size(0x02)
    2018                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2019                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2020                            .dwattr $C$DW$138, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2021                            .dwattr $C$DW$138, DW_AT_decl_line(0x7a)
    2022                            .dwattr $C$DW$138, DW_AT_decl_column(0x0f)
    2023                    
    2024                    $C$DW$139       .dwtag  DW_TAG_member
    2025                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$109)
    2026                            .dwattr $C$DW$139, DW_AT_name("pastTrig")
    2027                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("pastTrig")
    2028                            .dwattr $C$DW$139, DW_AT_bit_offset(0x00)
    2029                            .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    2030                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2031                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2032                            .dwattr $C$DW$139, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2033                            .dwattr $C$DW$139, DW_AT_decl_line(0x7b)
    2034                            .dwattr $C$DW$139, DW_AT_decl_column(0x0f)
TI ARM Assembler PC v16.9.4 Sat Apr 14 16:44:00 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AE9389C3-EA2B-4BE7-B8DB-B83C5F22A9BD} PAGE   38

    2035                    
    2036                            .dwattr $C$DW$T$165, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2037                            .dwattr $C$DW$T$165, DW_AT_decl_line(0x76)
    2038                            .dwattr $C$DW$T$165, DW_AT_decl_column(0x0b)
    2039                            .dwendtag $C$DW$T$165
    2040                    
    2041                    
    2042                    $C$DW$T$166     .dwtag  DW_TAG_structure_type
    2043                            .dwattr $C$DW$T$166, DW_AT_byte_size(0x01)
    2044                    $C$DW$140       .dwtag  DW_TAG_member
    2045                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$109)
    2046                            .dwattr $C$DW$140, DW_AT_name("rule")
    2047                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("rule")
    2048                            .dwattr $C$DW$140, DW_AT_bit_offset(0x04)
    2049                            .dwattr $C$DW$140, DW_AT_bit_size(0x04)
    2050                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2051                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2052                            .dwattr $C$DW$140, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2053                            .dwattr $C$DW$140, DW_AT_decl_line(0x7f)
    2054                            .dwattr $C$DW$140, DW_AT_decl_column(0x0f)
    2055                    
    2056                    $C$DW$141       .dwtag  DW_TAG_member
    2057                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$109)
    2058                            .dwattr $C$DW$141, DW_AT_name("nSkip")
    2059                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("nSkip")
    2060                            .dwattr $C$DW$141, DW_AT_bit_offset(0x00)
    2061                            .dwattr $C$DW$141, DW_AT_bit_size(0x04)
    2062                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2063                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2064                            .dwattr $C$DW$141, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2065                            .dwattr $C$DW$141, DW_AT_decl_line(0x80)
    2066                            .dwattr $C$DW$141, DW_AT_decl_column(0x0f)
    2067                    
    2068                            .dwattr $C$DW$T$166, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2069                            .dwattr $C$DW$T$166, DW_AT_decl_line(0x7e)
    2070                            .dwattr $C$DW$T$166, DW_AT_decl_column(0x0b)
    2071                            .dwendtag $C$DW$T$166
    2072                    
    2073                    
    2074                    $C$DW$T$167     .dwtag  DW_TAG_structure_type
    2075                            .dwattr $C$DW$T$167, DW_AT_byte_size(0x01)
    2076                    $C$DW$142       .dwtag  DW_TAG_member
    2077                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$109)
    2078                            .dwattr $C$DW$142, DW_AT_name("triggerType")
    2079                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("triggerType")
    2080                            .dwattr $C$DW$142, DW_AT_bit_offset(0x04)
    2081                            .dwattr $C$DW$142, DW_AT_bit_size(0x04)
    2082                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2083                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2084                            .dwattr $C$DW$142, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2085                            .dwattr $C$DW$142, DW_AT_decl_line(0x92)
    2086                            .dwattr $C$DW$142, DW_AT_decl_column(0x0f)
    2087                    
    2088                    $C$DW$143       .dwtag  DW_TAG_member
    2089                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$109)
TI ARM Assembler PC v16.9.4 Sat Apr 14 16:44:00 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AE9389C3-EA2B-4BE7-B8DB-B83C5F22A9BD} PAGE   39

    2090                            .dwattr $C$DW$143, DW_AT_name("bEnaCmd")
    2091                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("bEnaCmd")
    2092                            .dwattr $C$DW$143, DW_AT_bit_offset(0x03)
    2093                            .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    2094                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2095                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2096                            .dwattr $C$DW$143, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2097                            .dwattr $C$DW$143, DW_AT_decl_line(0x93)
    2098                            .dwattr $C$DW$143, DW_AT_decl_column(0x0f)
    2099                    
    2100                    $C$DW$144       .dwtag  DW_TAG_member
    2101                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$109)
    2102                            .dwattr $C$DW$144, DW_AT_name("triggerNo")
    2103                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("triggerNo")
    2104                            .dwattr $C$DW$144, DW_AT_bit_offset(0x01)
    2105                            .dwattr $C$DW$144, DW_AT_bit_size(0x02)
    2106                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2107                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2108                            .dwattr $C$DW$144, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2109                            .dwattr $C$DW$144, DW_AT_decl_line(0x95)
    2110                            .dwattr $C$DW$144, DW_AT_decl_column(0x0f)
    2111                    
    2112                    $C$DW$145       .dwtag  DW_TAG_member
    2113                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$109)
    2114                            .dwattr $C$DW$145, DW_AT_name("pastTrig")
    2115                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("pastTrig")
    2116                            .dwattr $C$DW$145, DW_AT_bit_offset(0x00)
    2117                            .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    2118                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2119                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2120                            .dwattr $C$DW$145, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2121                            .dwattr $C$DW$145, DW_AT_decl_line(0x96)
    2122                            .dwattr $C$DW$145, DW_AT_decl_column(0x0f)
    2123                    
    2124                            .dwattr $C$DW$T$167, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2125                            .dwattr $C$DW$T$167, DW_AT_decl_line(0x91)
    2126                            .dwattr $C$DW$T$167, DW_AT_decl_column(0x0b)
    2127                            .dwendtag $C$DW$T$167
    2128                    
    2129                    
    2130                    $C$DW$T$168     .dwtag  DW_TAG_structure_type
    2131                            .dwattr $C$DW$T$168, DW_AT_byte_size(0x01)
    2132                    $C$DW$146       .dwtag  DW_TAG_member
    2133                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$109)
    2134                            .dwattr $C$DW$146, DW_AT_name("rule")
    2135                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("rule")
    2136                            .dwattr $C$DW$146, DW_AT_bit_offset(0x04)
    2137                            .dwattr $C$DW$146, DW_AT_bit_size(0x04)
    2138                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2139                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2140                            .dwattr $C$DW$146, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2141                            .dwattr $C$DW$146, DW_AT_decl_line(0x9a)
    2142                            .dwattr $C$DW$146, DW_AT_decl_column(0x0f)
    2143                    
    2144                    $C$DW$147       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Apr 14 16:44:00 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AE9389C3-EA2B-4BE7-B8DB-B83C5F22A9BD} PAGE   40

    2145                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$109)
    2146                            .dwattr $C$DW$147, DW_AT_name("nSkip")
    2147                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("nSkip")
    2148                            .dwattr $C$DW$147, DW_AT_bit_offset(0x00)
    2149                            .dwattr $C$DW$147, DW_AT_bit_size(0x04)
    2150                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2151                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2152                            .dwattr $C$DW$147, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2153                            .dwattr $C$DW$147, DW_AT_decl_line(0x9b)
    2154                            .dwattr $C$DW$147, DW_AT_decl_column(0x0f)
    2155                    
    2156                            .dwattr $C$DW$T$168, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2157                            .dwattr $C$DW$T$168, DW_AT_decl_line(0x99)
    2158                            .dwattr $C$DW$T$168, DW_AT_decl_column(0x0b)
    2159                            .dwendtag $C$DW$T$168
    2160                    
    2161                    
    2162                    $C$DW$T$169     .dwtag  DW_TAG_structure_type
    2163                            .dwattr $C$DW$T$169, DW_AT_byte_size(0x01)
    2164                    $C$DW$148       .dwtag  DW_TAG_member
    2165                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$109)
    2166                            .dwattr $C$DW$148, DW_AT_name("triggerType")
    2167                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("triggerType")
    2168                            .dwattr $C$DW$148, DW_AT_bit_offset(0x04)
    2169                            .dwattr $C$DW$148, DW_AT_bit_size(0x04)
    2170                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2171                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2172                            .dwattr $C$DW$148, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2173                            .dwattr $C$DW$148, DW_AT_decl_line(0xad)
    2174                            .dwattr $C$DW$148, DW_AT_decl_column(0x0f)
    2175                    
    2176                    $C$DW$149       .dwtag  DW_TAG_member
    2177                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$109)
    2178                            .dwattr $C$DW$149, DW_AT_name("bEnaCmd")
    2179                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("bEnaCmd")
    2180                            .dwattr $C$DW$149, DW_AT_bit_offset(0x03)
    2181                            .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    2182                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2183                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2184                            .dwattr $C$DW$149, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2185                            .dwattr $C$DW$149, DW_AT_decl_line(0xae)
    2186                            .dwattr $C$DW$149, DW_AT_decl_column(0x0f)
    2187                    
    2188                    $C$DW$150       .dwtag  DW_TAG_member
    2189                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$109)
    2190                            .dwattr $C$DW$150, DW_AT_name("triggerNo")
    2191                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("triggerNo")
    2192                            .dwattr $C$DW$150, DW_AT_bit_offset(0x01)
    2193                            .dwattr $C$DW$150, DW_AT_bit_size(0x02)
    2194                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2195                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2196                            .dwattr $C$DW$150, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2197                            .dwattr $C$DW$150, DW_AT_decl_line(0xb0)
    2198                            .dwattr $C$DW$150, DW_AT_decl_column(0x0f)
    2199                    
TI ARM Assembler PC v16.9.4 Sat Apr 14 16:44:00 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AE9389C3-EA2B-4BE7-B8DB-B83C5F22A9BD} PAGE   41

    2200                    $C$DW$151       .dwtag  DW_TAG_member
    2201                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$109)
    2202                            .dwattr $C$DW$151, DW_AT_name("pastTrig")
    2203                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("pastTrig")
    2204                            .dwattr $C$DW$151, DW_AT_bit_offset(0x00)
    2205                            .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    2206                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2207                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2208                            .dwattr $C$DW$151, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2209                            .dwattr $C$DW$151, DW_AT_decl_line(0xb1)
    2210                            .dwattr $C$DW$151, DW_AT_decl_column(0x0f)
    2211                    
    2212                            .dwattr $C$DW$T$169, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2213                            .dwattr $C$DW$T$169, DW_AT_decl_line(0xac)
    2214                            .dwattr $C$DW$T$169, DW_AT_decl_column(0x0b)
    2215                            .dwendtag $C$DW$T$169
    2216                    
    2217                    
    2218                    $C$DW$T$170     .dwtag  DW_TAG_structure_type
    2219                            .dwattr $C$DW$T$170, DW_AT_byte_size(0x01)
    2220                    $C$DW$152       .dwtag  DW_TAG_member
    2221                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$109)
    2222                            .dwattr $C$DW$152, DW_AT_name("rule")
    2223                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("rule")
    2224                            .dwattr $C$DW$152, DW_AT_bit_offset(0x04)
    2225                            .dwattr $C$DW$152, DW_AT_bit_size(0x04)
    2226                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2227                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2228                            .dwattr $C$DW$152, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2229                            .dwattr $C$DW$152, DW_AT_decl_line(0xb5)
    2230                            .dwattr $C$DW$152, DW_AT_decl_column(0x0f)
    2231                    
    2232                    $C$DW$153       .dwtag  DW_TAG_member
    2233                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$109)
    2234                            .dwattr $C$DW$153, DW_AT_name("nSkip")
    2235                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("nSkip")
    2236                            .dwattr $C$DW$153, DW_AT_bit_offset(0x00)
    2237                            .dwattr $C$DW$153, DW_AT_bit_size(0x04)
    2238                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2239                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2240                            .dwattr $C$DW$153, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2241                            .dwattr $C$DW$153, DW_AT_decl_line(0xb6)
    2242                            .dwattr $C$DW$153, DW_AT_decl_column(0x0f)
    2243                    
    2244                            .dwattr $C$DW$T$170, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2245                            .dwattr $C$DW$T$170, DW_AT_decl_line(0xb4)
    2246                            .dwattr $C$DW$T$170, DW_AT_decl_column(0x0b)
    2247                            .dwendtag $C$DW$T$170
    2248                    
    2249                    
    2250                    $C$DW$T$171     .dwtag  DW_TAG_structure_type
    2251                            .dwattr $C$DW$T$171, DW_AT_byte_size(0x02)
    2252                    $C$DW$154       .dwtag  DW_TAG_member
    2253                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$136)
    2254                            .dwattr $C$DW$154, DW_AT_name("frontEndMode")
TI ARM Assembler PC v16.9.4 Sat Apr 14 16:44:00 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AE9389C3-EA2B-4BE7-B8DB-B83C5F22A9BD} PAGE   42

    2255                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("frontEndMode")
    2256                            .dwattr $C$DW$154, DW_AT_bit_offset(0x0d)
    2257                            .dwattr $C$DW$154, DW_AT_bit_size(0x03)
    2258                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2259                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2260                            .dwattr $C$DW$154, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2261                            .dwattr $C$DW$154, DW_AT_decl_line(0xc3)
    2262                            .dwattr $C$DW$154, DW_AT_decl_column(0x10)
    2263                    
    2264                    $C$DW$155       .dwtag  DW_TAG_member
    2265                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$136)
    2266                            .dwattr $C$DW$155, DW_AT_name("biasMode")
    2267                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("biasMode")
    2268                            .dwattr $C$DW$155, DW_AT_bit_offset(0x0c)
    2269                            .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    2270                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2271                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2272                            .dwattr $C$DW$155, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2273                            .dwattr $C$DW$155, DW_AT_decl_line(0xc9)
    2274                            .dwattr $C$DW$155, DW_AT_decl_column(0x10)
    2275                    
    2276                    $C$DW$156       .dwtag  DW_TAG_member
    2277                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$136)
    2278                            .dwattr $C$DW$156, DW_AT_name("analogCfgMode")
    2279                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("analogCfgMode")
    2280                            .dwattr $C$DW$156, DW_AT_bit_offset(0x06)
    2281                            .dwattr $C$DW$156, DW_AT_bit_size(0x06)
    2282                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2283                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2284                            .dwattr $C$DW$156, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2285                            .dwattr $C$DW$156, DW_AT_decl_line(0xcb)
    2286                            .dwattr $C$DW$156, DW_AT_decl_column(0x10)
    2287                    
    2288                    $C$DW$157       .dwtag  DW_TAG_member
    2289                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$136)
    2290                            .dwattr $C$DW$157, DW_AT_name("bNoFsPowerUp")
    2291                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("bNoFsPowerUp")
    2292                            .dwattr $C$DW$157, DW_AT_bit_offset(0x05)
    2293                            .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    2294                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2295                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2296                            .dwattr $C$DW$157, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2297                            .dwattr $C$DW$157, DW_AT_decl_line(0xd2)
    2298                            .dwattr $C$DW$157, DW_AT_decl_column(0x10)
    2299                    
    2300                            .dwattr $C$DW$T$171, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2301                            .dwattr $C$DW$T$171, DW_AT_decl_line(0xc2)
    2302                            .dwattr $C$DW$T$171, DW_AT_decl_column(0x0b)
    2303                            .dwendtag $C$DW$T$171
    2304                    
    2305                    
    2306                    $C$DW$T$172     .dwtag  DW_TAG_structure_type
    2307                            .dwattr $C$DW$T$172, DW_AT_byte_size(0x01)
    2308                    $C$DW$158       .dwtag  DW_TAG_member
    2309                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$109)
TI ARM Assembler PC v16.9.4 Sat Apr 14 16:44:00 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AE9389C3-EA2B-4BE7-B8DB-B83C5F22A9BD} PAGE   43

    2310                            .dwattr $C$DW$158, DW_AT_name("triggerType")
    2311                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("triggerType")
    2312                            .dwattr $C$DW$158, DW_AT_bit_offset(0x04)
    2313                            .dwattr $C$DW$158, DW_AT_bit_size(0x04)
    2314                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2315                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2316                            .dwattr $C$DW$158, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2317                            .dwattr $C$DW$158, DW_AT_decl_line(0xe8)
    2318                            .dwattr $C$DW$158, DW_AT_decl_column(0x0f)
    2319                    
    2320                    $C$DW$159       .dwtag  DW_TAG_member
    2321                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$109)
    2322                            .dwattr $C$DW$159, DW_AT_name("bEnaCmd")
    2323                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("bEnaCmd")
    2324                            .dwattr $C$DW$159, DW_AT_bit_offset(0x03)
    2325                            .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    2326                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2327                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2328                            .dwattr $C$DW$159, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2329                            .dwattr $C$DW$159, DW_AT_decl_line(0xe9)
    2330                            .dwattr $C$DW$159, DW_AT_decl_column(0x0f)
    2331                    
    2332                    $C$DW$160       .dwtag  DW_TAG_member
    2333                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$109)
    2334                            .dwattr $C$DW$160, DW_AT_name("triggerNo")
    2335                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("triggerNo")
    2336                            .dwattr $C$DW$160, DW_AT_bit_offset(0x01)
    2337                            .dwattr $C$DW$160, DW_AT_bit_size(0x02)
    2338                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2339                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2340                            .dwattr $C$DW$160, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2341                            .dwattr $C$DW$160, DW_AT_decl_line(0xeb)
    2342                            .dwattr $C$DW$160, DW_AT_decl_column(0x0f)
    2343                    
    2344                    $C$DW$161       .dwtag  DW_TAG_member
    2345                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$109)
    2346                            .dwattr $C$DW$161, DW_AT_name("pastTrig")
    2347                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("pastTrig")
    2348                            .dwattr $C$DW$161, DW_AT_bit_offset(0x00)
    2349                            .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    2350                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2351                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2352                            .dwattr $C$DW$161, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2353                            .dwattr $C$DW$161, DW_AT_decl_line(0xec)
    2354                            .dwattr $C$DW$161, DW_AT_decl_column(0x0f)
    2355                    
    2356                            .dwattr $C$DW$T$172, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2357                            .dwattr $C$DW$T$172, DW_AT_decl_line(0xe7)
    2358                            .dwattr $C$DW$T$172, DW_AT_decl_column(0x0b)
    2359                            .dwendtag $C$DW$T$172
    2360                    
    2361                    
    2362                    $C$DW$T$173     .dwtag  DW_TAG_structure_type
    2363                            .dwattr $C$DW$T$173, DW_AT_byte_size(0x01)
    2364                    $C$DW$162       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Apr 14 16:44:00 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AE9389C3-EA2B-4BE7-B8DB-B83C5F22A9BD} PAGE   44

    2365                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$109)
    2366                            .dwattr $C$DW$162, DW_AT_name("rule")
    2367                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("rule")
    2368                            .dwattr $C$DW$162, DW_AT_bit_offset(0x04)
    2369                            .dwattr $C$DW$162, DW_AT_bit_size(0x04)
    2370                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2371                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2372                            .dwattr $C$DW$162, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2373                            .dwattr $C$DW$162, DW_AT_decl_line(0xf0)
    2374                            .dwattr $C$DW$162, DW_AT_decl_column(0x0f)
    2375                    
    2376                    $C$DW$163       .dwtag  DW_TAG_member
    2377                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$109)
    2378                            .dwattr $C$DW$163, DW_AT_name("nSkip")
    2379                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("nSkip")
    2380                            .dwattr $C$DW$163, DW_AT_bit_offset(0x00)
    2381                            .dwattr $C$DW$163, DW_AT_bit_size(0x04)
    2382                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2383                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2384                            .dwattr $C$DW$163, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2385                            .dwattr $C$DW$163, DW_AT_decl_line(0xf1)
    2386                            .dwattr $C$DW$163, DW_AT_decl_column(0x0f)
    2387                    
    2388                            .dwattr $C$DW$T$173, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2389                            .dwattr $C$DW$T$173, DW_AT_decl_line(0xef)
    2390                            .dwattr $C$DW$T$173, DW_AT_decl_column(0x0b)
    2391                            .dwendtag $C$DW$T$173
    2392                    
    2393                    
    2394                    $C$DW$T$174     .dwtag  DW_TAG_structure_type
    2395                            .dwattr $C$DW$T$174, DW_AT_byte_size(0x01)
    2396                    $C$DW$164       .dwtag  DW_TAG_member
    2397                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$109)
    2398                            .dwattr $C$DW$164, DW_AT_name("bTxMode")
    2399                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("bTxMode")
    2400                            .dwattr $C$DW$164, DW_AT_bit_offset(0x07)
    2401                            .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    2402                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2403                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2404                            .dwattr $C$DW$164, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2405                            .dwattr $C$DW$164, DW_AT_decl_line(0xf6)
    2406                            .dwattr $C$DW$164, DW_AT_decl_column(0x0f)
    2407                    
    2408                    $C$DW$165       .dwtag  DW_TAG_member
    2409                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$109)
    2410                            .dwattr $C$DW$165, DW_AT_name("refFreq")
    2411                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("refFreq")
    2412                            .dwattr $C$DW$165, DW_AT_bit_offset(0x01)
    2413                            .dwattr $C$DW$165, DW_AT_bit_size(0x06)
    2414                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2415                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2416                            .dwattr $C$DW$165, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2417                            .dwattr $C$DW$165, DW_AT_decl_line(0xf8)
    2418                            .dwattr $C$DW$165, DW_AT_decl_column(0x0f)
    2419                    
TI ARM Assembler PC v16.9.4 Sat Apr 14 16:44:00 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AE9389C3-EA2B-4BE7-B8DB-B83C5F22A9BD} PAGE   45

    2420                            .dwattr $C$DW$T$174, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2421                            .dwattr $C$DW$T$174, DW_AT_decl_line(0xf5)
    2422                            .dwattr $C$DW$T$174, DW_AT_decl_column(0x0b)
    2423                            .dwendtag $C$DW$T$174
    2424                    
    2425                    
    2426                    $C$DW$T$175     .dwtag  DW_TAG_structure_type
    2427                            .dwattr $C$DW$T$175, DW_AT_byte_size(0x01)
    2428                    $C$DW$166       .dwtag  DW_TAG_member
    2429                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$109)
    2430                            .dwattr $C$DW$166, DW_AT_name("triggerType")
    2431                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("triggerType")
    2432                            .dwattr $C$DW$166, DW_AT_bit_offset(0x04)
    2433                            .dwattr $C$DW$166, DW_AT_bit_size(0x04)
    2434                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2435                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2436                            .dwattr $C$DW$166, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2437                            .dwattr $C$DW$166, DW_AT_decl_line(0x10f)
    2438                            .dwattr $C$DW$166, DW_AT_decl_column(0x0f)
    2439                    
    2440                    $C$DW$167       .dwtag  DW_TAG_member
    2441                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$109)
    2442                            .dwattr $C$DW$167, DW_AT_name("bEnaCmd")
    2443                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("bEnaCmd")
    2444                            .dwattr $C$DW$167, DW_AT_bit_offset(0x03)
    2445                            .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    2446                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2447                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2448                            .dwattr $C$DW$167, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2449                            .dwattr $C$DW$167, DW_AT_decl_line(0x110)
    2450                            .dwattr $C$DW$167, DW_AT_decl_column(0x0f)
    2451                    
    2452                    $C$DW$168       .dwtag  DW_TAG_member
    2453                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$109)
    2454                            .dwattr $C$DW$168, DW_AT_name("triggerNo")
    2455                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("triggerNo")
    2456                            .dwattr $C$DW$168, DW_AT_bit_offset(0x01)
    2457                            .dwattr $C$DW$168, DW_AT_bit_size(0x02)
    2458                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2459                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2460                            .dwattr $C$DW$168, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2461                            .dwattr $C$DW$168, DW_AT_decl_line(0x112)
    2462                            .dwattr $C$DW$168, DW_AT_decl_column(0x0f)
    2463                    
    2464                    $C$DW$169       .dwtag  DW_TAG_member
    2465                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$109)
    2466                            .dwattr $C$DW$169, DW_AT_name("pastTrig")
    2467                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("pastTrig")
    2468                            .dwattr $C$DW$169, DW_AT_bit_offset(0x00)
    2469                            .dwattr $C$DW$169, DW_AT_bit_size(0x01)
    2470                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2471                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2472                            .dwattr $C$DW$169, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2473                            .dwattr $C$DW$169, DW_AT_decl_line(0x113)
    2474                            .dwattr $C$DW$169, DW_AT_decl_column(0x0f)
TI ARM Assembler PC v16.9.4 Sat Apr 14 16:44:00 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AE9389C3-EA2B-4BE7-B8DB-B83C5F22A9BD} PAGE   46

    2475                    
    2476                            .dwattr $C$DW$T$175, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2477                            .dwattr $C$DW$T$175, DW_AT_decl_line(0x10e)
    2478                            .dwattr $C$DW$T$175, DW_AT_decl_column(0x0b)
    2479                            .dwendtag $C$DW$T$175
    2480                    
    2481                    
    2482                    $C$DW$T$176     .dwtag  DW_TAG_structure_type
    2483                            .dwattr $C$DW$T$176, DW_AT_byte_size(0x01)
    2484                    $C$DW$170       .dwtag  DW_TAG_member
    2485                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$109)
    2486                            .dwattr $C$DW$170, DW_AT_name("rule")
    2487                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("rule")
    2488                            .dwattr $C$DW$170, DW_AT_bit_offset(0x04)
    2489                            .dwattr $C$DW$170, DW_AT_bit_size(0x04)
    2490                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2491                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2492                            .dwattr $C$DW$170, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2493                            .dwattr $C$DW$170, DW_AT_decl_line(0x117)
    2494                            .dwattr $C$DW$170, DW_AT_decl_column(0x0f)
    2495                    
    2496                    $C$DW$171       .dwtag  DW_TAG_member
    2497                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$109)
    2498                            .dwattr $C$DW$171, DW_AT_name("nSkip")
    2499                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("nSkip")
    2500                            .dwattr $C$DW$171, DW_AT_bit_offset(0x00)
    2501                            .dwattr $C$DW$171, DW_AT_bit_size(0x04)
    2502                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2503                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2504                            .dwattr $C$DW$171, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2505                            .dwattr $C$DW$171, DW_AT_decl_line(0x118)
    2506                            .dwattr $C$DW$171, DW_AT_decl_column(0x0f)
    2507                    
    2508                            .dwattr $C$DW$T$176, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2509                            .dwattr $C$DW$T$176, DW_AT_decl_line(0x116)
    2510                            .dwattr $C$DW$T$176, DW_AT_decl_column(0x0b)
    2511                            .dwendtag $C$DW$T$176
    2512                    
    2513                    
    2514                    $C$DW$T$177     .dwtag  DW_TAG_structure_type
    2515                            .dwattr $C$DW$T$177, DW_AT_byte_size(0x01)
    2516                    $C$DW$172       .dwtag  DW_TAG_member
    2517                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$109)
    2518                            .dwattr $C$DW$172, DW_AT_name("triggerType")
    2519                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("triggerType")
    2520                            .dwattr $C$DW$172, DW_AT_bit_offset(0x04)
    2521                            .dwattr $C$DW$172, DW_AT_bit_size(0x04)
    2522                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2523                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2524                            .dwattr $C$DW$172, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2525                            .dwattr $C$DW$172, DW_AT_decl_line(0x12a)
    2526                            .dwattr $C$DW$172, DW_AT_decl_column(0x0f)
    2527                    
    2528                    $C$DW$173       .dwtag  DW_TAG_member
    2529                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$109)
TI ARM Assembler PC v16.9.4 Sat Apr 14 16:44:00 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AE9389C3-EA2B-4BE7-B8DB-B83C5F22A9BD} PAGE   47

    2530                            .dwattr $C$DW$173, DW_AT_name("bEnaCmd")
    2531                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("bEnaCmd")
    2532                            .dwattr $C$DW$173, DW_AT_bit_offset(0x03)
    2533                            .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    2534                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2535                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2536                            .dwattr $C$DW$173, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2537                            .dwattr $C$DW$173, DW_AT_decl_line(0x12b)
    2538                            .dwattr $C$DW$173, DW_AT_decl_column(0x0f)
    2539                    
    2540                    $C$DW$174       .dwtag  DW_TAG_member
    2541                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$109)
    2542                            .dwattr $C$DW$174, DW_AT_name("triggerNo")
    2543                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("triggerNo")
    2544                            .dwattr $C$DW$174, DW_AT_bit_offset(0x01)
    2545                            .dwattr $C$DW$174, DW_AT_bit_size(0x02)
    2546                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2547                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2548                            .dwattr $C$DW$174, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2549                            .dwattr $C$DW$174, DW_AT_decl_line(0x12d)
    2550                            .dwattr $C$DW$174, DW_AT_decl_column(0x0f)
    2551                    
    2552                    $C$DW$175       .dwtag  DW_TAG_member
    2553                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$109)
    2554                            .dwattr $C$DW$175, DW_AT_name("pastTrig")
    2555                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("pastTrig")
    2556                            .dwattr $C$DW$175, DW_AT_bit_offset(0x00)
    2557                            .dwattr $C$DW$175, DW_AT_bit_size(0x01)
    2558                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2559                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2560                            .dwattr $C$DW$175, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2561                            .dwattr $C$DW$175, DW_AT_decl_line(0x12e)
    2562                            .dwattr $C$DW$175, DW_AT_decl_column(0x0f)
    2563                    
    2564                            .dwattr $C$DW$T$177, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2565                            .dwattr $C$DW$T$177, DW_AT_decl_line(0x129)
    2566                            .dwattr $C$DW$T$177, DW_AT_decl_column(0x0b)
    2567                            .dwendtag $C$DW$T$177
    2568                    
    2569                    
    2570                    $C$DW$T$178     .dwtag  DW_TAG_structure_type
    2571                            .dwattr $C$DW$T$178, DW_AT_byte_size(0x01)
    2572                    $C$DW$176       .dwtag  DW_TAG_member
    2573                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$109)
    2574                            .dwattr $C$DW$176, DW_AT_name("rule")
    2575                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("rule")
    2576                            .dwattr $C$DW$176, DW_AT_bit_offset(0x04)
    2577                            .dwattr $C$DW$176, DW_AT_bit_size(0x04)
    2578                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2579                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2580                            .dwattr $C$DW$176, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2581                            .dwattr $C$DW$176, DW_AT_decl_line(0x132)
    2582                            .dwattr $C$DW$176, DW_AT_decl_column(0x0f)
    2583                    
    2584                    $C$DW$177       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Apr 14 16:44:00 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{AE9389C3-EA2B-4BE7-B8DB-B83C5F22A9BD} PAGE   48

    2585                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$109)
    2586                            .dwattr $C$DW$177, DW_AT_name("nSkip")
    2587                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("nSkip")
    2588                            .dwattr $C$DW$177, DW_AT_bit_offset(0x00)
    2589                            .dwattr $C$DW$177, DW_AT_bit_size(0x04)
    2590                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2591                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2592                            .dwattr $C$DW$177, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2593                            .dwattr $C$DW$177, DW_AT_decl_line(0x133)
    2594                            .dwattr $C$DW$177, DW_AT_decl_column(0x0f)
    2595                    
    2596                            .dwattr $C$DW$T$178, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2597                            .dwattr $C$DW$T$178, DW_AT_decl_line(0x131)
    2598                            .dwattr $C$DW$T$178, DW_AT_decl_column(0x0b)
    2599                            .dwendtag $C$DW$T$178
    2600                    
    2601                    
    2602                    $C$DW$T$179     .dwtag  DW_TAG_structure_type
    2603                            .dwattr $C$DW$T$179, DW_AT_byte_size(0x01)
    2604                    $C$DW$178       .dwtag  DW_TAG_member
    2605                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$109)
    2606                            .dwattr $C$DW$178, DW_AT_name("bEnaFifo")
    2607                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("bEnaFifo")
    2608                            .dwattr $C$DW$178, DW_AT_bit_offset(0x07)
