TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:42 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{667561A1-166B-4C20-ACEB-DD6F4E324E01} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Sat Nov 25 18:51:41 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/LaunchPad/CC13X0_LAUNCHXL.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\collector_cc1310lp\collector_cc1
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    1249                            .dwattr $C$DW$87, DW_AT_decl_column(0x05)
    1250                    
    1251                    $C$DW$88        .dwtag  DW_TAG_enumerator
    1252                            .dwattr $C$DW$88, DW_AT_name("RF_StatSuccess")
    1253                            .dwattr $C$DW$88, DW_AT_const_value(0x83)
    1254                            .dwattr $C$DW$88, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
    1255                            .dwattr $C$DW$88, DW_AT_decl_line(0x2df)
    1256                            .dwattr $C$DW$88, DW_AT_decl_column(0x05)
    1257                    
    1258                            .dwattr $C$DW$T$1128, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/driver
    1259                            .dwattr $C$DW$T$1128, DW_AT_decl_line(0x2d6)
    1260                            .dwattr $C$DW$T$1128, DW_AT_decl_column(0x0e)
    1261                            .dwendtag $C$DW$T$1128
    1262                    
    1263                    $C$DW$T$1129    .dwtag  DW_TAG_typedef
    1264                            .dwattr $C$DW$T$1129, DW_AT_name("RF_Stat")
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:42 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{667561A1-166B-4C20-ACEB-DD6F4E324E01} PAGE   24

    1265                            .dwattr $C$DW$T$1129, DW_AT_type(*$C$DW$T$1128)
    1266                            .dwattr $C$DW$T$1129, DW_AT_language(DW_LANG_C)
    1267                            .dwattr $C$DW$T$1129, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/driver
    1268                            .dwattr $C$DW$T$1129, DW_AT_decl_line(0x2e0)
    1269                            .dwattr $C$DW$T$1129, DW_AT_decl_column(0x03)
    1270                    
    1271                    
    1272                    $C$DW$T$1130    .dwtag  DW_TAG_enumeration_type
    1273                            .dwattr $C$DW$T$1130, DW_AT_byte_size(0x01)
    1274                    $C$DW$89        .dwtag  DW_TAG_enumerator
    1275                            .dwattr $C$DW$89, DW_AT_name("RF_GET_CURR_CMD")
    1276                            .dwattr $C$DW$89, DW_AT_const_value(0x00)
    1277                            .dwattr $C$DW$89, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
    1278                            .dwattr $C$DW$89, DW_AT_decl_line(0x3aa)
    1279                            .dwattr $C$DW$89, DW_AT_decl_column(0x05)
    1280                    
    1281                    $C$DW$90        .dwtag  DW_TAG_enumerator
    1282                            .dwattr $C$DW$90, DW_AT_name("RF_GET_AVAIL_RAT_CH")
    1283                            .dwattr $C$DW$90, DW_AT_const_value(0x01)
    1284                            .dwattr $C$DW$90, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
    1285                            .dwattr $C$DW$90, DW_AT_decl_line(0x3ab)
    1286                            .dwattr $C$DW$90, DW_AT_decl_column(0x05)
    1287                    
    1288                    $C$DW$91        .dwtag  DW_TAG_enumerator
    1289                            .dwattr $C$DW$91, DW_AT_name("RF_GET_RADIO_STATE")
    1290                            .dwattr $C$DW$91, DW_AT_const_value(0x02)
    1291                            .dwattr $C$DW$91, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
    1292                            .dwattr $C$DW$91, DW_AT_decl_line(0x3ac)
    1293                            .dwattr $C$DW$91, DW_AT_decl_column(0x05)
    1294                    
    1295                    $C$DW$92        .dwtag  DW_TAG_enumerator
    1296                            .dwattr $C$DW$92, DW_AT_name("RF_GET_SCHEDULE_MAP")
    1297                            .dwattr $C$DW$92, DW_AT_const_value(0x03)
    1298                            .dwattr $C$DW$92, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
    1299                            .dwattr $C$DW$92, DW_AT_decl_line(0x3ad)
    1300                            .dwattr $C$DW$92, DW_AT_decl_column(0x05)
    1301                    
    1302                            .dwattr $C$DW$T$1130, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/driver
    1303                            .dwattr $C$DW$T$1130, DW_AT_decl_line(0x3a9)
    1304                            .dwattr $C$DW$T$1130, DW_AT_decl_column(0x0e)
    1305                            .dwendtag $C$DW$T$1130
    1306                    
    1307                    $C$DW$T$1131    .dwtag  DW_TAG_typedef
    1308                            .dwattr $C$DW$T$1131, DW_AT_name("RF_InfoType")
    1309                            .dwattr $C$DW$T$1131, DW_AT_type(*$C$DW$T$1130)
    1310                            .dwattr $C$DW$T$1131, DW_AT_language(DW_LANG_C)
    1311                            .dwattr $C$DW$T$1131, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/driver
    1312                            .dwattr $C$DW$T$1131, DW_AT_decl_line(0x3ae)
    1313                            .dwattr $C$DW$T$1131, DW_AT_decl_column(0x03)
    1314                    
    1315                    
    1316                    $C$DW$T$110     .dwtag  DW_TAG_structure_type
    1317                            .dwattr $C$DW$T$110, DW_AT_byte_size(0x04)
    1318                    $C$DW$93        .dwtag  DW_TAG_member
    1319                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$109)
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:42 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{667561A1-166B-4C20-ACEB-DD6F4E324E01} PAGE   25

    1320                            .dwattr $C$DW$93, DW_AT_name("hwiCpe0Priority")
    1321                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("hwiCpe0Priority")
    1322                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1323                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1324                            .dwattr $C$DW$93, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
    1325                            .dwattr $C$DW$93, DW_AT_decl_line(0x33b)
    1326                            .dwattr $C$DW$93, DW_AT_decl_column(0x15)
    1327                    
    1328                    $C$DW$94        .dwtag  DW_TAG_member
    1329                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$109)
    1330                            .dwattr $C$DW$94, DW_AT_name("hwiHwPriority")
    1331                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("hwiHwPriority")
    1332                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1333                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1334                            .dwattr $C$DW$94, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
    1335                            .dwattr $C$DW$94, DW_AT_decl_line(0x33c)
    1336                            .dwattr $C$DW$94, DW_AT_decl_column(0x15)
    1337                    
    1338                    $C$DW$95        .dwtag  DW_TAG_member
    1339                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$109)
    1340                            .dwattr $C$DW$95, DW_AT_name("swiCpe0Priority")
    1341                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("swiCpe0Priority")
    1342                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1343                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1344                            .dwattr $C$DW$95, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
    1345                            .dwattr $C$DW$95, DW_AT_decl_line(0x33d)
    1346                            .dwattr $C$DW$95, DW_AT_decl_column(0x15)
    1347                    
    1348                    $C$DW$96        .dwtag  DW_TAG_member
    1349                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$109)
    1350                            .dwattr $C$DW$96, DW_AT_name("swiHwPriority")
    1351                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("swiHwPriority")
    1352                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1353                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1354                            .dwattr $C$DW$96, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/rf
    1355                            .dwattr $C$DW$96, DW_AT_decl_line(0x33e)
    1356                            .dwattr $C$DW$96, DW_AT_decl_column(0x15)
    1357                    
    1358                            .dwattr $C$DW$T$110, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers
    1359                            .dwattr $C$DW$T$110, DW_AT_decl_line(0x33a)
    1360                            .dwattr $C$DW$T$110, DW_AT_decl_column(0x10)
    1361                            .dwendtag $C$DW$T$110
    1362                    
    1363                    $C$DW$T$1132    .dwtag  DW_TAG_typedef
    1364                            .dwattr $C$DW$T$1132, DW_AT_name("RFCC26XX_HWAttrs")
    1365                            .dwattr $C$DW$T$1132, DW_AT_type(*$C$DW$T$110)
    1366                            .dwattr $C$DW$T$1132, DW_AT_language(DW_LANG_C)
    1367                            .dwattr $C$DW$T$1132, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/driver
    1368                            .dwattr $C$DW$T$1132, DW_AT_decl_line(0x33f)
    1369                            .dwattr $C$DW$T$1132, DW_AT_decl_column(0x03)
    1370                    
    1371                    $C$DW$T$1133    .dwtag  DW_TAG_const_type
    1372                            .dwattr $C$DW$T$1133, DW_AT_type(*$C$DW$T$1132)
    1373                    
    1374                    
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:42 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{667561A1-166B-4C20-ACEB-DD6F4E324E01} PAGE   26

    1375                    $C$DW$T$112     .dwtag  DW_TAG_structure_type
    1376                            .dwattr $C$DW$T$112, DW_AT_byte_size(0x08)
    1377                    $C$DW$97        .dwtag  DW_TAG_member
    1378                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$111)
    1379                            .dwattr $C$DW$97, DW_AT_name("fg")
    1380                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("fg")
    1381                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1382                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1383                            .dwattr $C$DW$97, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/display/Di
    1384                            .dwattr $C$DW$97, DW_AT_decl_line(0x53)
    1385                            .dwattr $C$DW$97, DW_AT_decl_column(0x0e)
    1386                    
    1387                    $C$DW$98        .dwtag  DW_TAG_member
    1388                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$111)
    1389                            .dwattr $C$DW$98, DW_AT_name("bg")
    1390                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("bg")
    1391                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1392                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1393                            .dwattr $C$DW$98, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/display/Di
    1394                            .dwattr $C$DW$98, DW_AT_decl_line(0x54)
    1395                            .dwattr $C$DW$98, DW_AT_decl_column(0x0e)
    1396                    
    1397                            .dwattr $C$DW$T$112, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/display
    1398                            .dwattr $C$DW$T$112, DW_AT_decl_line(0x52)
    1399                            .dwattr $C$DW$T$112, DW_AT_decl_column(0x01)
    1400                            .dwendtag $C$DW$T$112
    1401                    
    1402                    $C$DW$T$418     .dwtag  DW_TAG_typedef
    1403                            .dwattr $C$DW$T$418, DW_AT_name("DisplaySharpColor_t")
    1404                            .dwattr $C$DW$T$418, DW_AT_type(*$C$DW$T$112)
    1405                            .dwattr $C$DW$T$418, DW_AT_language(DW_LANG_C)
    1406                            .dwattr $C$DW$T$418, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/display
    1407                            .dwattr $C$DW$T$418, DW_AT_decl_line(0x55)
    1408                            .dwattr $C$DW$T$418, DW_AT_decl_column(0x03)
    1409                    
    1410                    
    1411                    $C$DW$T$116     .dwtag  DW_TAG_structure_type
    1412                            .dwattr $C$DW$T$116, DW_AT_byte_size(0x08)
    1413                    $C$DW$99        .dwtag  DW_TAG_member
    1414                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$10)
    1415                            .dwattr $C$DW$99, DW_AT_name("length")
    1416                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("length")
    1417                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1418                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1419                            .dwattr $C$DW$99, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packag
    1420                            .dwattr $C$DW$99, DW_AT_decl_line(0x36f)
    1421                            .dwattr $C$DW$99, DW_AT_decl_column(0x16)
    1422                    
    1423                    $C$DW$100       .dwtag  DW_TAG_member
    1424                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$115)
    1425                            .dwattr $C$DW$100, DW_AT_name("elem")
    1426                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("elem")
    1427                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1428                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1429                            .dwattr $C$DW$100, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:42 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{667561A1-166B-4C20-ACEB-DD6F4E324E01} PAGE   27

    1430                            .dwattr $C$DW$100, DW_AT_decl_line(0x36f)
    1431                            .dwattr $C$DW$100, DW_AT_decl_column(0x44)
    1432                    
    1433                            .dwattr $C$DW$T$116, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    1434                            .dwattr $C$DW$T$116, DW_AT_decl_line(0x36f)
    1435                            .dwattr $C$DW$T$116, DW_AT_decl_column(0x10)
    1436                            .dwendtag $C$DW$T$116
    1437                    
    1438                    $C$DW$T$1134    .dwtag  DW_TAG_typedef
    1439                            .dwattr $C$DW$T$1134, DW_AT_name("__ARRAY1_ti_sysbios_family_arm_m3_Hwi_hooks")
    1440                            .dwattr $C$DW$T$1134, DW_AT_type(*$C$DW$T$116)
    1441                            .dwattr $C$DW$T$1134, DW_AT_language(DW_LANG_C)
    1442                            .dwattr $C$DW$T$1134, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pa
    1443                            .dwattr $C$DW$T$1134, DW_AT_decl_line(0x36f)
    1444                            .dwattr $C$DW$T$1134, DW_AT_decl_column(0x4c)
    1445                    
    1446                    
    1447                    $C$DW$T$119     .dwtag  DW_TAG_structure_type
    1448                            .dwattr $C$DW$T$119, DW_AT_byte_size(0x08)
    1449                    $C$DW$101       .dwtag  DW_TAG_member
    1450                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$10)
    1451                            .dwattr $C$DW$101, DW_AT_name("length")
    1452                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("length")
    1453                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1454                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1455                            .dwattr $C$DW$101, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    1456                            .dwattr $C$DW$101, DW_AT_decl_line(0x370)
    1457                            .dwattr $C$DW$101, DW_AT_decl_column(0x16)
    1458                    
    1459                    $C$DW$102       .dwtag  DW_TAG_member
    1460                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$118)
    1461                            .dwattr $C$DW$102, DW_AT_name("elem")
    1462                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("elem")
    1463                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1464                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1465                            .dwattr $C$DW$102, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/packa
    1466                            .dwattr $C$DW$102, DW_AT_decl_line(0x370)
    1467                            .dwattr $C$DW$102, DW_AT_decl_column(0x4a)
    1468                    
    1469                            .dwattr $C$DW$T$119, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pac
    1470                            .dwattr $C$DW$T$119, DW_AT_decl_line(0x370)
    1471                            .dwattr $C$DW$T$119, DW_AT_decl_column(0x10)
    1472                            .dwendtag $C$DW$T$119
    1473                    
    1474                    $C$DW$T$1135    .dwtag  DW_TAG_typedef
    1475                            .dwattr $C$DW$T$1135, DW_AT_name("__CARRAY1_ti_sysbios_family_arm_m3_Hwi_hooks")
    1476                            .dwattr $C$DW$T$1135, DW_AT_type(*$C$DW$T$119)
    1477                            .dwattr $C$DW$T$1135, DW_AT_language(DW_LANG_C)
    1478                            .dwattr $C$DW$T$1135, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pa
    1479                            .dwattr $C$DW$T$1135, DW_AT_decl_line(0x370)
    1480                            .dwattr $C$DW$T$1135, DW_AT_decl_column(0x52)
    1481                    
    1482                    $C$DW$T$1136    .dwtag  DW_TAG_typedef
    1483                            .dwattr $C$DW$T$1136, DW_AT_name("CT__ti_sysbios_family_arm_m3_Hwi_hooks")
    1484                            .dwattr $C$DW$T$1136, DW_AT_type(*$C$DW$T$1135)
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:42 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{667561A1-166B-4C20-ACEB-DD6F4E324E01} PAGE   28

    1485                            .dwattr $C$DW$T$1136, DW_AT_language(DW_LANG_C)
    1486                            .dwattr $C$DW$T$1136, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pa
    1487                            .dwattr $C$DW$T$1136, DW_AT_decl_line(0x372)
    1488                            .dwattr $C$DW$T$1136, DW_AT_decl_column(0x36)
    1489                    
    1490                    $C$DW$T$1137    .dwtag  DW_TAG_typedef
    1491                            .dwattr $C$DW$T$1137, DW_AT_name("__TA_ti_sysbios_family_arm_m3_Hwi_hooks")
    1492                            .dwattr $C$DW$T$1137, DW_AT_type(*$C$DW$T$1135)
    1493                            .dwattr $C$DW$T$1137, DW_AT_language(DW_LANG_C)
    1494                            .dwattr $C$DW$T$1137, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/kernel/tirtos/pa
    1495                            .dwattr $C$DW$T$1137, DW_AT_decl_line(0x371)
    1496                            .dwattr $C$DW$T$1137, DW_AT_decl_column(0x36)
    1497                    
    1498                    
    1499                    $C$DW$T$159     .dwtag  DW_TAG_structure_type
    1500                            .dwattr $C$DW$T$159, DW_AT_byte_size(0x4c)
    1501                    $C$DW$103       .dwtag  DW_TAG_member
    1502                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$123)
    1503                            .dwattr $C$DW$103, DW_AT_name("Crc32")
    1504                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("Crc32")
    1505                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1506                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1507                            .dwattr $C$DW$103, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1508                            .dwattr $C$DW$103, DW_AT_decl_line(0x76)
    1509                            .dwattr $C$DW$103, DW_AT_decl_column(0x25)
    1510                    
    1511                    $C$DW$104       .dwtag  DW_TAG_member
    1512                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$126)
    1513                            .dwattr $C$DW$104, DW_AT_name("FlashGetSize")
    1514                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("FlashGetSize")
    1515                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1516                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1517                            .dwattr $C$DW$104, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1518                            .dwattr $C$DW$104, DW_AT_decl_line(0x77)
    1519                            .dwattr $C$DW$104, DW_AT_decl_column(0x25)
    1520                    
    1521                    $C$DW$105       .dwtag  DW_TAG_member
    1522                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$127)
    1523                            .dwattr $C$DW$105, DW_AT_name("GetChipId")
    1524                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("GetChipId")
    1525                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1526                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1527                            .dwattr $C$DW$105, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1528                            .dwattr $C$DW$105, DW_AT_decl_line(0x78)
    1529                            .dwattr $C$DW$105, DW_AT_decl_column(0x25)
    1530                    
    1531                    $C$DW$106       .dwtag  DW_TAG_member
    1532                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$130)
    1533                            .dwattr $C$DW$106, DW_AT_name("ReservedLocation1")
    1534                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("ReservedLocation1")
    1535                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1536                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1537                            .dwattr $C$DW$106, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1538                            .dwattr $C$DW$106, DW_AT_decl_line(0x79)
    1539                            .dwattr $C$DW$106, DW_AT_decl_column(0x25)
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:42 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{667561A1-166B-4C20-ACEB-DD6F4E324E01} PAGE   29

    1540                    
    1541                    $C$DW$107       .dwtag  DW_TAG_member
    1542                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$131)
    1543                            .dwattr $C$DW$107, DW_AT_name("ReservedLocation2")
    1544                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("ReservedLocation2")
    1545                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1546                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1547                            .dwattr $C$DW$107, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1548                            .dwattr $C$DW$107, DW_AT_decl_line(0x7a)
    1549                            .dwattr $C$DW$107, DW_AT_decl_column(0x25)
    1550                    
    1551                    $C$DW$108       .dwtag  DW_TAG_member
    1552                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$132)
    1553                            .dwattr $C$DW$108, DW_AT_name("ReservedLocation3")
    1554                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("ReservedLocation3")
    1555                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1556                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1557                            .dwattr $C$DW$108, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1558                            .dwattr $C$DW$108, DW_AT_decl_line(0x7b)
    1559                            .dwattr $C$DW$108, DW_AT_decl_column(0x25)
    1560                    
    1561                    $C$DW$109       .dwtag  DW_TAG_member
    1562                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$135)
    1563                            .dwattr $C$DW$109, DW_AT_name("ResetDevice")
    1564                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("ResetDevice")
    1565                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1566                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1567                            .dwattr $C$DW$109, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1568                            .dwattr $C$DW$109, DW_AT_decl_line(0x7c)
    1569                            .dwattr $C$DW$109, DW_AT_decl_column(0x25)
    1570                    
    1571                    $C$DW$110       .dwtag  DW_TAG_member
    1572                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$140)
    1573                            .dwattr $C$DW$110, DW_AT_name("Fletcher32")
    1574                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("Fletcher32")
    1575                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1576                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1577                            .dwattr $C$DW$110, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1578                            .dwattr $C$DW$110, DW_AT_decl_line(0x7d)
    1579                            .dwattr $C$DW$110, DW_AT_decl_column(0x25)
    1580                    
    1581                    $C$DW$111       .dwtag  DW_TAG_member
    1582                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$144)
    1583                            .dwattr $C$DW$111, DW_AT_name("MinValue")
    1584                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("MinValue")
    1585                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1586                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1587                            .dwattr $C$DW$111, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1588                            .dwattr $C$DW$111, DW_AT_decl_line(0x7e)
    1589                            .dwattr $C$DW$111, DW_AT_decl_column(0x25)
    1590                    
    1591                    $C$DW$112       .dwtag  DW_TAG_member
    1592                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$145)
    1593                            .dwattr $C$DW$112, DW_AT_name("MaxValue")
    1594                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("MaxValue")
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:42 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{667561A1-166B-4C20-ACEB-DD6F4E324E01} PAGE   30

    1595                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1596                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1597                            .dwattr $C$DW$112, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1598                            .dwattr $C$DW$112, DW_AT_decl_line(0x7f)
    1599                            .dwattr $C$DW$112, DW_AT_decl_column(0x25)
    1600                    
    1601                    $C$DW$113       .dwtag  DW_TAG_member
    1602                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$146)
    1603                            .dwattr $C$DW$113, DW_AT_name("MeanValue")
    1604                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("MeanValue")
    1605                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1606                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1607                            .dwattr $C$DW$113, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1608                            .dwattr $C$DW$113, DW_AT_decl_line(0x80)
    1609                            .dwattr $C$DW$113, DW_AT_decl_column(0x25)
    1610                    
    1611                    $C$DW$114       .dwtag  DW_TAG_member
    1612                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$147)
    1613                            .dwattr $C$DW$114, DW_AT_name("StandDeviationValue")
    1614                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("StandDeviationValue")
    1615                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1616                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1617                            .dwattr $C$DW$114, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1618                            .dwattr $C$DW$114, DW_AT_decl_line(0x81)
    1619                            .dwattr $C$DW$114, DW_AT_decl_column(0x25)
    1620                    
    1621                    $C$DW$115       .dwtag  DW_TAG_member
    1622                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$150)
    1623                            .dwattr $C$DW$115, DW_AT_name("ReservedLocation4")
    1624                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("ReservedLocation4")
    1625                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1626                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1627                            .dwattr $C$DW$115, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1628                            .dwattr $C$DW$115, DW_AT_decl_line(0x82)
    1629                            .dwattr $C$DW$115, DW_AT_decl_column(0x25)
    1630                    
    1631                    $C$DW$116       .dwtag  DW_TAG_member
    1632                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$151)
    1633                            .dwattr $C$DW$116, DW_AT_name("ReservedLocation5")
    1634                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("ReservedLocation5")
    1635                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1636                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1637                            .dwattr $C$DW$116, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1638                            .dwattr $C$DW$116, DW_AT_decl_line(0x83)
    1639                            .dwattr $C$DW$116, DW_AT_decl_column(0x25)
    1640                    
    1641                    $C$DW$117       .dwtag  DW_TAG_member
    1642                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$152)
    1643                            .dwattr $C$DW$117, DW_AT_name("HFSourceSafeSwitch")
    1644                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    1645                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1646                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1647                            .dwattr $C$DW$117, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1648                            .dwattr $C$DW$117, DW_AT_decl_line(0x84)
    1649                            .dwattr $C$DW$117, DW_AT_decl_column(0x25)
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:42 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{667561A1-166B-4C20-ACEB-DD6F4E324E01} PAGE   31

    1650                    
    1651                    $C$DW$118       .dwtag  DW_TAG_member
    1652                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$155)
    1653                            .dwattr $C$DW$118, DW_AT_name("SelectCompAInput")
    1654                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("SelectCompAInput")
    1655                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1656                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1657                            .dwattr $C$DW$118, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1658                            .dwattr $C$DW$118, DW_AT_decl_line(0x85)
    1659                            .dwattr $C$DW$118, DW_AT_decl_column(0x25)
    1660                    
    1661                    $C$DW$119       .dwtag  DW_TAG_member
    1662                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$156)
    1663                            .dwattr $C$DW$119, DW_AT_name("SelectCompARef")
    1664                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("SelectCompARef")
    1665                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1666                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1667                            .dwattr $C$DW$119, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1668                            .dwattr $C$DW$119, DW_AT_decl_line(0x86)
    1669                            .dwattr $C$DW$119, DW_AT_decl_column(0x25)
    1670                    
    1671                    $C$DW$120       .dwtag  DW_TAG_member
    1672                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$157)
    1673                            .dwattr $C$DW$120, DW_AT_name("SelectADCCompBInput")
    1674                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("SelectADCCompBInput")
    1675                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1676                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1677                            .dwattr $C$DW$120, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1678                            .dwattr $C$DW$120, DW_AT_decl_line(0x87)
    1679                            .dwattr $C$DW$120, DW_AT_decl_column(0x25)
    1680                    
    1681                    $C$DW$121       .dwtag  DW_TAG_member
    1682                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$158)
    1683                            .dwattr $C$DW$121, DW_AT_name("SelectCompBRef")
    1684                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("SelectCompBRef")
    1685                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1686                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1687                            .dwattr $C$DW$121, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1688                            .dwattr $C$DW$121, DW_AT_decl_line(0x88)
    1689                            .dwattr $C$DW$121, DW_AT_decl_column(0x25)
    1690                    
    1691                            .dwattr $C$DW$T$159, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    1692                            .dwattr $C$DW$T$159, DW_AT_decl_line(0x75)
    1693                            .dwattr $C$DW$T$159, DW_AT_decl_column(0x01)
    1694                            .dwendtag $C$DW$T$159
    1695                    
    1696                    $C$DW$T$1138    .dwtag  DW_TAG_typedef
    1697                            .dwattr $C$DW$T$1138, DW_AT_name("HARD_API_T")
    1698                            .dwattr $C$DW$T$1138, DW_AT_type(*$C$DW$T$159)
    1699                            .dwattr $C$DW$T$1138, DW_AT_language(DW_LANG_C)
    1700                            .dwattr $C$DW$T$1138, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\device
    1701                            .dwattr $C$DW$T$1138, DW_AT_decl_line(0x89)
    1702                            .dwattr $C$DW$T$1138, DW_AT_decl_column(0x03)
    1703                    
    1704                    
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:42 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{667561A1-166B-4C20-ACEB-DD6F4E324E01} PAGE   32

    1705                    $C$DW$T$163     .dwtag  DW_TAG_structure_type
    1706                            .dwattr $C$DW$T$163, DW_AT_byte_size(0x10)
    1707                    $C$DW$122       .dwtag  DW_TAG_member
    1708                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$161)
    1709                            .dwattr $C$DW$122, DW_AT_name("pvSrcEndAddr")
    1710                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("pvSrcEndAddr")
    1711                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1712                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1713                            .dwattr $C$DW$122, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1714                            .dwattr $C$DW$122, DW_AT_decl_line(0x69)
    1715                            .dwattr $C$DW$122, DW_AT_decl_column(0x14)
    1716                    
    1717                    $C$DW$123       .dwtag  DW_TAG_member
    1718                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$161)
    1719                            .dwattr $C$DW$123, DW_AT_name("pvDstEndAddr")
    1720                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("pvDstEndAddr")
    1721                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1722                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1723                            .dwattr $C$DW$123, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1724                            .dwattr $C$DW$123, DW_AT_decl_line(0x6a)
    1725                            .dwattr $C$DW$123, DW_AT_decl_column(0x14)
    1726                    
    1727                    $C$DW$124       .dwtag  DW_TAG_member
    1728                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$162)
    1729                            .dwattr $C$DW$124, DW_AT_name("ui32Control")
    1730                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("ui32Control")
    1731                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1732                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1733                            .dwattr $C$DW$124, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1734                            .dwattr $C$DW$124, DW_AT_decl_line(0x6b)
    1735                            .dwattr $C$DW$124, DW_AT_decl_column(0x17)
    1736                    
    1737                    $C$DW$125       .dwtag  DW_TAG_member
    1738                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$162)
    1739                            .dwattr $C$DW$125, DW_AT_name("ui32Spare")
    1740                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("ui32Spare")
    1741                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1742                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1743                            .dwattr $C$DW$125, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1744                            .dwattr $C$DW$125, DW_AT_decl_line(0x6c)
    1745                            .dwattr $C$DW$125, DW_AT_decl_column(0x17)
    1746                    
    1747                            .dwattr $C$DW$T$163, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    1748                            .dwattr $C$DW$T$163, DW_AT_decl_line(0x68)
    1749                            .dwattr $C$DW$T$163, DW_AT_decl_column(0x01)
    1750                            .dwendtag $C$DW$T$163
    1751                    
    1752                    $C$DW$T$1139    .dwtag  DW_TAG_typedef
    1753                            .dwattr $C$DW$T$1139, DW_AT_name("tDMAControlTable")
    1754                            .dwattr $C$DW$T$1139, DW_AT_type(*$C$DW$T$163)
    1755                            .dwattr $C$DW$T$1139, DW_AT_language(DW_LANG_C)
    1756                            .dwattr $C$DW$T$1139, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/device
    1757                            .dwattr $C$DW$T$1139, DW_AT_decl_line(0x6e)
    1758                            .dwattr $C$DW$T$1139, DW_AT_decl_column(0x01)
    1759                    
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:42 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{667561A1-166B-4C20-ACEB-DD6F4E324E01} PAGE   33

    1760                    
    1761                    $C$DW$T$164     .dwtag  DW_TAG_structure_type
    1762                            .dwattr $C$DW$T$164, DW_AT_byte_size(0x08)
    1763                    $C$DW$126       .dwtag  DW_TAG_member
    1764                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$120)
    1765                            .dwattr $C$DW$126, DW_AT_name("pCurrEntry")
    1766                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("pCurrEntry")
    1767                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1768                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1769                            .dwattr $C$DW$126, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1770                            .dwattr $C$DW$126, DW_AT_decl_line(0x41)
    1771                            .dwattr $C$DW$126, DW_AT_decl_column(0x0d)
    1772                    
    1773                    $C$DW$127       .dwtag  DW_TAG_member
    1774                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$120)
    1775                            .dwattr $C$DW$127, DW_AT_name("pLastEntry")
    1776                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("pLastEntry")
    1777                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1778                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1779                            .dwattr $C$DW$127, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    1780                            .dwattr $C$DW$127, DW_AT_decl_line(0x42)
    1781                            .dwattr $C$DW$127, DW_AT_decl_column(0x0d)
    1782                    
    1783                            .dwattr $C$DW$T$164, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    1784                            .dwattr $C$DW$T$164, DW_AT_decl_line(0x40)
    1785                            .dwattr $C$DW$T$164, DW_AT_decl_column(0x10)
    1786                            .dwendtag $C$DW$T$164
    1787                    
    1788                    $C$DW$T$692     .dwtag  DW_TAG_typedef
    1789                            .dwattr $C$DW$T$692, DW_AT_name("dataQueue_t")
    1790                            .dwattr $C$DW$T$692, DW_AT_type(*$C$DW$T$164)
    1791                            .dwattr $C$DW$T$692, DW_AT_language(DW_LANG_C)
    1792                            .dwattr $C$DW$T$692, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    1793                            .dwattr $C$DW$T$692, DW_AT_decl_line(0x43)
    1794                            .dwattr $C$DW$T$692, DW_AT_decl_column(0x03)
    1795                    
    1796                    $C$DW$T$693     .dwtag  DW_TAG_pointer_type
    1797                            .dwattr $C$DW$T$693, DW_AT_type(*$C$DW$T$692)
    1798                            .dwattr $C$DW$T$693, DW_AT_address_class(0x20)
    1799                    
    1800                    
    1801                    $C$DW$T$165     .dwtag  DW_TAG_structure_type
    1802                            .dwattr $C$DW$T$165, DW_AT_byte_size(0x01)
    1803                    $C$DW$128       .dwtag  DW_TAG_member
    1804                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$109)
    1805                            .dwattr $C$DW$128, DW_AT_name("triggerType")
    1806                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("triggerType")
    1807                            .dwattr $C$DW$128, DW_AT_bit_offset(0x04)
    1808                            .dwattr $C$DW$128, DW_AT_bit_size(0x04)
    1809                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1810                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1811                            .dwattr $C$DW$128, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1812                            .dwattr $C$DW$128, DW_AT_decl_line(0x77)
    1813                            .dwattr $C$DW$128, DW_AT_decl_column(0x0f)
    1814                    
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:42 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{667561A1-166B-4C20-ACEB-DD6F4E324E01} PAGE   34

    1815                    $C$DW$129       .dwtag  DW_TAG_member
    1816                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$109)
    1817                            .dwattr $C$DW$129, DW_AT_name("bEnaCmd")
    1818                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("bEnaCmd")
    1819                            .dwattr $C$DW$129, DW_AT_bit_offset(0x03)
    1820                            .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1821                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1822                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1823                            .dwattr $C$DW$129, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1824                            .dwattr $C$DW$129, DW_AT_decl_line(0x78)
    1825                            .dwattr $C$DW$129, DW_AT_decl_column(0x0f)
    1826                    
    1827                    $C$DW$130       .dwtag  DW_TAG_member
    1828                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$109)
    1829                            .dwattr $C$DW$130, DW_AT_name("triggerNo")
    1830                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("triggerNo")
    1831                            .dwattr $C$DW$130, DW_AT_bit_offset(0x01)
    1832                            .dwattr $C$DW$130, DW_AT_bit_size(0x02)
    1833                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1834                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1835                            .dwattr $C$DW$130, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1836                            .dwattr $C$DW$130, DW_AT_decl_line(0x7a)
    1837                            .dwattr $C$DW$130, DW_AT_decl_column(0x0f)
    1838                    
    1839                    $C$DW$131       .dwtag  DW_TAG_member
    1840                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$109)
    1841                            .dwattr $C$DW$131, DW_AT_name("pastTrig")
    1842                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("pastTrig")
    1843                            .dwattr $C$DW$131, DW_AT_bit_offset(0x00)
    1844                            .dwattr $C$DW$131, DW_AT_bit_size(0x01)
    1845                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1846                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1847                            .dwattr $C$DW$131, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1848                            .dwattr $C$DW$131, DW_AT_decl_line(0x7b)
    1849                            .dwattr $C$DW$131, DW_AT_decl_column(0x0f)
    1850                    
    1851                            .dwattr $C$DW$T$165, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    1852                            .dwattr $C$DW$T$165, DW_AT_decl_line(0x76)
    1853                            .dwattr $C$DW$T$165, DW_AT_decl_column(0x0b)
    1854                            .dwendtag $C$DW$T$165
    1855                    
    1856                    
    1857                    $C$DW$T$166     .dwtag  DW_TAG_structure_type
    1858                            .dwattr $C$DW$T$166, DW_AT_byte_size(0x01)
    1859                    $C$DW$132       .dwtag  DW_TAG_member
    1860                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$109)
    1861                            .dwattr $C$DW$132, DW_AT_name("rule")
    1862                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("rule")
    1863                            .dwattr $C$DW$132, DW_AT_bit_offset(0x04)
    1864                            .dwattr $C$DW$132, DW_AT_bit_size(0x04)
    1865                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1866                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1867                            .dwattr $C$DW$132, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1868                            .dwattr $C$DW$132, DW_AT_decl_line(0x7f)
    1869                            .dwattr $C$DW$132, DW_AT_decl_column(0x0f)
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:42 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{667561A1-166B-4C20-ACEB-DD6F4E324E01} PAGE   35

    1870                    
    1871                    $C$DW$133       .dwtag  DW_TAG_member
    1872                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$109)
    1873                            .dwattr $C$DW$133, DW_AT_name("nSkip")
    1874                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("nSkip")
    1875                            .dwattr $C$DW$133, DW_AT_bit_offset(0x00)
    1876                            .dwattr $C$DW$133, DW_AT_bit_size(0x04)
    1877                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1878                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1879                            .dwattr $C$DW$133, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1880                            .dwattr $C$DW$133, DW_AT_decl_line(0x80)
    1881                            .dwattr $C$DW$133, DW_AT_decl_column(0x0f)
    1882                    
    1883                            .dwattr $C$DW$T$166, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    1884                            .dwattr $C$DW$T$166, DW_AT_decl_line(0x7e)
    1885                            .dwattr $C$DW$T$166, DW_AT_decl_column(0x0b)
    1886                            .dwendtag $C$DW$T$166
    1887                    
    1888                    
    1889                    $C$DW$T$167     .dwtag  DW_TAG_structure_type
    1890                            .dwattr $C$DW$T$167, DW_AT_byte_size(0x01)
    1891                    $C$DW$134       .dwtag  DW_TAG_member
    1892                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$109)
    1893                            .dwattr $C$DW$134, DW_AT_name("triggerType")
    1894                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("triggerType")
    1895                            .dwattr $C$DW$134, DW_AT_bit_offset(0x04)
    1896                            .dwattr $C$DW$134, DW_AT_bit_size(0x04)
    1897                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1898                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1899                            .dwattr $C$DW$134, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1900                            .dwattr $C$DW$134, DW_AT_decl_line(0x92)
    1901                            .dwattr $C$DW$134, DW_AT_decl_column(0x0f)
    1902                    
    1903                    $C$DW$135       .dwtag  DW_TAG_member
    1904                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$109)
    1905                            .dwattr $C$DW$135, DW_AT_name("bEnaCmd")
    1906                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("bEnaCmd")
    1907                            .dwattr $C$DW$135, DW_AT_bit_offset(0x03)
    1908                            .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    1909                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1910                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1911                            .dwattr $C$DW$135, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1912                            .dwattr $C$DW$135, DW_AT_decl_line(0x93)
    1913                            .dwattr $C$DW$135, DW_AT_decl_column(0x0f)
    1914                    
    1915                    $C$DW$136       .dwtag  DW_TAG_member
    1916                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$109)
    1917                            .dwattr $C$DW$136, DW_AT_name("triggerNo")
    1918                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("triggerNo")
    1919                            .dwattr $C$DW$136, DW_AT_bit_offset(0x01)
    1920                            .dwattr $C$DW$136, DW_AT_bit_size(0x02)
    1921                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1922                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1923                            .dwattr $C$DW$136, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1924                            .dwattr $C$DW$136, DW_AT_decl_line(0x95)
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:42 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{667561A1-166B-4C20-ACEB-DD6F4E324E01} PAGE   36

    1925                            .dwattr $C$DW$136, DW_AT_decl_column(0x0f)
    1926                    
    1927                    $C$DW$137       .dwtag  DW_TAG_member
    1928                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$109)
    1929                            .dwattr $C$DW$137, DW_AT_name("pastTrig")
    1930                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("pastTrig")
    1931                            .dwattr $C$DW$137, DW_AT_bit_offset(0x00)
    1932                            .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    1933                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1934                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1935                            .dwattr $C$DW$137, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1936                            .dwattr $C$DW$137, DW_AT_decl_line(0x96)
    1937                            .dwattr $C$DW$137, DW_AT_decl_column(0x0f)
    1938                    
    1939                            .dwattr $C$DW$T$167, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    1940                            .dwattr $C$DW$T$167, DW_AT_decl_line(0x91)
    1941                            .dwattr $C$DW$T$167, DW_AT_decl_column(0x0b)
    1942                            .dwendtag $C$DW$T$167
    1943                    
    1944                    
    1945                    $C$DW$T$168     .dwtag  DW_TAG_structure_type
    1946                            .dwattr $C$DW$T$168, DW_AT_byte_size(0x01)
    1947                    $C$DW$138       .dwtag  DW_TAG_member
    1948                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$109)
    1949                            .dwattr $C$DW$138, DW_AT_name("rule")
    1950                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("rule")
    1951                            .dwattr $C$DW$138, DW_AT_bit_offset(0x04)
    1952                            .dwattr $C$DW$138, DW_AT_bit_size(0x04)
    1953                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1954                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1955                            .dwattr $C$DW$138, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1956                            .dwattr $C$DW$138, DW_AT_decl_line(0x9a)
    1957                            .dwattr $C$DW$138, DW_AT_decl_column(0x0f)
    1958                    
    1959                    $C$DW$139       .dwtag  DW_TAG_member
    1960                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$109)
    1961                            .dwattr $C$DW$139, DW_AT_name("nSkip")
    1962                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("nSkip")
    1963                            .dwattr $C$DW$139, DW_AT_bit_offset(0x00)
    1964                            .dwattr $C$DW$139, DW_AT_bit_size(0x04)
    1965                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1966                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1967                            .dwattr $C$DW$139, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1968                            .dwattr $C$DW$139, DW_AT_decl_line(0x9b)
    1969                            .dwattr $C$DW$139, DW_AT_decl_column(0x0f)
    1970                    
    1971                            .dwattr $C$DW$T$168, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    1972                            .dwattr $C$DW$T$168, DW_AT_decl_line(0x99)
    1973                            .dwattr $C$DW$T$168, DW_AT_decl_column(0x0b)
    1974                            .dwendtag $C$DW$T$168
    1975                    
    1976                    
    1977                    $C$DW$T$169     .dwtag  DW_TAG_structure_type
    1978                            .dwattr $C$DW$T$169, DW_AT_byte_size(0x01)
    1979                    $C$DW$140       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:42 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{667561A1-166B-4C20-ACEB-DD6F4E324E01} PAGE   37

    1980                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$109)
    1981                            .dwattr $C$DW$140, DW_AT_name("triggerType")
    1982                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("triggerType")
    1983                            .dwattr $C$DW$140, DW_AT_bit_offset(0x04)
    1984                            .dwattr $C$DW$140, DW_AT_bit_size(0x04)
    1985                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1986                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1987                            .dwattr $C$DW$140, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    1988                            .dwattr $C$DW$140, DW_AT_decl_line(0xad)
    1989                            .dwattr $C$DW$140, DW_AT_decl_column(0x0f)
    1990                    
    1991                    $C$DW$141       .dwtag  DW_TAG_member
    1992                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$109)
    1993                            .dwattr $C$DW$141, DW_AT_name("bEnaCmd")
    1994                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("bEnaCmd")
    1995                            .dwattr $C$DW$141, DW_AT_bit_offset(0x03)
    1996                            .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    1997                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1998                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1999                            .dwattr $C$DW$141, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2000                            .dwattr $C$DW$141, DW_AT_decl_line(0xae)
    2001                            .dwattr $C$DW$141, DW_AT_decl_column(0x0f)
    2002                    
    2003                    $C$DW$142       .dwtag  DW_TAG_member
    2004                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$109)
    2005                            .dwattr $C$DW$142, DW_AT_name("triggerNo")
    2006                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("triggerNo")
    2007                            .dwattr $C$DW$142, DW_AT_bit_offset(0x01)
    2008                            .dwattr $C$DW$142, DW_AT_bit_size(0x02)
    2009                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2010                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2011                            .dwattr $C$DW$142, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2012                            .dwattr $C$DW$142, DW_AT_decl_line(0xb0)
    2013                            .dwattr $C$DW$142, DW_AT_decl_column(0x0f)
    2014                    
    2015                    $C$DW$143       .dwtag  DW_TAG_member
    2016                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$109)
    2017                            .dwattr $C$DW$143, DW_AT_name("pastTrig")
    2018                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("pastTrig")
    2019                            .dwattr $C$DW$143, DW_AT_bit_offset(0x00)
    2020                            .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    2021                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2022                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2023                            .dwattr $C$DW$143, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2024                            .dwattr $C$DW$143, DW_AT_decl_line(0xb1)
    2025                            .dwattr $C$DW$143, DW_AT_decl_column(0x0f)
    2026                    
    2027                            .dwattr $C$DW$T$169, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2028                            .dwattr $C$DW$T$169, DW_AT_decl_line(0xac)
    2029                            .dwattr $C$DW$T$169, DW_AT_decl_column(0x0b)
    2030                            .dwendtag $C$DW$T$169
    2031                    
    2032                    
    2033                    $C$DW$T$170     .dwtag  DW_TAG_structure_type
    2034                            .dwattr $C$DW$T$170, DW_AT_byte_size(0x01)
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:42 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{667561A1-166B-4C20-ACEB-DD6F4E324E01} PAGE   38

    2035                    $C$DW$144       .dwtag  DW_TAG_member
    2036                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$109)
    2037                            .dwattr $C$DW$144, DW_AT_name("rule")
    2038                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("rule")
    2039                            .dwattr $C$DW$144, DW_AT_bit_offset(0x04)
    2040                            .dwattr $C$DW$144, DW_AT_bit_size(0x04)
    2041                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2042                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2043                            .dwattr $C$DW$144, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2044                            .dwattr $C$DW$144, DW_AT_decl_line(0xb5)
    2045                            .dwattr $C$DW$144, DW_AT_decl_column(0x0f)
    2046                    
    2047                    $C$DW$145       .dwtag  DW_TAG_member
    2048                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$109)
    2049                            .dwattr $C$DW$145, DW_AT_name("nSkip")
    2050                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("nSkip")
    2051                            .dwattr $C$DW$145, DW_AT_bit_offset(0x00)
    2052                            .dwattr $C$DW$145, DW_AT_bit_size(0x04)
    2053                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2054                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2055                            .dwattr $C$DW$145, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2056                            .dwattr $C$DW$145, DW_AT_decl_line(0xb6)
    2057                            .dwattr $C$DW$145, DW_AT_decl_column(0x0f)
    2058                    
    2059                            .dwattr $C$DW$T$170, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2060                            .dwattr $C$DW$T$170, DW_AT_decl_line(0xb4)
    2061                            .dwattr $C$DW$T$170, DW_AT_decl_column(0x0b)
    2062                            .dwendtag $C$DW$T$170
    2063                    
    2064                    
    2065                    $C$DW$T$171     .dwtag  DW_TAG_structure_type
    2066                            .dwattr $C$DW$T$171, DW_AT_byte_size(0x02)
    2067                    $C$DW$146       .dwtag  DW_TAG_member
    2068                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$136)
    2069                            .dwattr $C$DW$146, DW_AT_name("frontEndMode")
    2070                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("frontEndMode")
    2071                            .dwattr $C$DW$146, DW_AT_bit_offset(0x0d)
    2072                            .dwattr $C$DW$146, DW_AT_bit_size(0x03)
    2073                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2074                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2075                            .dwattr $C$DW$146, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2076                            .dwattr $C$DW$146, DW_AT_decl_line(0xc3)
    2077                            .dwattr $C$DW$146, DW_AT_decl_column(0x10)
    2078                    
    2079                    $C$DW$147       .dwtag  DW_TAG_member
    2080                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$136)
    2081                            .dwattr $C$DW$147, DW_AT_name("biasMode")
    2082                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("biasMode")
    2083                            .dwattr $C$DW$147, DW_AT_bit_offset(0x0c)
    2084                            .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    2085                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2086                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2087                            .dwattr $C$DW$147, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2088                            .dwattr $C$DW$147, DW_AT_decl_line(0xc9)
    2089                            .dwattr $C$DW$147, DW_AT_decl_column(0x10)
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:42 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{667561A1-166B-4C20-ACEB-DD6F4E324E01} PAGE   39

    2090                    
    2091                    $C$DW$148       .dwtag  DW_TAG_member
    2092                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$136)
    2093                            .dwattr $C$DW$148, DW_AT_name("analogCfgMode")
    2094                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("analogCfgMode")
    2095                            .dwattr $C$DW$148, DW_AT_bit_offset(0x06)
    2096                            .dwattr $C$DW$148, DW_AT_bit_size(0x06)
    2097                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2098                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2099                            .dwattr $C$DW$148, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2100                            .dwattr $C$DW$148, DW_AT_decl_line(0xcb)
    2101                            .dwattr $C$DW$148, DW_AT_decl_column(0x10)
    2102                    
    2103                    $C$DW$149       .dwtag  DW_TAG_member
    2104                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$136)
    2105                            .dwattr $C$DW$149, DW_AT_name("bNoFsPowerUp")
    2106                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("bNoFsPowerUp")
    2107                            .dwattr $C$DW$149, DW_AT_bit_offset(0x05)
    2108                            .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    2109                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2110                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2111                            .dwattr $C$DW$149, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2112                            .dwattr $C$DW$149, DW_AT_decl_line(0xd2)
    2113                            .dwattr $C$DW$149, DW_AT_decl_column(0x10)
    2114                    
    2115                            .dwattr $C$DW$T$171, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2116                            .dwattr $C$DW$T$171, DW_AT_decl_line(0xc2)
    2117                            .dwattr $C$DW$T$171, DW_AT_decl_column(0x0b)
    2118                            .dwendtag $C$DW$T$171
    2119                    
    2120                    
    2121                    $C$DW$T$172     .dwtag  DW_TAG_structure_type
    2122                            .dwattr $C$DW$T$172, DW_AT_byte_size(0x01)
    2123                    $C$DW$150       .dwtag  DW_TAG_member
    2124                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$109)
    2125                            .dwattr $C$DW$150, DW_AT_name("triggerType")
    2126                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("triggerType")
    2127                            .dwattr $C$DW$150, DW_AT_bit_offset(0x04)
    2128                            .dwattr $C$DW$150, DW_AT_bit_size(0x04)
    2129                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2130                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2131                            .dwattr $C$DW$150, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2132                            .dwattr $C$DW$150, DW_AT_decl_line(0xe8)
    2133                            .dwattr $C$DW$150, DW_AT_decl_column(0x0f)
    2134                    
    2135                    $C$DW$151       .dwtag  DW_TAG_member
    2136                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$109)
    2137                            .dwattr $C$DW$151, DW_AT_name("bEnaCmd")
    2138                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("bEnaCmd")
    2139                            .dwattr $C$DW$151, DW_AT_bit_offset(0x03)
    2140                            .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    2141                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2142                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2143                            .dwattr $C$DW$151, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2144                            .dwattr $C$DW$151, DW_AT_decl_line(0xe9)
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:42 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{667561A1-166B-4C20-ACEB-DD6F4E324E01} PAGE   40

    2145                            .dwattr $C$DW$151, DW_AT_decl_column(0x0f)
    2146                    
    2147                    $C$DW$152       .dwtag  DW_TAG_member
    2148                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$109)
    2149                            .dwattr $C$DW$152, DW_AT_name("triggerNo")
    2150                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("triggerNo")
    2151                            .dwattr $C$DW$152, DW_AT_bit_offset(0x01)
    2152                            .dwattr $C$DW$152, DW_AT_bit_size(0x02)
    2153                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2154                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2155                            .dwattr $C$DW$152, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2156                            .dwattr $C$DW$152, DW_AT_decl_line(0xeb)
    2157                            .dwattr $C$DW$152, DW_AT_decl_column(0x0f)
    2158                    
    2159                    $C$DW$153       .dwtag  DW_TAG_member
    2160                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$109)
    2161                            .dwattr $C$DW$153, DW_AT_name("pastTrig")
    2162                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("pastTrig")
    2163                            .dwattr $C$DW$153, DW_AT_bit_offset(0x00)
    2164                            .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    2165                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2166                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2167                            .dwattr $C$DW$153, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2168                            .dwattr $C$DW$153, DW_AT_decl_line(0xec)
    2169                            .dwattr $C$DW$153, DW_AT_decl_column(0x0f)
    2170                    
    2171                            .dwattr $C$DW$T$172, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2172                            .dwattr $C$DW$T$172, DW_AT_decl_line(0xe7)
    2173                            .dwattr $C$DW$T$172, DW_AT_decl_column(0x0b)
    2174                            .dwendtag $C$DW$T$172
    2175                    
    2176                    
    2177                    $C$DW$T$173     .dwtag  DW_TAG_structure_type
    2178                            .dwattr $C$DW$T$173, DW_AT_byte_size(0x01)
    2179                    $C$DW$154       .dwtag  DW_TAG_member
    2180                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$109)
    2181                            .dwattr $C$DW$154, DW_AT_name("rule")
    2182                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("rule")
    2183                            .dwattr $C$DW$154, DW_AT_bit_offset(0x04)
    2184                            .dwattr $C$DW$154, DW_AT_bit_size(0x04)
    2185                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2186                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2187                            .dwattr $C$DW$154, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2188                            .dwattr $C$DW$154, DW_AT_decl_line(0xf0)
    2189                            .dwattr $C$DW$154, DW_AT_decl_column(0x0f)
    2190                    
    2191                    $C$DW$155       .dwtag  DW_TAG_member
    2192                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$109)
    2193                            .dwattr $C$DW$155, DW_AT_name("nSkip")
    2194                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("nSkip")
    2195                            .dwattr $C$DW$155, DW_AT_bit_offset(0x00)
    2196                            .dwattr $C$DW$155, DW_AT_bit_size(0x04)
    2197                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2198                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2199                            .dwattr $C$DW$155, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:42 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{667561A1-166B-4C20-ACEB-DD6F4E324E01} PAGE   41

    2200                            .dwattr $C$DW$155, DW_AT_decl_line(0xf1)
    2201                            .dwattr $C$DW$155, DW_AT_decl_column(0x0f)
    2202                    
    2203                            .dwattr $C$DW$T$173, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2204                            .dwattr $C$DW$T$173, DW_AT_decl_line(0xef)
    2205                            .dwattr $C$DW$T$173, DW_AT_decl_column(0x0b)
    2206                            .dwendtag $C$DW$T$173
    2207                    
    2208                    
    2209                    $C$DW$T$174     .dwtag  DW_TAG_structure_type
    2210                            .dwattr $C$DW$T$174, DW_AT_byte_size(0x01)
    2211                    $C$DW$156       .dwtag  DW_TAG_member
    2212                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$109)
    2213                            .dwattr $C$DW$156, DW_AT_name("bTxMode")
    2214                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("bTxMode")
    2215                            .dwattr $C$DW$156, DW_AT_bit_offset(0x07)
    2216                            .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    2217                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2218                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2219                            .dwattr $C$DW$156, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2220                            .dwattr $C$DW$156, DW_AT_decl_line(0xf6)
    2221                            .dwattr $C$DW$156, DW_AT_decl_column(0x0f)
    2222                    
    2223                    $C$DW$157       .dwtag  DW_TAG_member
    2224                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$109)
    2225                            .dwattr $C$DW$157, DW_AT_name("refFreq")
    2226                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("refFreq")
    2227                            .dwattr $C$DW$157, DW_AT_bit_offset(0x01)
    2228                            .dwattr $C$DW$157, DW_AT_bit_size(0x06)
    2229                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2230                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2231                            .dwattr $C$DW$157, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2232                            .dwattr $C$DW$157, DW_AT_decl_line(0xf8)
    2233                            .dwattr $C$DW$157, DW_AT_decl_column(0x0f)
    2234                    
    2235                            .dwattr $C$DW$T$174, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2236                            .dwattr $C$DW$T$174, DW_AT_decl_line(0xf5)
    2237                            .dwattr $C$DW$T$174, DW_AT_decl_column(0x0b)
    2238                            .dwendtag $C$DW$T$174
    2239                    
    2240                    
    2241                    $C$DW$T$175     .dwtag  DW_TAG_structure_type
    2242                            .dwattr $C$DW$T$175, DW_AT_byte_size(0x01)
    2243                    $C$DW$158       .dwtag  DW_TAG_member
    2244                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$109)
    2245                            .dwattr $C$DW$158, DW_AT_name("triggerType")
    2246                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("triggerType")
    2247                            .dwattr $C$DW$158, DW_AT_bit_offset(0x04)
    2248                            .dwattr $C$DW$158, DW_AT_bit_size(0x04)
    2249                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2250                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2251                            .dwattr $C$DW$158, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2252                            .dwattr $C$DW$158, DW_AT_decl_line(0x10f)
    2253                            .dwattr $C$DW$158, DW_AT_decl_column(0x0f)
    2254                    
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:42 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{667561A1-166B-4C20-ACEB-DD6F4E324E01} PAGE   42

    2255                    $C$DW$159       .dwtag  DW_TAG_member
    2256                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$109)
    2257                            .dwattr $C$DW$159, DW_AT_name("bEnaCmd")
    2258                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("bEnaCmd")
    2259                            .dwattr $C$DW$159, DW_AT_bit_offset(0x03)
    2260                            .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    2261                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2262                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2263                            .dwattr $C$DW$159, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2264                            .dwattr $C$DW$159, DW_AT_decl_line(0x110)
    2265                            .dwattr $C$DW$159, DW_AT_decl_column(0x0f)
    2266                    
    2267                    $C$DW$160       .dwtag  DW_TAG_member
    2268                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$109)
    2269                            .dwattr $C$DW$160, DW_AT_name("triggerNo")
    2270                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("triggerNo")
    2271                            .dwattr $C$DW$160, DW_AT_bit_offset(0x01)
    2272                            .dwattr $C$DW$160, DW_AT_bit_size(0x02)
    2273                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2274                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2275                            .dwattr $C$DW$160, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2276                            .dwattr $C$DW$160, DW_AT_decl_line(0x112)
    2277                            .dwattr $C$DW$160, DW_AT_decl_column(0x0f)
    2278                    
    2279                    $C$DW$161       .dwtag  DW_TAG_member
    2280                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$109)
    2281                            .dwattr $C$DW$161, DW_AT_name("pastTrig")
    2282                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("pastTrig")
    2283                            .dwattr $C$DW$161, DW_AT_bit_offset(0x00)
    2284                            .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    2285                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2286                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2287                            .dwattr $C$DW$161, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2288                            .dwattr $C$DW$161, DW_AT_decl_line(0x113)
    2289                            .dwattr $C$DW$161, DW_AT_decl_column(0x0f)
    2290                    
    2291                            .dwattr $C$DW$T$175, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2292                            .dwattr $C$DW$T$175, DW_AT_decl_line(0x10e)
    2293                            .dwattr $C$DW$T$175, DW_AT_decl_column(0x0b)
    2294                            .dwendtag $C$DW$T$175
    2295                    
    2296                    
    2297                    $C$DW$T$176     .dwtag  DW_TAG_structure_type
    2298                            .dwattr $C$DW$T$176, DW_AT_byte_size(0x01)
    2299                    $C$DW$162       .dwtag  DW_TAG_member
    2300                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$109)
    2301                            .dwattr $C$DW$162, DW_AT_name("rule")
    2302                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("rule")
    2303                            .dwattr $C$DW$162, DW_AT_bit_offset(0x04)
    2304                            .dwattr $C$DW$162, DW_AT_bit_size(0x04)
    2305                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2306                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2307                            .dwattr $C$DW$162, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2308                            .dwattr $C$DW$162, DW_AT_decl_line(0x117)
    2309                            .dwattr $C$DW$162, DW_AT_decl_column(0x0f)
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:42 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{667561A1-166B-4C20-ACEB-DD6F4E324E01} PAGE   43

    2310                    
    2311                    $C$DW$163       .dwtag  DW_TAG_member
    2312                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$109)
    2313                            .dwattr $C$DW$163, DW_AT_name("nSkip")
    2314                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("nSkip")
    2315                            .dwattr $C$DW$163, DW_AT_bit_offset(0x00)
    2316                            .dwattr $C$DW$163, DW_AT_bit_size(0x04)
    2317                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2318                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2319                            .dwattr $C$DW$163, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2320                            .dwattr $C$DW$163, DW_AT_decl_line(0x118)
    2321                            .dwattr $C$DW$163, DW_AT_decl_column(0x0f)
    2322                    
    2323                            .dwattr $C$DW$T$176, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2324                            .dwattr $C$DW$T$176, DW_AT_decl_line(0x116)
    2325                            .dwattr $C$DW$T$176, DW_AT_decl_column(0x0b)
    2326                            .dwendtag $C$DW$T$176
    2327                    
    2328                    
    2329                    $C$DW$T$177     .dwtag  DW_TAG_structure_type
    2330                            .dwattr $C$DW$T$177, DW_AT_byte_size(0x01)
    2331                    $C$DW$164       .dwtag  DW_TAG_member
    2332                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$109)
    2333                            .dwattr $C$DW$164, DW_AT_name("triggerType")
    2334                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("triggerType")
    2335                            .dwattr $C$DW$164, DW_AT_bit_offset(0x04)
    2336                            .dwattr $C$DW$164, DW_AT_bit_size(0x04)
    2337                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2338                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2339                            .dwattr $C$DW$164, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2340                            .dwattr $C$DW$164, DW_AT_decl_line(0x12a)
    2341                            .dwattr $C$DW$164, DW_AT_decl_column(0x0f)
    2342                    
    2343                    $C$DW$165       .dwtag  DW_TAG_member
    2344                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$109)
    2345                            .dwattr $C$DW$165, DW_AT_name("bEnaCmd")
    2346                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("bEnaCmd")
    2347                            .dwattr $C$DW$165, DW_AT_bit_offset(0x03)
    2348                            .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    2349                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2350                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2351                            .dwattr $C$DW$165, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2352                            .dwattr $C$DW$165, DW_AT_decl_line(0x12b)
    2353                            .dwattr $C$DW$165, DW_AT_decl_column(0x0f)
    2354                    
    2355                    $C$DW$166       .dwtag  DW_TAG_member
    2356                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$109)
    2357                            .dwattr $C$DW$166, DW_AT_name("triggerNo")
    2358                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("triggerNo")
    2359                            .dwattr $C$DW$166, DW_AT_bit_offset(0x01)
    2360                            .dwattr $C$DW$166, DW_AT_bit_size(0x02)
    2361                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2362                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2363                            .dwattr $C$DW$166, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2364                            .dwattr $C$DW$166, DW_AT_decl_line(0x12d)
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:42 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{667561A1-166B-4C20-ACEB-DD6F4E324E01} PAGE   44

    2365                            .dwattr $C$DW$166, DW_AT_decl_column(0x0f)
    2366                    
    2367                    $C$DW$167       .dwtag  DW_TAG_member
    2368                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$109)
    2369                            .dwattr $C$DW$167, DW_AT_name("pastTrig")
    2370                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("pastTrig")
    2371                            .dwattr $C$DW$167, DW_AT_bit_offset(0x00)
    2372                            .dwattr $C$DW$167, DW_AT_bit_size(0x01)
    2373                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2374                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2375                            .dwattr $C$DW$167, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2376                            .dwattr $C$DW$167, DW_AT_decl_line(0x12e)
    2377                            .dwattr $C$DW$167, DW_AT_decl_column(0x0f)
    2378                    
    2379                            .dwattr $C$DW$T$177, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2380                            .dwattr $C$DW$T$177, DW_AT_decl_line(0x129)
    2381                            .dwattr $C$DW$T$177, DW_AT_decl_column(0x0b)
    2382                            .dwendtag $C$DW$T$177
    2383                    
    2384                    
    2385                    $C$DW$T$178     .dwtag  DW_TAG_structure_type
    2386                            .dwattr $C$DW$T$178, DW_AT_byte_size(0x01)
    2387                    $C$DW$168       .dwtag  DW_TAG_member
    2388                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$109)
    2389                            .dwattr $C$DW$168, DW_AT_name("rule")
    2390                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("rule")
    2391                            .dwattr $C$DW$168, DW_AT_bit_offset(0x04)
    2392                            .dwattr $C$DW$168, DW_AT_bit_size(0x04)
    2393                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2394                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2395                            .dwattr $C$DW$168, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2396                            .dwattr $C$DW$168, DW_AT_decl_line(0x132)
    2397                            .dwattr $C$DW$168, DW_AT_decl_column(0x0f)
    2398                    
    2399                    $C$DW$169       .dwtag  DW_TAG_member
    2400                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$109)
    2401                            .dwattr $C$DW$169, DW_AT_name("nSkip")
    2402                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("nSkip")
    2403                            .dwattr $C$DW$169, DW_AT_bit_offset(0x00)
    2404                            .dwattr $C$DW$169, DW_AT_bit_size(0x04)
    2405                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2406                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2407                            .dwattr $C$DW$169, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    2408                            .dwattr $C$DW$169, DW_AT_decl_line(0x133)
    2409                            .dwattr $C$DW$169, DW_AT_decl_column(0x0f)
    2410                    
    2411                            .dwattr $C$DW$T$178, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    2412                            .dwattr $C$DW$T$178, DW_AT_decl_line(0x131)
    2413                            .dwattr $C$DW$T$178, DW_AT_decl_column(0x0b)
    2414                            .dwendtag $C$DW$T$178
    2415                    
    2416                    
    2417                    $C$DW$T$179     .dwtag  DW_TAG_structure_type
    2418                            .dwattr $C$DW$T$179, DW_AT_byte_size(0x01)
    2419                    $C$DW$170       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:42 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{667561A1-166B-4C20-ACEB-DD6F4E324E01} PAGE   45

    2420                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$109)
    2421                            .dwattr $C$DW$170, DW_AT_name("bEnaFifo")
    2422                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("bEnaFifo")
    2423                            .dwattr $C$DW$170, DW_AT_bit_offset(0x07)
    2424                            .dwattr $C$DW$170, DW_AT_bit_size(0x01)
