TI ARM Assembler PC v16.9.4 Sat Nov 25 18:52:01 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{80AE9C78-212A-461C-8B3C-54F4C6BA3C6E} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Sat Nov 25 18:52:00 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/cllc.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\collector_cc1310lp\collector_cc1
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram
      15                            .dwattr $C$DW$1, DW_AT_name("memcpy")

    7371                    $C$DW$613       .dwtag  DW_TAG_enumerator
    7372                            .dwattr $C$DW$613, DW_AT_name("ApiMac_wisunSubIE_GTKHashIE")
    7373                            .dwattr $C$DW$613, DW_AT_const_value(0x07)
    7374                            .dwattr $C$DW$613, DW_AT_decl_file("..\Application\api_mac.h")
    7375                            .dwattr $C$DW$613, DW_AT_decl_line(0x44d)
    7376                            .dwattr $C$DW$613, DW_AT_decl_column(0x05)
    7377                    
    7378                            .dwattr $C$DW$T$406, DW_AT_decl_file("..\Application\api_mac.h")
    7379                            .dwattr $C$DW$T$406, DW_AT_decl_line(0x441)
    7380                            .dwattr $C$DW$T$406, DW_AT_decl_column(0x01)
    7381                            .dwendtag $C$DW$T$406
    7382                    
    7383                    $C$DW$T$407     .dwtag  DW_TAG_typedef
    7384                            .dwattr $C$DW$T$407, DW_AT_name("ApiMac_wisunSubIE_t")
    7385                            .dwattr $C$DW$T$407, DW_AT_type(*$C$DW$T$406)
    7386                            .dwattr $C$DW$T$407, DW_AT_language(DW_LANG_C)
    7387                            .dwattr $C$DW$T$407, DW_AT_decl_file("..\Application\api_mac.h")
    7388                            .dwattr $C$DW$T$407, DW_AT_decl_line(0x44e)
    7389                            .dwattr $C$DW$T$407, DW_AT_decl_column(0x03)
    7390                    
    7391                    
    7392                    $C$DW$T$408     .dwtag  DW_TAG_enumeration_type
    7393                            .dwattr $C$DW$T$408, DW_AT_byte_size(0x01)
    7394                    $C$DW$614       .dwtag  DW_TAG_enumerator
    7395                            .dwattr $C$DW$614, DW_AT_name("Smsgs_dataFields_tempSensor")
    7396                            .dwattr $C$DW$614, DW_AT_const_value(0x01)
    7397                            .dwattr $C$DW$614, DW_AT_decl_file("..\Application\smsgs.h")
    7398                            .dwattr $C$DW$614, DW_AT_decl_line(0xef)
    7399                            .dwattr $C$DW$614, DW_AT_decl_column(0x05)
    7400                    
    7401                    $C$DW$615       .dwtag  DW_TAG_enumerator
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:52:01 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{80AE9C78-212A-461C-8B3C-54F4C6BA3C6E} PAGE  136

    7402                            .dwattr $C$DW$615, DW_AT_name("Smsgs_dataFields_lightSensor")
    7403                            .dwattr $C$DW$615, DW_AT_const_value(0x02)
    7404                            .dwattr $C$DW$615, DW_AT_decl_file("..\Application\smsgs.h")
    7405                            .dwattr $C$DW$615, DW_AT_decl_line(0xf1)
    7406                            .dwattr $C$DW$615, DW_AT_decl_column(0x05)
    7407                    
    7408                    $C$DW$616       .dwtag  DW_TAG_enumerator
    7409                            .dwattr $C$DW$616, DW_AT_name("Smsgs_dataFields_humiditySensor")
    7410                            .dwattr $C$DW$616, DW_AT_const_value(0x04)
    7411                            .dwattr $C$DW$616, DW_AT_decl_file("..\Application\smsgs.h")
    7412                            .dwattr $C$DW$616, DW_AT_decl_line(0xf3)
    7413                            .dwattr $C$DW$616, DW_AT_decl_column(0x05)
    7414                    
    7415                    $C$DW$617       .dwtag  DW_TAG_enumerator
    7416                            .dwattr $C$DW$617, DW_AT_name("Smsgs_dataFields_msgStats")
    7417                            .dwattr $C$DW$617, DW_AT_const_value(0x08)
    7418                            .dwattr $C$DW$617, DW_AT_decl_file("..\Application\smsgs.h")
    7419                            .dwattr $C$DW$617, DW_AT_decl_line(0xf5)
    7420                            .dwattr $C$DW$617, DW_AT_decl_column(0x05)
    7421                    
    7422                    $C$DW$618       .dwtag  DW_TAG_enumerator
    7423                            .dwattr $C$DW$618, DW_AT_name("Smsgs_dataFields_configSettings")
    7424                            .dwattr $C$DW$618, DW_AT_const_value(0x10)
    7425                            .dwattr $C$DW$618, DW_AT_decl_file("..\Application\smsgs.h")
    7426                            .dwattr $C$DW$618, DW_AT_decl_line(0xf7)
    7427                            .dwattr $C$DW$618, DW_AT_decl_column(0x05)
    7428                    
    7429                            .dwattr $C$DW$T$408, DW_AT_decl_file("..\Application\smsgs.h")
    7430                            .dwattr $C$DW$T$408, DW_AT_decl_line(0xed)
    7431                            .dwattr $C$DW$T$408, DW_AT_decl_column(0x01)
    7432                            .dwendtag $C$DW$T$408
    7433                    
    7434                    $C$DW$T$409     .dwtag  DW_TAG_typedef
    7435                            .dwattr $C$DW$T$409, DW_AT_name("Smsgs_dataFields_t")
    7436                            .dwattr $C$DW$T$409, DW_AT_type(*$C$DW$T$408)
    7437                            .dwattr $C$DW$T$409, DW_AT_language(DW_LANG_C)
    7438                            .dwattr $C$DW$T$409, DW_AT_decl_file("..\Application\smsgs.h")
    7439                            .dwattr $C$DW$T$409, DW_AT_decl_line(0xf8)
    7440                            .dwattr $C$DW$T$409, DW_AT_decl_column(0x03)
    7441                    
    7442                    
    7443                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    7444                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x0a)
    7445                    $C$DW$619       .dwtag  DW_TAG_member
    7446                            .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$47)
    7447                            .dwattr $C$DW$619, DW_AT_name("addr")
    7448                            .dwattr $C$DW$619, DW_AT_TI_symbol_name("addr")
    7449                            .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7450                            .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    7451                            .dwattr $C$DW$619, DW_AT_decl_file("..\Application\api_mac.h")
    7452                            .dwattr $C$DW$619, DW_AT_decl_line(0x4a7)
    7453                            .dwattr $C$DW$619, DW_AT_decl_column(0x07)
    7454                    
    7455                    $C$DW$620       .dwtag  DW_TAG_member
    7456                            .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$20)
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:52:01 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{80AE9C78-212A-461C-8B3C-54F4C6BA3C6E} PAGE  137

    7457                            .dwattr $C$DW$620, DW_AT_name("addrMode")
    7458                            .dwattr $C$DW$620, DW_AT_TI_symbol_name("addrMode")
    7459                            .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7460                            .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    7461                            .dwattr $C$DW$620, DW_AT_decl_file("..\Application\api_mac.h")
    7462                            .dwattr $C$DW$620, DW_AT_decl_line(0x4aa)
    7463                            .dwattr $C$DW$620, DW_AT_decl_column(0x17)
    7464                    
    7465                            .dwattr $C$DW$T$21, DW_AT_decl_file("..\Application\api_mac.h")
    7466                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x49c)
    7467                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x01)
    7468                            .dwendtag $C$DW$T$21
    7469                    
    7470                    $C$DW$T$221     .dwtag  DW_TAG_typedef
    7471                            .dwattr $C$DW$T$221, DW_AT_name("ApiMac_sAddr_t")
    7472                            .dwattr $C$DW$T$221, DW_AT_type(*$C$DW$T$21)
    7473                            .dwattr $C$DW$T$221, DW_AT_language(DW_LANG_C)
    7474                            .dwattr $C$DW$T$221, DW_AT_decl_file("..\Application\api_mac.h")
    7475                            .dwattr $C$DW$T$221, DW_AT_decl_line(0x4ab)
    7476                            .dwattr $C$DW$T$221, DW_AT_decl_column(0x03)
    7477                    
    7478                    $C$DW$T$410     .dwtag  DW_TAG_pointer_type
    7479                            .dwattr $C$DW$T$410, DW_AT_type(*$C$DW$T$221)
    7480                            .dwattr $C$DW$T$410, DW_AT_address_class(0x20)
    7481                    
    7482                    
    7483                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    7484                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x40)
    7485                    $C$DW$621       .dwtag  DW_TAG_member
    7486                            .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$23)
    7487                            .dwattr $C$DW$621, DW_AT_name("beaconType")
    7488                            .dwattr $C$DW$621, DW_AT_TI_symbol_name("beaconType")
    7489                            .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7490                            .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    7491                            .dwattr $C$DW$621, DW_AT_decl_file("..\Application\api_mac.h")
    7492                            .dwattr $C$DW$621, DW_AT_decl_line(0x848)
    7493                            .dwattr $C$DW$621, DW_AT_decl_column(0x19)
    7494                    
    7495                    $C$DW$622       .dwtag  DW_TAG_member
    7496                            .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$24)
    7497                            .dwattr $C$DW$622, DW_AT_name("bsn")
    7498                            .dwattr $C$DW$622, DW_AT_TI_symbol_name("bsn")
    7499                            .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7500                            .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    7501                            .dwattr $C$DW$622, DW_AT_decl_file("..\Application\api_mac.h")
    7502                            .dwattr $C$DW$622, DW_AT_decl_line(0x84a)
    7503                            .dwattr $C$DW$622, DW_AT_decl_column(0x0d)
    7504                    
    7505                    $C$DW$623       .dwtag  DW_TAG_member
    7506                            .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$25)
    7507                            .dwattr $C$DW$623, DW_AT_name("panDesc")
    7508                            .dwattr $C$DW$623, DW_AT_TI_symbol_name("panDesc")
    7509                            .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7510                            .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    7511                            .dwattr $C$DW$623, DW_AT_decl_file("..\Application\api_mac.h")
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:52:01 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{80AE9C78-212A-461C-8B3C-54F4C6BA3C6E} PAGE  138

    7512                            .dwattr $C$DW$623, DW_AT_decl_line(0x84c)
    7513                            .dwattr $C$DW$623, DW_AT_decl_column(0x16)
    7514                    
    7515                    $C$DW$624       .dwtag  DW_TAG_member
    7516                            .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$50)
    7517                            .dwattr $C$DW$624, DW_AT_name("beaconData")
    7518                            .dwattr $C$DW$624, DW_AT_TI_symbol_name("beaconData")
    7519                            .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7520                            .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    7521                            .dwattr $C$DW$624, DW_AT_decl_file("..\Application\api_mac.h")
    7522                            .dwattr $C$DW$624, DW_AT_decl_line(0x857)
    7523                            .dwattr $C$DW$624, DW_AT_decl_column(0x07)
    7524                    
    7525                            .dwattr $C$DW$T$26, DW_AT_decl_file("..\Application\api_mac.h")
    7526                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x846)
    7527                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x01)
    7528                            .dwendtag $C$DW$T$26
    7529                    
    7530                    $C$DW$T$134     .dwtag  DW_TAG_typedef
    7531                            .dwattr $C$DW$T$134, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
    7532                            .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$26)
    7533                            .dwattr $C$DW$T$134, DW_AT_language(DW_LANG_C)
    7534                            .dwattr $C$DW$T$134, DW_AT_decl_file("..\Application\api_mac.h")
    7535                            .dwattr $C$DW$T$134, DW_AT_decl_line(0x858)
    7536                            .dwattr $C$DW$T$134, DW_AT_decl_column(0x03)
    7537                    
    7538                    $C$DW$T$135     .dwtag  DW_TAG_pointer_type
    7539                            .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$134)
    7540                            .dwattr $C$DW$T$135, DW_AT_address_class(0x20)
    7541                    
    7542                    $C$DW$T$412     .dwtag  DW_TAG_const_type
    7543                            .dwattr $C$DW$T$412, DW_AT_type(*$C$DW$T$135)
    7544                    
    7545                    
    7546                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    7547                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x0e)
    7548                    $C$DW$625       .dwtag  DW_TAG_member
    7549                            .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$27)
    7550                            .dwattr $C$DW$625, DW_AT_name("devInfo")
    7551                            .dwattr $C$DW$625, DW_AT_TI_symbol_name("devInfo")
    7552                            .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7553                            .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    7554                            .dwattr $C$DW$625, DW_AT_decl_file("..\Application\llc.h")
    7555                            .dwattr $C$DW$625, DW_AT_decl_line(0x47)
    7556                            .dwattr $C$DW$625, DW_AT_decl_column(0x1f)
    7557                    
    7558                    $C$DW$626       .dwtag  DW_TAG_member
    7559                            .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$24)
    7560                            .dwattr $C$DW$626, DW_AT_name("channel")
    7561                            .dwattr $C$DW$626, DW_AT_TI_symbol_name("channel")
    7562                            .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7563                            .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    7564                            .dwattr $C$DW$626, DW_AT_decl_file("..\Application\llc.h")
    7565                            .dwattr $C$DW$626, DW_AT_decl_line(0x49)
    7566                            .dwattr $C$DW$626, DW_AT_decl_column(0x0d)
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:52:01 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{80AE9C78-212A-461C-8B3C-54F4C6BA3C6E} PAGE  139

    7567                    
    7568                    $C$DW$627       .dwtag  DW_TAG_member
    7569                            .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$28)
    7570                            .dwattr $C$DW$627, DW_AT_name("fh")
    7571                            .dwattr $C$DW$627, DW_AT_TI_symbol_name("fh")
    7572                            .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7573                            .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    7574                            .dwattr $C$DW$627, DW_AT_decl_file("..\Application\llc.h")
    7575                            .dwattr $C$DW$627, DW_AT_decl_line(0x4b)
    7576                            .dwattr $C$DW$627, DW_AT_decl_column(0x0a)
    7577                    
    7578                            .dwattr $C$DW$T$29, DW_AT_decl_file("..\Application\llc.h")
    7579                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x45)
    7580                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    7581                            .dwendtag $C$DW$T$29
    7582                    
    7583                    $C$DW$T$65      .dwtag  DW_TAG_const_type
    7584                            .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$29)
    7585                    
    7586                    $C$DW$T$73      .dwtag  DW_TAG_typedef
    7587                            .dwattr $C$DW$T$73, DW_AT_name("Llc_netInfo_t")
    7588                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$29)
    7589                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    7590                            .dwattr $C$DW$T$73, DW_AT_decl_file("..\Application\llc.h")
    7591                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x4c)
    7592                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    7593                    
    7594                    $C$DW$T$416     .dwtag  DW_TAG_const_type
    7595                            .dwattr $C$DW$T$416, DW_AT_type(*$C$DW$T$73)
    7596                    
    7597                    $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    7598                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    7599                            .dwattr $C$DW$T$74, DW_AT_address_class(0x20)
    7600                    
    7601                    $C$DW$T$417     .dwtag  DW_TAG_const_type
    7602                            .dwattr $C$DW$T$417, DW_AT_type(*$C$DW$T$74)
    7603                    
    7604                    
    7605                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    7606                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x0c)
    7607                    $C$DW$628       .dwtag  DW_TAG_member
    7608                            .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$30)
    7609                            .dwattr $C$DW$628, DW_AT_name("shortAddr")
    7610                            .dwattr $C$DW$628, DW_AT_TI_symbol_name("shortAddr")
    7611                            .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7612                            .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    7613                            .dwattr $C$DW$628, DW_AT_decl_file("..\Application\cllc.h")
    7614                            .dwattr $C$DW$628, DW_AT_decl_line(0x7c)
    7615                            .dwattr $C$DW$628, DW_AT_decl_column(0x0e)
    7616                    
    7617                    $C$DW$629       .dwtag  DW_TAG_member
    7618                            .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$31)
    7619                            .dwattr $C$DW$629, DW_AT_name("capInfo")
    7620                            .dwattr $C$DW$629, DW_AT_TI_symbol_name("capInfo")
    7621                            .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:52:01 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{80AE9C78-212A-461C-8B3C-54F4C6BA3C6E} PAGE  140

    7622                            .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    7623                            .dwattr $C$DW$629, DW_AT_decl_file("..\Application\cllc.h")
    7624                            .dwattr $C$DW$629, DW_AT_decl_line(0x7e)
    7625                            .dwattr $C$DW$629, DW_AT_decl_column(0x1d)
    7626                    
    7627                    $C$DW$630       .dwtag  DW_TAG_member
    7628                            .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$32)
    7629                            .dwattr $C$DW$630, DW_AT_name("rssi")
    7630                            .dwattr $C$DW$630, DW_AT_TI_symbol_name("rssi")
    7631                            .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7632                            .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    7633                            .dwattr $C$DW$630, DW_AT_decl_file("..\Application\cllc.h")
    7634                            .dwattr $C$DW$630, DW_AT_decl_line(0x80)
    7635                            .dwattr $C$DW$630, DW_AT_decl_column(0x0c)
    7636                    
    7637                    $C$DW$631       .dwtag  DW_TAG_member
    7638                            .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$30)
    7639                            .dwattr $C$DW$631, DW_AT_name("status")
    7640                            .dwattr $C$DW$631, DW_AT_TI_symbol_name("status")
    7641                            .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7642                            .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    7643                            .dwattr $C$DW$631, DW_AT_decl_file("..\Application\cllc.h")
    7644                            .dwattr $C$DW$631, DW_AT_decl_line(0x82)
    7645                            .dwattr $C$DW$631, DW_AT_decl_column(0x0e)
    7646                    
    7647                            .dwattr $C$DW$T$33, DW_AT_decl_file("..\Application\cllc.h")
    7648                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x7a)
    7649                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    7650                            .dwendtag $C$DW$T$33
    7651                    
    7652                    $C$DW$T$420     .dwtag  DW_TAG_typedef
    7653                            .dwattr $C$DW$T$420, DW_AT_name("Cllc_associated_devices_t")
    7654                            .dwattr $C$DW$T$420, DW_AT_type(*$C$DW$T$33)
    7655                            .dwattr $C$DW$T$420, DW_AT_language(DW_LANG_C)
    7656                            .dwattr $C$DW$T$420, DW_AT_decl_file("..\Application\cllc.h")
    7657                            .dwattr $C$DW$T$420, DW_AT_decl_line(0x83)
    7658                            .dwattr $C$DW$T$420, DW_AT_decl_column(0x03)
    7659                    
    7660                    $C$DW$T$421     .dwtag  DW_TAG_pointer_type
    7661                            .dwattr $C$DW$T$421, DW_AT_type(*$C$DW$T$420)
    7662                            .dwattr $C$DW$T$421, DW_AT_address_class(0x20)
    7663                    
    7664                    
    7665                    $C$DW$T$423     .dwtag  DW_TAG_array_type
    7666                            .dwattr $C$DW$T$423, DW_AT_type(*$C$DW$T$420)
    7667                            .dwattr $C$DW$T$423, DW_AT_language(DW_LANG_C)
    7668                            .dwattr $C$DW$T$423, DW_AT_byte_size(0x258)
    7669                    $C$DW$632       .dwtag  DW_TAG_subrange_type
    7670                            .dwattr $C$DW$632, DW_AT_upper_bound(0x31)
    7671                    
    7672                            .dwendtag $C$DW$T$423
    7673                    
    7674                    $C$DW$T$57      .dwtag  DW_TAG_pointer_type
    7675                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$33)
    7676                            .dwattr $C$DW$T$57, DW_AT_address_class(0x20)
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:52:01 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{80AE9C78-212A-461C-8B3C-54F4C6BA3C6E} PAGE  141

    7677                    
    7678                    
    7679                    $C$DW$T$59      .dwtag  DW_TAG_array_type
    7680                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$33)
    7681                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    7682                            .dwattr $C$DW$T$59, DW_AT_byte_size(0x258)
    7683                    $C$DW$633       .dwtag  DW_TAG_subrange_type
    7684                            .dwattr $C$DW$633, DW_AT_upper_bound(0x31)
    7685                    
    7686                            .dwendtag $C$DW$T$59
    7687                    
    7688                    
    7689                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    7690                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x14)
    7691                    $C$DW$634       .dwtag  DW_TAG_member
    7692                            .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$34)
    7693                            .dwattr $C$DW$634, DW_AT_name("fhNumPASolicitReceived")
    7694                            .dwattr $C$DW$634, DW_AT_TI_symbol_name("fhNumPASolicitReceived")
    7695                            .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7696                            .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
    7697                            .dwattr $C$DW$634, DW_AT_decl_file("..\Application\cllc.h")
    7698                            .dwattr $C$DW$634, DW_AT_decl_line(0x89)
    7699                            .dwattr $C$DW$634, DW_AT_decl_column(0x0e)
    7700                    
    7701                    $C$DW$635       .dwtag  DW_TAG_member
    7702                            .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$34)
    7703                            .dwattr $C$DW$635, DW_AT_name("fhNumPASent")
    7704                            .dwattr $C$DW$635, DW_AT_TI_symbol_name("fhNumPASent")
    7705                            .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7706                            .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    7707                            .dwattr $C$DW$635, DW_AT_decl_file("..\Application\cllc.h")
    7708                            .dwattr $C$DW$635, DW_AT_decl_line(0x8b)
    7709                            .dwattr $C$DW$635, DW_AT_decl_column(0x0e)
    7710                    
    7711                    $C$DW$636       .dwtag  DW_TAG_member
    7712                            .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$34)
    7713                            .dwattr $C$DW$636, DW_AT_name("fhNumPANConfigSolicitsReceived")
    7714                            .dwattr $C$DW$636, DW_AT_TI_symbol_name("fhNumPANConfigSolicitsReceived")
    7715                            .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7716                            .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    7717                            .dwattr $C$DW$636, DW_AT_decl_file("..\Application\cllc.h")
    7718                            .dwattr $C$DW$636, DW_AT_decl_line(0x8d)
    7719                            .dwattr $C$DW$636, DW_AT_decl_column(0x0e)
    7720                    
    7721                    $C$DW$637       .dwtag  DW_TAG_member
    7722                            .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$34)
    7723                            .dwattr $C$DW$637, DW_AT_name("fhNumPANConfigSent")
    7724                            .dwattr $C$DW$637, DW_AT_TI_symbol_name("fhNumPANConfigSent")
    7725                            .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7726                            .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    7727                            .dwattr $C$DW$637, DW_AT_decl_file("..\Application\cllc.h")
    7728                            .dwattr $C$DW$637, DW_AT_decl_line(0x8f)
    7729                            .dwattr $C$DW$637, DW_AT_decl_column(0x0e)
    7730                    
    7731                    $C$DW$638       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:52:01 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{80AE9C78-212A-461C-8B3C-54F4C6BA3C6E} PAGE  142

    7732                            .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$34)
    7733                            .dwattr $C$DW$638, DW_AT_name("otherStats")
    7734                            .dwattr $C$DW$638, DW_AT_TI_symbol_name("otherStats")
    7735                            .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7736                            .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    7737                            .dwattr $C$DW$638, DW_AT_decl_file("..\Application\cllc.h")
    7738                            .dwattr $C$DW$638, DW_AT_decl_line(0x90)
    7739                            .dwattr $C$DW$638, DW_AT_decl_column(0x0e)
    7740                    
    7741                            .dwattr $C$DW$T$35, DW_AT_decl_file("..\Application\cllc.h")
    7742                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x87)
    7743                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x01)
    7744                            .dwendtag $C$DW$T$35
    7745                    
    7746                    $C$DW$T$427     .dwtag  DW_TAG_typedef
    7747                            .dwattr $C$DW$T$427, DW_AT_name("Cllc_statistics_t")
    7748                            .dwattr $C$DW$T$427, DW_AT_type(*$C$DW$T$35)
    7749                            .dwattr $C$DW$T$427, DW_AT_language(DW_LANG_C)
    7750                            .dwattr $C$DW$T$427, DW_AT_decl_file("..\Application\cllc.h")
    7751                            .dwattr $C$DW$T$427, DW_AT_decl_line(0x91)
    7752                            .dwattr $C$DW$T$427, DW_AT_decl_column(0x03)
    7753                    
    7754                    
    7755                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    7756                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x08)
    7757                    $C$DW$639       .dwtag  DW_TAG_member
    7758                            .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$24)
    7759                            .dwattr $C$DW$639, DW_AT_name("channel")
    7760                            .dwattr $C$DW$639, DW_AT_TI_symbol_name("channel")
    7761                            .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7762                            .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    7763                            .dwattr $C$DW$639, DW_AT_decl_file("../Application/cllc.c")
    7764                            .dwattr $C$DW$639, DW_AT_decl_line(0x93)
    7765                            .dwattr $C$DW$639, DW_AT_decl_column(0x0d)
    7766                    
    7767                    $C$DW$640       .dwtag  DW_TAG_member
    7768                            .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$30)
    7769                            .dwattr $C$DW$640, DW_AT_name("panID")
    7770                            .dwattr $C$DW$640, DW_AT_TI_symbol_name("panID")
    7771                            .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7772                            .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    7773                            .dwattr $C$DW$640, DW_AT_decl_file("../Application/cllc.c")
    7774                            .dwattr $C$DW$640, DW_AT_decl_line(0x94)
    7775                            .dwattr $C$DW$640, DW_AT_decl_column(0x0e)
    7776                    
    7777                    $C$DW$641       .dwtag  DW_TAG_member
    7778                            .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$30)
    7779                            .dwattr $C$DW$641, DW_AT_name("shortAddr")
    7780                            .dwattr $C$DW$641, DW_AT_TI_symbol_name("shortAddr")
    7781                            .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7782                            .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    7783                            .dwattr $C$DW$641, DW_AT_decl_file("../Application/cllc.c")
    7784                            .dwattr $C$DW$641, DW_AT_decl_line(0x95)
    7785                            .dwattr $C$DW$641, DW_AT_decl_column(0x0e)
    7786                    
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:52:01 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{80AE9C78-212A-461C-8B3C-54F4C6BA3C6E} PAGE  143

    7787                    $C$DW$642       .dwtag  DW_TAG_member
    7788                            .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$37)
    7789                            .dwattr $C$DW$642, DW_AT_name("currentCllcState")
    7790                            .dwattr $C$DW$642, DW_AT_TI_symbol_name("currentCllcState")
    7791                            .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7792                            .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    7793                            .dwattr $C$DW$642, DW_AT_decl_file("../Application/cllc.c")
    7794                            .dwattr $C$DW$642, DW_AT_decl_line(0x96)
    7795                            .dwattr $C$DW$642, DW_AT_decl_column(0x13)
    7796                    
    7797                    $C$DW$643       .dwtag  DW_TAG_member
    7798                            .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$39)
    7799                            .dwattr $C$DW$643, DW_AT_name("currentCoordState")
    7800                            .dwattr $C$DW$643, DW_AT_TI_symbol_name("currentCoordState")
    7801                            .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7802                            .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    7803                            .dwattr $C$DW$643, DW_AT_decl_file("../Application/cllc.c")
    7804                            .dwattr $C$DW$643, DW_AT_decl_line(0x97)
    7805                            .dwattr $C$DW$643, DW_AT_decl_column(0x19)
    7806                    
    7807                            .dwattr $C$DW$T$40, DW_AT_decl_file("../Application/cllc.c")
    7808                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x92)
    7809                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x01)
    7810                            .dwendtag $C$DW$T$40
    7811                    
    7812                    $C$DW$T$429     .dwtag  DW_TAG_typedef
    7813                            .dwattr $C$DW$T$429, DW_AT_name("coordInformation_t")
    7814                            .dwattr $C$DW$T$429, DW_AT_type(*$C$DW$T$40)
    7815                            .dwattr $C$DW$T$429, DW_AT_language(DW_LANG_C)
    7816                            .dwattr $C$DW$T$429, DW_AT_decl_file("../Application/cllc.c")
    7817                            .dwattr $C$DW$T$429, DW_AT_decl_line(0x98)
    7818                            .dwattr $C$DW$T$429, DW_AT_decl_column(0x03)
    7819                    
    7820                    
    7821                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    7822                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x28)
    7823                    $C$DW$644       .dwtag  DW_TAG_member
    7824                            .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$3)
    7825                            .dwattr $C$DW$644, DW_AT_name("pNext")
    7826                            .dwattr $C$DW$644, DW_AT_TI_symbol_name("pNext")
    7827                            .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7828                            .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    7829                            .dwattr $C$DW$644, DW_AT_decl_file("../Application/cllc.c")
    7830                            .dwattr $C$DW$644, DW_AT_decl_line(0x8c)
    7831                            .dwattr $C$DW$644, DW_AT_decl_column(0x0b)
    7832                    
    7833                    $C$DW$645       .dwtag  DW_TAG_member
    7834                            .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$25)
    7835                            .dwattr $C$DW$645, DW_AT_name("panDescList")
    7836                            .dwattr $C$DW$645, DW_AT_TI_symbol_name("panDescList")
    7837                            .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7838                            .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    7839                            .dwattr $C$DW$645, DW_AT_decl_file("../Application/cllc.c")
    7840                            .dwattr $C$DW$645, DW_AT_decl_line(0x8d)
    7841                            .dwattr $C$DW$645, DW_AT_decl_column(0x16)
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:52:01 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{80AE9C78-212A-461C-8B3C-54F4C6BA3C6E} PAGE  144

    7842                    
    7843                            .dwattr $C$DW$T$41, DW_AT_decl_file("../Application/cllc.c")
    7844                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x8b)
    7845                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    7846                            .dwendtag $C$DW$T$41
    7847                    
    7848                    $C$DW$T$55      .dwtag  DW_TAG_pointer_type
    7849                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$41)
    7850                            .dwattr $C$DW$T$55, DW_AT_address_class(0x20)
    7851                    
    7852                    $C$DW$T$431     .dwtag  DW_TAG_typedef
    7853                            .dwattr $C$DW$T$431, DW_AT_name("panDescList_t")
    7854                            .dwattr $C$DW$T$431, DW_AT_type(*$C$DW$T$41)
    7855                            .dwattr $C$DW$T$431, DW_AT_language(DW_LANG_C)
    7856                            .dwattr $C$DW$T$431, DW_AT_decl_file("../Application/cllc.c")
    7857                            .dwattr $C$DW$T$431, DW_AT_decl_line(0x8e)
    7858                            .dwattr $C$DW$T$431, DW_AT_decl_column(0x03)
    7859                    
    7860                    $C$DW$T$432     .dwtag  DW_TAG_pointer_type
    7861                            .dwattr $C$DW$T$432, DW_AT_type(*$C$DW$T$431)
    7862                            .dwattr $C$DW$T$432, DW_AT_address_class(0x20)
    7863                    
    7864                    
    7865                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    7866                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x08)
    7867                    $C$DW$646       .dwtag  DW_TAG_member
    7868                            .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$10)
    7869                            .dwattr $C$DW$646, DW_AT_name("quot")
    7870                            .dwattr $C$DW$646, DW_AT_TI_symbol_name("quot")
    7871                            .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7872                            .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    7873                            .dwattr $C$DW$646, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    7874                            .dwattr $C$DW$646, DW_AT_decl_line(0x5c)
    7875                            .dwattr $C$DW$646, DW_AT_decl_column(0x16)
    7876                    
    7877                    $C$DW$647       .dwtag  DW_TAG_member
    7878                            .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$10)
    7879                            .dwattr $C$DW$647, DW_AT_name("rem")
    7880                            .dwattr $C$DW$647, DW_AT_TI_symbol_name("rem")
    7881                            .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7882                            .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    7883                            .dwattr $C$DW$647, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    7884                            .dwattr $C$DW$647, DW_AT_decl_line(0x5c)
    7885                            .dwattr $C$DW$647, DW_AT_decl_column(0x1c)
    7886                    
    7887                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
    7888                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x5c)
    7889                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
    7890                            .dwendtag $C$DW$T$42
    7891                    
    7892                    $C$DW$T$433     .dwtag  DW_TAG_typedef
    7893                            .dwattr $C$DW$T$433, DW_AT_name("div_t")
    7894                            .dwattr $C$DW$T$433, DW_AT_type(*$C$DW$T$42)
    7895                            .dwattr $C$DW$T$433, DW_AT_language(DW_LANG_C)
    7896                            .dwattr $C$DW$T$433, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:52:01 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{80AE9C78-212A-461C-8B3C-54F4C6BA3C6E} PAGE  145

    7897                            .dwattr $C$DW$T$433, DW_AT_decl_line(0x5c)
    7898                            .dwattr $C$DW$T$433, DW_AT_decl_column(0x23)
    7899                    
    7900                    
    7901                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    7902                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x08)
    7903                    $C$DW$648       .dwtag  DW_TAG_member
    7904                            .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$10)
    7905                            .dwattr $C$DW$648, DW_AT_name("quot")
    7906                            .dwattr $C$DW$648, DW_AT_TI_symbol_name("quot")
    7907                            .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7908                            .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    7909                            .dwattr $C$DW$648, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    7910                            .dwattr $C$DW$648, DW_AT_decl_line(0x5e)
    7911                            .dwattr $C$DW$648, DW_AT_decl_column(0x16)
    7912                    
    7913                    $C$DW$649       .dwtag  DW_TAG_member
    7914                            .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$10)
    7915                            .dwattr $C$DW$649, DW_AT_name("rem")
    7916                            .dwattr $C$DW$649, DW_AT_TI_symbol_name("rem")
    7917                            .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7918                            .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    7919                            .dwattr $C$DW$649, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    7920                            .dwattr $C$DW$649, DW_AT_decl_line(0x5e)
    7921                            .dwattr $C$DW$649, DW_AT_decl_column(0x1c)
    7922                    
    7923                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
    7924                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x5e)
    7925                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x10)
    7926                            .dwendtag $C$DW$T$43
    7927                    
    7928                    $C$DW$T$434     .dwtag  DW_TAG_typedef
    7929                            .dwattr $C$DW$T$434, DW_AT_name("ldiv_t")
    7930                            .dwattr $C$DW$T$434, DW_AT_type(*$C$DW$T$43)
    7931                            .dwattr $C$DW$T$434, DW_AT_language(DW_LANG_C)
    7932                            .dwattr $C$DW$T$434, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    7933                            .dwattr $C$DW$T$434, DW_AT_decl_line(0x5e)
    7934                            .dwattr $C$DW$T$434, DW_AT_decl_column(0x23)
    7935                    
    7936                    
    7937                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    7938                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x10)
    7939                    $C$DW$650       .dwtag  DW_TAG_member
    7940                            .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$14)
    7941                            .dwattr $C$DW$650, DW_AT_name("quot")
    7942                            .dwattr $C$DW$650, DW_AT_TI_symbol_name("quot")
    7943                            .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7944                            .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    7945                            .dwattr $C$DW$650, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    7946                            .dwattr $C$DW$650, DW_AT_decl_line(0x61)
    7947                            .dwattr $C$DW$650, DW_AT_decl_column(0x1c)
    7948                    
    7949                    $C$DW$651       .dwtag  DW_TAG_member
    7950                            .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$14)
    7951                            .dwattr $C$DW$651, DW_AT_name("rem")
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:52:01 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{80AE9C78-212A-461C-8B3C-54F4C6BA3C6E} PAGE  146

    7952                            .dwattr $C$DW$651, DW_AT_TI_symbol_name("rem")
    7953                            .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7954                            .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    7955                            .dwattr $C$DW$651, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    7956                            .dwattr $C$DW$651, DW_AT_decl_line(0x61)
    7957                            .dwattr $C$DW$651, DW_AT_decl_column(0x22)
    7958                    
    7959                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
    7960                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x61)
    7961                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    7962                            .dwendtag $C$DW$T$44
    7963                    
    7964                    $C$DW$T$435     .dwtag  DW_TAG_typedef
    7965                            .dwattr $C$DW$T$435, DW_AT_name("lldiv_t")
    7966                            .dwattr $C$DW$T$435, DW_AT_type(*$C$DW$T$44)
    7967                            .dwattr $C$DW$T$435, DW_AT_language(DW_LANG_C)
    7968                            .dwattr $C$DW$T$435, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    7969                            .dwattr $C$DW$T$435, DW_AT_decl_line(0x61)
    7970                            .dwattr $C$DW$T$435, DW_AT_decl_column(0x29)
    7971                    
    7972                    
    7973                    $C$DW$T$47      .dwtag  DW_TAG_union_type
    7974                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x08)
    7975                    $C$DW$652       .dwtag  DW_TAG_member
    7976                            .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$30)
    7977                            .dwattr $C$DW$652, DW_AT_name("shortAddr")
    7978                            .dwattr $C$DW$652, DW_AT_TI_symbol_name("shortAddr")
    7979                            .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7980                            .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    7981                            .dwattr $C$DW$652, DW_AT_decl_file("..\Application\api_mac.h")
    7982                            .dwattr $C$DW$652, DW_AT_decl_line(0x4a4)
    7983                            .dwattr $C$DW$652, DW_AT_decl_column(0x12)
    7984                    
    7985                    $C$DW$653       .dwtag  DW_TAG_member
    7986                            .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$46)
    7987                            .dwattr $C$DW$653, DW_AT_name("extAddr")
    7988                            .dwattr $C$DW$653, DW_AT_TI_symbol_name("extAddr")
    7989                            .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7990                            .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    7991                            .dwattr $C$DW$653, DW_AT_decl_file("..\Application\api_mac.h")
    7992                            .dwattr $C$DW$653, DW_AT_decl_line(0x4a6)
    7993                            .dwattr $C$DW$653, DW_AT_decl_column(0x1b)
    7994                    
    7995                            .dwattr $C$DW$T$47, DW_AT_decl_file("..\Application\api_mac.h")
    7996                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x4a2)
    7997                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x05)
    7998                            .dwendtag $C$DW$T$47
    7999                    
    8000                    
    8001                    $C$DW$T$50      .dwtag  DW_TAG_union_type
    8002                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x18)
    8003                    $C$DW$654       .dwtag  DW_TAG_member
    8004                            .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$48)
    8005                            .dwattr $C$DW$654, DW_AT_name("beacon")
    8006                            .dwattr $C$DW$654, DW_AT_TI_symbol_name("beacon")
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:52:01 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{80AE9C78-212A-461C-8B3C-54F4C6BA3C6E} PAGE  147

    8007                            .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8008                            .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    8009                            .dwattr $C$DW$654, DW_AT_decl_file("..\Application\api_mac.h")
    8010                            .dwattr $C$DW$654, DW_AT_decl_line(0x854)
    8011                            .dwattr $C$DW$654, DW_AT_decl_column(0x1d)
    8012                    
    8013                    $C$DW$655       .dwtag  DW_TAG_member
    8014                            .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$49)
    8015                            .dwattr $C$DW$655, DW_AT_name("eBeacon")
    8016                            .dwattr $C$DW$655, DW_AT_TI_symbol_name("eBeacon")
    8017                            .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8018                            .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    8019                            .dwattr $C$DW$655, DW_AT_decl_file("..\Application\api_mac.h")
    8020                            .dwattr $C$DW$655, DW_AT_decl_line(0x856)
    8021                            .dwattr $C$DW$655, DW_AT_decl_column(0x1e)
    8022                    
    8023                            .dwattr $C$DW$T$50, DW_AT_decl_file("..\Application\api_mac.h")
    8024                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x852)
    8025                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x05)
    8026                            .dwendtag $C$DW$T$50
    8027                    
    8028                    
    8029                    $C$DW$T$53      .dwtag  DW_TAG_union_type
    8030                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x04)
    8031                    $C$DW$656       .dwtag  DW_TAG_member
    8032                            .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$51)
    8033                            .dwattr $C$DW$656, DW_AT_name("pEnergyDetect")
    8034                            .dwattr $C$DW$656, DW_AT_TI_symbol_name("pEnergyDetect")
    8035                            .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8036                            .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    8037                            .dwattr $C$DW$656, DW_AT_decl_file("..\Application\api_mac.h")
    8038                            .dwattr $C$DW$656, DW_AT_decl_line(0x876)
    8039                            .dwattr $C$DW$656, DW_AT_decl_column(0x12)
    8040                    
    8041                    $C$DW$657       .dwtag  DW_TAG_member
    8042                            .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$52)
    8043                            .dwattr $C$DW$657, DW_AT_name("pPanDescriptor")
    8044                            .dwattr $C$DW$657, DW_AT_TI_symbol_name("pPanDescriptor")
    8045                            .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8046                            .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    8047                            .dwattr $C$DW$657, DW_AT_decl_file("..\Application\api_mac.h")
    8048                            .dwattr $C$DW$657, DW_AT_decl_line(0x878)
    8049                            .dwattr $C$DW$657, DW_AT_decl_column(0x1b)
    8050                    
    8051                            .dwattr $C$DW$T$53, DW_AT_decl_file("..\Application\api_mac.h")
    8052                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x874)
    8053                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x05)
    8054                            .dwendtag $C$DW$T$53
    8055                    
    8056                    
    8057                    $C$DW$T$60      .dwtag  DW_TAG_structure_type
    8058                            .dwattr $C$DW$T$60, DW_AT_name(".ggroup1")
    8059                            .dwattr $C$DW$T$60, DW_AT_byte_size(0x2fc)
    8060                    $C$DW$658       .dwtag  DW_TAG_member
    8061                            .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$6)
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:52:01 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{80AE9C78-212A-461C-8B3C-54F4C6BA3C6E} PAGE  148

    8062                            .dwattr $C$DW$658, DW_AT_name("Cllc_numOfDevices")
    8063                            .dwattr $C$DW$658, DW_AT_TI_symbol_name("Cllc_numOfDevices")
    8064                            .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8065                            .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    8066                    
    8067                    $C$DW$659       .dwtag  DW_TAG_member
    8068                            .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$6)
    8069                            .dwattr $C$DW$659, DW_AT_name("optAsyncFlag")
    8070                            .dwattr $C$DW$659, DW_AT_TI_symbol_name("optAsyncFlag")
    8071                            .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8072                            .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    8073                    
    8074                    $C$DW$660       .dwtag  DW_TAG_member
    8075                            .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$54)
    8076                            .dwattr $C$DW$660, DW_AT_name("macSecurity")
    8077                            .dwattr $C$DW$660, DW_AT_TI_symbol_name("macSecurity")
    8078                            .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8079                            .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    8080                    
    8081                    $C$DW$661       .dwtag  DW_TAG_member
    8082                            .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$9)
    8083                            .dwattr $C$DW$661, DW_AT_name("Cllc_events")
    8084                            .dwattr $C$DW$661, DW_AT_TI_symbol_name("Cllc_events")
    8085                            .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8086                            .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    8087                    
    8088                    $C$DW$662       .dwtag  DW_TAG_member
    8089                            .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$55)
    8090                            .dwattr $C$DW$662, DW_AT_name("pPANDesclist")
    8091                            .dwattr $C$DW$662, DW_AT_TI_symbol_name("pPANDesclist")
    8092                            .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8093                            .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    8094                    
    8095                    $C$DW$663       .dwtag  DW_TAG_member
    8096                            .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$56)
    8097                            .dwattr $C$DW$663, DW_AT_name("pCllcCallbacksCopy")
    8098                            .dwattr $C$DW$663, DW_AT_TI_symbol_name("pCllcCallbacksCopy")
    8099                            .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8100                            .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    8101                    
    8102                    $C$DW$664       .dwtag  DW_TAG_member
    8103                            .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$11)
    8104                            .dwattr $C$DW$664, DW_AT_name("fhPAtrickleTime")
    8105                            .dwattr $C$DW$664, DW_AT_TI_symbol_name("fhPAtrickleTime")
    8106                            .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8107                            .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    8108                    
    8109                    $C$DW$665       .dwtag  DW_TAG_member
    8110                            .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$11)
    8111                            .dwattr $C$DW$665, DW_AT_name("fhPCtrickleTime")
    8112                            .dwattr $C$DW$665, DW_AT_TI_symbol_name("fhPCtrickleTime")
    8113                            .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8114                            .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    8115                    
    8116                    $C$DW$666       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:52:01 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{80AE9C78-212A-461C-8B3C-54F4C6BA3C6E} PAGE  149

    8117                            .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$57)
    8118                            .dwattr $C$DW$666, DW_AT_name("pItem")
    8119                            .dwattr $C$DW$666, DW_AT_TI_symbol_name("pItem$3")
    8120                            .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8121                            .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    8122                    
    8123                    $C$DW$667       .dwtag  DW_TAG_member
    8124                            .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$40)
    8125                            .dwattr $C$DW$667, DW_AT_name("coordInfoBlock")
    8126                            .dwattr $C$DW$667, DW_AT_TI_symbol_name("coordInfoBlock")
    8127                            .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8128                            .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    8129                    
    8130                    $C$DW$668       .dwtag  DW_TAG_member
    8131                            .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$58)
    8132                            .dwattr $C$DW$668, DW_AT_name("optPAChMask")
    8133                            .dwattr $C$DW$668, DW_AT_TI_symbol_name("optPAChMask")
    8134                            .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    8135                            .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    8136                    
    8137                    $C$DW$669       .dwtag  DW_TAG_member
    8138                            .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$58)
    8139                            .dwattr $C$DW$669, DW_AT_name("optPCChMask")
    8140                            .dwattr $C$DW$669, DW_AT_TI_symbol_name("optPCChMask")
    8141                            .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    8142                            .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    8143                    
    8144                    $C$DW$670       .dwtag  DW_TAG_member
    8145                            .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$35)
    8146                            .dwattr $C$DW$670, DW_AT_name("Cllc_statistics")
    8147                            .dwattr $C$DW$670, DW_AT_TI_symbol_name("Cllc_statistics")
    8148                            .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    8149                            .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    8150                    
    8151                    $C$DW$671       .dwtag  DW_TAG_member
    8152                            .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$202)
    8153                            .dwattr $C$DW$671, DW_AT_name("macCallbacksCopy")
    8154                            .dwattr $C$DW$671, DW_AT_TI_symbol_name("macCallbacksCopy")
    8155                            .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    8156                            .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    8157                    
    8158                    $C$DW$672       .dwtag  DW_TAG_member
    8159                            .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$59)
    8160                            .dwattr $C$DW$672, DW_AT_name("Cllc_associatedDevList")
    8161                            .dwattr $C$DW$672, DW_AT_TI_symbol_name("Cllc_associatedDevList")
    8162                            .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    8163                            .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    8164                    
    8165                            .dwendtag $C$DW$T$60
    8166                    
    8167                    
    8168                    $C$DW$T$70      .dwtag  DW_TAG_structure_type
    8169                            .dwattr $C$DW$T$70, DW_AT_name(".ggroup2")
    8170                            .dwattr $C$DW$T$70, DW_AT_byte_size(0xb4)
    8171                    $C$DW$673       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:52:01 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{80AE9C78-212A-461C-8B3C-54F4C6BA3C6E} PAGE  150

    8172                            .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$61)
    8173                            .dwattr $C$DW$673, DW_AT_name("securityLevelEntry")
    8174                            .dwattr $C$DW$673, DW_AT_TI_symbol_name("securityLevelEntry")
    8175                            .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8176                            .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    8177                    
    8178                    $C$DW$674       .dwtag  DW_TAG_member
    8179                            .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$62)
    8180                            .dwattr $C$DW$674, DW_AT_name("Cllc_keySource")
    8181                            .dwattr $C$DW$674, DW_AT_TI_symbol_name("Cllc_keySource")
    8182                            .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8183                            .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    8184                    
    8185                    $C$DW$675       .dwtag  DW_TAG_member
    8186                            .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$62)
    8187                            .dwattr $C$DW$675, DW_AT_name("fhGtkHash0")
    8188                            .dwattr $C$DW$675, DW_AT_TI_symbol_name("fhGtkHash0")
    8189                            .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8190                            .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    8191                    
    8192                    $C$DW$676       .dwtag  DW_TAG_member
    8193                            .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$62)
    8194                            .dwattr $C$DW$676, DW_AT_name("fhGtkHash1")
    8195                            .dwattr $C$DW$676, DW_AT_TI_symbol_name("fhGtkHash1")
    8196                            .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    8197                            .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    8198                    
    8199                    $C$DW$677       .dwtag  DW_TAG_member
    8200                            .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$62)
    8201                            .dwattr $C$DW$677, DW_AT_name("fhGtkHash2")
    8202                            .dwattr $C$DW$677, DW_AT_TI_symbol_name("fhGtkHash2")
    8203                            .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    8204                            .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    8205                    
    8206                    $C$DW$678       .dwtag  DW_TAG_member
    8207                            .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$62)
    8208                            .dwattr $C$DW$678, DW_AT_name("fhGtkHash3")
    8209                            .dwattr $C$DW$678, DW_AT_TI_symbol_name("fhGtkHash3")
    8210                            .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    8211                            .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    8212                    
    8213                    $C$DW$679       .dwtag  DW_TAG_member
    8214                            .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$64)
    8215                            .dwattr $C$DW$679, DW_AT_name("keyIdLookupList")
    8216                            .dwattr $C$DW$679, DW_AT_TI_symbol_name("keyIdLookupList")
    8217                            .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    8218                            .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    8219                    
    8220                    $C$DW$680       .dwtag  DW_TAG_member
    8221                            .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$65)
    8222                            .dwattr $C$DW$680, DW_AT_name("$P$T1$2")
    8223                            .dwattr $C$DW$680, DW_AT_TI_symbol_name("$P$T1$2")
    8224                            .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    8225                            .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    8226                    
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:52:01 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{80AE9C78-212A-461C-8B3C-54F4C6BA3C6E} PAGE  151

    8227                    $C$DW$681       .dwtag  DW_TAG_member
    8228                            .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$66)
    8229                            .dwattr $C$DW$681, DW_AT_name("chanMask")
    8230                            .dwattr $C$DW$681, DW_AT_TI_symbol_name("chanMask")
    8231                            .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    8232                            .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    8233                    
    8234                    $C$DW$682       .dwtag  DW_TAG_member
    8235                            .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$66)
    8236                            .dwattr $C$DW$682, DW_AT_name("$P$T2$4")
    8237                            .dwattr $C$DW$682, DW_AT_TI_symbol_name("$P$T2$4")
    8238                            .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x57]
    8239                            .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    8240                    
    8241                    $C$DW$683       .dwtag  DW_TAG_member
    8242                            .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$67)
    8243                            .dwattr $C$DW$683, DW_AT_name("fhNetname")
    8244                            .dwattr $C$DW$683, DW_AT_TI_symbol_name("fhNetname")
    8245                            .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    8246                            .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    8247                    
    8248                    $C$DW$684       .dwtag  DW_TAG_member
    8249                            .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$69)
    8250                            .dwattr $C$DW$684, DW_AT_name("keyTable")
    8251                            .dwattr $C$DW$684, DW_AT_TI_symbol_name("keyTable")
    8252                            .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    8253                            .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    8254                    
    8255                            .dwendtag $C$DW$T$70
    8256                    
    8257                    
    8258                    $C$DW$T$71      .dwtag  DW_TAG_structure_type
    8259                            .dwattr $C$DW$T$71, DW_AT_name("S3_1")
    8260                            .dwattr $C$DW$T$71, DW_AT_declaration
    8261                            .dwendtag $C$DW$T$71
    8262                    
    8263                    
    8264                    $C$DW$T$72      .dwtag  DW_TAG_union_type
    8265                            .dwattr $C$DW$T$72, DW_AT_name("U3_0")
    8266                            .dwattr $C$DW$T$72, DW_AT_declaration
    8267                            .dwendtag $C$DW$T$72
    8268                    
    8269                    
    8270                    $C$DW$T$88      .dwtag  DW_TAG_structure_type
    8271                            .dwattr $C$DW$T$88, DW_AT_name("_Cllc_callbacks_t")
    8272                            .dwattr $C$DW$T$88, DW_AT_byte_size(0x0c)
    8273                    $C$DW$685       .dwtag  DW_TAG_member
    8274                            .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$77)
    8275                            .dwattr $C$DW$685, DW_AT_name("pStartedCb")
    8276                            .dwattr $C$DW$685, DW_AT_TI_symbol_name("pStartedCb")
    8277                            .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8278                            .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    8279                            .dwattr $C$DW$685, DW_AT_decl_file("..\Application\cllc.h")
    8280                            .dwattr $C$DW$685, DW_AT_decl_line(0xbf)
    8281                            .dwattr $C$DW$685, DW_AT_decl_column(0x16)
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:52:01 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{80AE9C78-212A-461C-8B3C-54F4C6BA3C6E} PAGE  152

    8282                    
    8283                    $C$DW$686       .dwtag  DW_TAG_member
    8284                            .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$84)
    8285                            .dwattr $C$DW$686, DW_AT_name("pDeviceJoiningCb")
    8286                            .dwattr $C$DW$686, DW_AT_TI_symbol_name("pDeviceJoiningCb")
    8287                            .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8288                            .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    8289                            .dwattr $C$DW$686, DW_AT_decl_file("..\Application\cllc.h")
    8290                            .dwattr $C$DW$686, DW_AT_decl_line(0xc1)
    8291                            .dwattr $C$DW$686, DW_AT_decl_column(0x1c)
    8292                    
    8293                    $C$DW$687       .dwtag  DW_TAG_member
    8294                            .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$87)
    8295                            .dwattr $C$DW$687, DW_AT_name("pStateChangeCb")
    8296                            .dwattr $C$DW$687, DW_AT_TI_symbol_name("pStateChangeCb")
    8297                            .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8298                            .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    8299                            .dwattr $C$DW$687, DW_AT_decl_file("..\Application\cllc.h")
    8300                            .dwattr $C$DW$687, DW_AT_decl_line(0xc3)
    8301                            .dwattr $C$DW$687, DW_AT_decl_column(0x1b)
    8302                    
    8303                            .dwattr $C$DW$T$88, DW_AT_decl_file("..\Application\cllc.h")
    8304                            .dwattr $C$DW$T$88, DW_AT_decl_line(0xbc)
    8305                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x10)
    8306                            .dwendtag $C$DW$T$88
    8307                    
    8308                    $C$DW$T$440     .dwtag  DW_TAG_typedef
    8309                            .dwattr $C$DW$T$440, DW_AT_name("Cllc_callbacks_t")
    8310                            .dwattr $C$DW$T$440, DW_AT_type(*$C$DW$T$88)
    8311                            .dwattr $C$DW$T$440, DW_AT_language(DW_LANG_C)
    8312                            .dwattr $C$DW$T$440, DW_AT_decl_file("..\Application\cllc.h")
    8313                            .dwattr $C$DW$T$440, DW_AT_decl_line(0xc4)
    8314                            .dwattr $C$DW$T$440, DW_AT_decl_column(0x03)
    8315                    
    8316                    $C$DW$T$441     .dwtag  DW_TAG_pointer_type
    8317                            .dwattr $C$DW$T$441, DW_AT_type(*$C$DW$T$440)
    8318                            .dwattr $C$DW$T$441, DW_AT_address_class(0x20)
    8319                    
    8320                    $C$DW$T$442     .dwtag  DW_TAG_const_type
    8321                            .dwattr $C$DW$T$442, DW_AT_type(*$C$DW$T$441)
    8322                    
    8323                    $C$DW$T$56      .dwtag  DW_TAG_pointer_type
    8324                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$88)
    8325                            .dwattr $C$DW$T$56, DW_AT_address_class(0x20)
    8326                    
    8327                    
    8328                    $C$DW$T$91      .dwtag  DW_TAG_structure_type
    8329                            .dwattr $C$DW$T$91, DW_AT_name("_Smsgs_broadcastcmdmsg_t")
    8330                            .dwattr $C$DW$T$91, DW_AT_byte_size(0x04)
    8331                    $C$DW$688       .dwtag  DW_TAG_member
    8332                            .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$90)
    8333                            .dwattr $C$DW$688, DW_AT_name("cmdId")
    8334                            .dwattr $C$DW$688, DW_AT_TI_symbol_name("cmdId")
    8335                            .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8336                            .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:52:01 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{80AE9C78-212A-461C-8B3C-54F4C6BA3C6E} PAGE  153

    8337                            .dwattr $C$DW$688, DW_AT_decl_file("..\Application\smsgs.h")
    8338                            .dwattr $C$DW$688, DW_AT_decl_line(0x20b)
    8339                            .dwattr $C$DW$688, DW_AT_decl_column(0x14)
    8340                    
    8341                    $C$DW$689       .dwtag  DW_TAG_member
    8342                            .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$30)
    8343                            .dwattr $C$DW$689, DW_AT_name("broadcastMsgId")
    8344                            .dwattr $C$DW$689, DW_AT_TI_symbol_name("broadcastMsgId")
    8345                            .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8346                            .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    8347                            .dwattr $C$DW$689, DW_AT_decl_file("..\Application\smsgs.h")
    8348                            .dwattr $C$DW$689, DW_AT_decl_line(0x20c)
    8349                            .dwattr $C$DW$689, DW_AT_decl_column(0x0e)
    8350                    
    8351                            .dwattr $C$DW$T$91, DW_AT_decl_file("..\Application\smsgs.h")
    8352                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x208)
    8353                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x10)
    8354                            .dwendtag $C$DW$T$91
    8355                    
    8356                    $C$DW$T$445     .dwtag  DW_TAG_typedef
    8357                            .dwattr $C$DW$T$445, DW_AT_name("Smsgs_broadcastcmdmsg_t")
    8358                            .dwattr $C$DW$T$445, DW_AT_type(*$C$DW$T$91)
    8359                            .dwattr $C$DW$T$445, DW_AT_language(DW_LANG_C)
    8360                            .dwattr $C$DW$T$445, DW_AT_decl_file("..\Application\smsgs.h")
    8361                            .dwattr $C$DW$T$445, DW_AT_decl_line(0x20d)
    8362                            .dwattr $C$DW$T$445, DW_AT_decl_column(0x02)
    8363                    
    8364                    
    8365                    $C$DW$T$92      .dwtag  DW_TAG_structure_type
    8366                            .dwattr $C$DW$T$92, DW_AT_name("_Smsgs_configreqmsg_t")
    8367                            .dwattr $C$DW$T$92, DW_AT_byte_size(0x0c)
    8368                    $C$DW$690       .dwtag  DW_TAG_member
    8369                            .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$90)
    8370                            .dwattr $C$DW$690, DW_AT_name("cmdId")
    8371                            .dwattr $C$DW$690, DW_AT_TI_symbol_name("cmdId")
    8372                            .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8373                            .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    8374                            .dwattr $C$DW$690, DW_AT_decl_file("..\Application\smsgs.h")
    8375                            .dwattr $C$DW$690, DW_AT_decl_line(0x115)
    8376                            .dwattr $C$DW$690, DW_AT_decl_column(0x14)
    8377                    
    8378                    $C$DW$691       .dwtag  DW_TAG_member
    8379                            .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$30)
    8380                            .dwattr $C$DW$691, DW_AT_name("frameControl")
    8381                            .dwattr $C$DW$691, DW_AT_TI_symbol_name("frameControl")
    8382                            .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8383                            .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    8384                            .dwattr $C$DW$691, DW_AT_decl_file("..\Application\smsgs.h")
    8385                            .dwattr $C$DW$691, DW_AT_decl_line(0x117)
    8386                            .dwattr $C$DW$691, DW_AT_decl_column(0x0e)
    8387                    
    8388                    $C$DW$692       .dwtag  DW_TAG_member
    8389                            .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$34)
    8390                            .dwattr $C$DW$692, DW_AT_name("reportingInterval")
    8391                            .dwattr $C$DW$692, DW_AT_TI_symbol_name("reportingInterval")
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:52:01 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{80AE9C78-212A-461C-8B3C-54F4C6BA3C6E} PAGE  154

    8392                            .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8393                            .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    8394                            .dwattr $C$DW$692, DW_AT_decl_file("..\Application\smsgs.h")
    8395                            .dwattr $C$DW$692, DW_AT_decl_line(0x119)
    8396                            .dwattr $C$DW$692, DW_AT_decl_column(0x0e)
    8397                    
    8398                    $C$DW$693       .dwtag  DW_TAG_member
    8399                            .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$34)
    8400                            .dwattr $C$DW$693, DW_AT_name("pollingInterval")
    8401                            .dwattr $C$DW$693, DW_AT_TI_symbol_name("pollingInterval")
    8402                            .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8403                            .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    8404                            .dwattr $C$DW$693, DW_AT_decl_file("..\Application\smsgs.h")
    8405                            .dwattr $C$DW$693, DW_AT_decl_line(0x11b)
    8406                            .dwattr $C$DW$693, DW_AT_decl_column(0x0e)
    8407                    
    8408                            .dwattr $C$DW$T$92, DW_AT_decl_file("..\Application\smsgs.h")
    8409                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x112)
    8410                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x10)
    8411                            .dwendtag $C$DW$T$92
    8412                    
    8413                    $C$DW$T$446     .dwtag  DW_TAG_typedef
    8414                            .dwattr $C$DW$T$446, DW_AT_name("Smsgs_configReqMsg_t")
    8415                            .dwattr $C$DW$T$446, DW_AT_type(*$C$DW$T$92)
    8416                            .dwattr $C$DW$T$446, DW_AT_language(DW_LANG_C)
    8417                            .dwattr $C$DW$T$446, DW_AT_decl_file("..\Application\smsgs.h")
    8418                            .dwattr $C$DW$T$446, DW_AT_decl_line(0x11c)
    8419                            .dwattr $C$DW$T$446, DW_AT_decl_column(0x03)
    8420                    
    8421                    
    8422                    $C$DW$T$95      .dwtag  DW_TAG_structure_type
    8423                            .dwattr $C$DW$T$95, DW_AT_name("_Smsgs_configrspmsg_t")
    8424                            .dwattr $C$DW$T$95, DW_AT_byte_size(0x0c)
    8425                    $C$DW$694       .dwtag  DW_TAG_member
    8426                            .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$90)
    8427                            .dwattr $C$DW$694, DW_AT_name("cmdId")
    8428                            .dwattr $C$DW$694, DW_AT_TI_symbol_name("cmdId")
    8429                            .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8430                            .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    8431                            .dwattr $C$DW$694, DW_AT_decl_file("..\Application\smsgs.h")
    8432                            .dwattr $C$DW$694, DW_AT_decl_line(0x125)
    8433                            .dwattr $C$DW$694, DW_AT_decl_column(0x14)
    8434                    
    8435                    $C$DW$695       .dwtag  DW_TAG_member
    8436                            .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$94)
    8437                            .dwattr $C$DW$695, DW_AT_name("status")
    8438                            .dwattr $C$DW$695, DW_AT_TI_symbol_name("status")
    8439                            .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8440                            .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    8441                            .dwattr $C$DW$695, DW_AT_decl_file("..\Application\smsgs.h")
    8442                            .dwattr $C$DW$695, DW_AT_decl_line(0x127)
    8443                            .dwattr $C$DW$695, DW_AT_decl_column(0x1a)
    8444                    
    8445                    $C$DW$696       .dwtag  DW_TAG_member
    8446                            .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$30)
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:52:01 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{80AE9C78-212A-461C-8B3C-54F4C6BA3C6E} PAGE  155

    8447                            .dwattr $C$DW$696, DW_AT_name("frameControl")
    8448                            .dwattr $C$DW$696, DW_AT_TI_symbol_name("frameControl")
    8449                            .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8450                            .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    8451                            .dwattr $C$DW$696, DW_AT_decl_file("..\Application\smsgs.h")
    8452                            .dwattr $C$DW$696, DW_AT_decl_line(0x129)
    8453                            .dwattr $C$DW$696, DW_AT_decl_column(0x0e)
    8454                    
    8455                    $C$DW$697       .dwtag  DW_TAG_member
    8456                            .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$34)
    8457                            .dwattr $C$DW$697, DW_AT_name("reportingInterval")
    8458                            .dwattr $C$DW$697, DW_AT_TI_symbol_name("reportingInterval")
    8459                            .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8460                            .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    8461                            .dwattr $C$DW$697, DW_AT_decl_file("..\Application\smsgs.h")
    8462                            .dwattr $C$DW$697, DW_AT_decl_line(0x12b)
    8463                            .dwattr $C$DW$697, DW_AT_decl_column(0x0e)
    8464                    
    8465                    $C$DW$698       .dwtag  DW_TAG_member
    8466                            .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$34)
    8467                            .dwattr $C$DW$698, DW_AT_name("pollingInterval")
    8468                            .dwattr $C$DW$698, DW_AT_TI_symbol_name("pollingInterval")
    8469                            .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8470                            .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    8471                            .dwattr $C$DW$698, DW_AT_decl_file("..\Application\smsgs.h")
    8472                            .dwattr $C$DW$698, DW_AT_decl_line(0x12d)
    8473                            .dwattr $C$DW$698, DW_AT_decl_column(0x0e)
    8474                    
    8475                            .dwattr $C$DW$T$95, DW_AT_decl_file("..\Application\smsgs.h")
    8476                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x122)
    8477                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x10)
    8478                            .dwendtag $C$DW$T$95
    8479                    
    8480                    $C$DW$T$447     .dwtag  DW_TAG_typedef
    8481                            .dwattr $C$DW$T$447, DW_AT_name("Smsgs_configRspMsg_t")
    8482                            .dwattr $C$DW$T$447, DW_AT_type(*$C$DW$T$95)
    8483                            .dwattr $C$DW$T$447, DW_AT_language(DW_LANG_C)
    8484                            .dwattr $C$DW$T$447, DW_AT_decl_file("..\Application\smsgs.h")
    8485                            .dwattr $C$DW$T$447, DW_AT_decl_line(0x12e)
    8486                            .dwattr $C$DW$T$447, DW_AT_decl_column(0x03)
    8487                    
    8488                    
    8489                    $C$DW$T$96      .dwtag  DW_TAG_structure_type
    8490                            .dwattr $C$DW$T$96, DW_AT_name("_Smsgs_configsettingsfield_t")
    8491                            .dwattr $C$DW$T$96, DW_AT_byte_size(0x08)
    8492                    $C$DW$699       .dwtag  DW_TAG_member
    8493                            .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$34)
    8494                            .dwattr $C$DW$699, DW_AT_name("reportingInterval")
    8495                            .dwattr $C$DW$699, DW_AT_TI_symbol_name("reportingInterval")
    8496                            .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8497                            .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    8498                            .dwattr $C$DW$699, DW_AT_decl_file("..\Application\smsgs.h")
    8499                            .dwattr $C$DW$699, DW_AT_decl_line(0x1d6)
    8500                            .dwattr $C$DW$699, DW_AT_decl_column(0x0e)
    8501                    
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:52:01 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{80AE9C78-212A-461C-8B3C-54F4C6BA3C6E} PAGE  156

    8502                    $C$DW$700       .dwtag  DW_TAG_member
    8503                            .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$34)
    8504                            .dwattr $C$DW$700, DW_AT_name("pollingInterval")
    8505                            .dwattr $C$DW$700, DW_AT_TI_symbol_name("pollingInterval")
    8506                            .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8507                            .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    8508                            .dwattr $C$DW$700, DW_AT_decl_file("..\Application\smsgs.h")
    8509                            .dwattr $C$DW$700, DW_AT_decl_line(0x1dc)
    8510                            .dwattr $C$DW$700, DW_AT_decl_column(0x0e)
    8511                    
    8512                            .dwattr $C$DW$T$96, DW_AT_decl_file("..\Application\smsgs.h")
    8513                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x1d0)
    8514                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x10)
    8515                            .dwendtag $C$DW$T$96
    8516                    
    8517                    $C$DW$T$104     .dwtag  DW_TAG_typedef
    8518                            .dwattr $C$DW$T$104, DW_AT_name("Smsgs_configSettingsField_t")
    8519                            .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$96)
    8520                            .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    8521                            .dwattr $C$DW$T$104, DW_AT_decl_file("..\Application\smsgs.h")
    8522                            .dwattr $C$DW$T$104, DW_AT_decl_line(0x1dd)
    8523                            .dwattr $C$DW$T$104, DW_AT_decl_column(0x03)
    8524                    
    8525                    
    8526                    $C$DW$T$97      .dwtag  DW_TAG_structure_type
    8527                            .dwattr $C$DW$T$97, DW_AT_name("_Smsgs_humiditysensorfield_t")
    8528                            .dwattr $C$DW$T$97, DW_AT_byte_size(0x04)
    8529                    $C$DW$701       .dwtag  DW_TAG_member
    8530                            .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$30)
    8531                            .dwattr $C$DW$701, DW_AT_name("temp")
    8532                            .dwattr $C$DW$701, DW_AT_TI_symbol_name("temp")
    8533                            .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8534                            .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    8535                            .dwattr $C$DW$701, DW_AT_decl_file("..\Application\smsgs.h")
    8536                            .dwattr $C$DW$701, DW_AT_decl_line(0x178)
    8537                            .dwattr $C$DW$701, DW_AT_decl_column(0x0e)
    8538                    
    8539                    $C$DW$702       .dwtag  DW_TAG_member
    8540                            .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$30)
    8541                            .dwattr $C$DW$702, DW_AT_name("humidity")
    8542                            .dwattr $C$DW$702, DW_AT_TI_symbol_name("humidity")
    8543                            .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8544                            .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    8545                            .dwattr $C$DW$702, DW_AT_decl_file("..\Application\smsgs.h")
    8546                            .dwattr $C$DW$702, DW_AT_decl_line(0x17a)
    8547                            .dwattr $C$DW$702, DW_AT_decl_column(0x0e)
    8548                    
    8549                            .dwattr $C$DW$T$97, DW_AT_decl_file("..\Application\smsgs.h")
    8550                            .dwattr $C$DW$T$97, DW_AT_decl_line(0x175)
    8551                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x10)
    8552                            .dwendtag $C$DW$T$97
    8553                    
    8554                    $C$DW$T$102     .dwtag  DW_TAG_typedef
    8555                            .dwattr $C$DW$T$102, DW_AT_name("Smsgs_humiditySensorField_t")
    8556                            .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$97)
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:52:01 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{80AE9C78-212A-461C-8B3C-54F4C6BA3C6E} PAGE  157

    8557                            .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    8558                            .dwattr $C$DW$T$102, DW_AT_decl_file("..\Application\smsgs.h")
    8559                            .dwattr $C$DW$T$102, DW_AT_decl_line(0x17b)
    8560                            .dwattr $C$DW$T$102, DW_AT_decl_column(0x03)
    8561                    
    8562                    
    8563                    $C$DW$T$98      .dwtag  DW_TAG_structure_type
    8564                            .dwattr $C$DW$T$98, DW_AT_name("_Smsgs_lightsensorfield_t")
    8565                            .dwattr $C$DW$T$98, DW_AT_byte_size(0x02)
    8566                    $C$DW$703       .dwtag  DW_TAG_member
    8567                            .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$30)
    8568                            .dwattr $C$DW$703, DW_AT_name("rawData")
    8569                            .dwattr $C$DW$703, DW_AT_TI_symbol_name("rawData")
    8570                            .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8571                            .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    8572                            .dwattr $C$DW$703, DW_AT_decl_file("..\Application\smsgs.h")
    8573                            .dwattr $C$DW$703, DW_AT_decl_line(0x16f)
    8574                            .dwattr $C$DW$703, DW_AT_decl_column(0x0e)
    8575                    
    8576                            .dwattr $C$DW$T$98, DW_AT_decl_file("..\Application\smsgs.h")
    8577                            .dwattr $C$DW$T$98, DW_AT_decl_line(0x16c)
    8578                            .dwattr $C$DW$T$98, DW_AT_decl_column(0x10)
    8579                            .dwendtag $C$DW$T$98
    8580                    
    8581                    $C$DW$T$101     .dwtag  DW_TAG_typedef
    8582                            .dwattr $C$DW$T$101, DW_AT_name("Smsgs_lightSensorField_t")
    8583                            .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$98)
    8584                            .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    8585                            .dwattr $C$DW$T$101, DW_AT_decl_file("..\Application\smsgs.h")
    8586                            .dwattr $C$DW$T$101, DW_AT_decl_line(0x170)
    8587                            .dwattr $C$DW$T$101, DW_AT_decl_column(0x03)
    8588                    
    8589                    
    8590                    $C$DW$T$99      .dwtag  DW_TAG_structure_type
    8591                            .dwattr $C$DW$T$99, DW_AT_name("_Smsgs_msgstatsfield_t")
    8592                            .dwattr $C$DW$T$99, DW_AT_byte_size(0x2c)
    8593                    $C$DW$704       .dwtag  DW_TAG_member
    8594                            .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$30)
    8595                            .dwattr $C$DW$704, DW_AT_name("joinAttempts")
    8596                            .dwattr $C$DW$704, DW_AT_TI_symbol_name("joinAttempts")
    8597                            .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8598                            .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    8599                            .dwattr $C$DW$704, DW_AT_decl_file("..\Application\smsgs.h")
    8600                            .dwattr $C$DW$704, DW_AT_decl_line(0x183)
    8601                            .dwattr $C$DW$704, DW_AT_decl_column(0x0e)
    8602                    
    8603                    $C$DW$705       .dwtag  DW_TAG_member
    8604                            .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$30)
    8605                            .dwattr $C$DW$705, DW_AT_name("joinFails")
    8606                            .dwattr $C$DW$705, DW_AT_TI_symbol_name("joinFails")
    8607                            .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8608                            .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    8609                            .dwattr $C$DW$705, DW_AT_decl_file("..\Application\smsgs.h")
    8610                            .dwattr $C$DW$705, DW_AT_decl_line(0x185)
