TI ARM Assembler PC v16.9.4 Mon Mar 05 22:12:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C4A3E110-53AC-4E56-B60E-A1B941B7B216} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Mon Mar 05 22:12:38 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/cllc.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\collector_cc1310lp\collector_cc1
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram
      15                            .dwattr $C$DW$1, DW_AT_name("memcpy")

    7382                    $C$DW$614       .dwtag  DW_TAG_enumerator
    7383                            .dwattr $C$DW$614, DW_AT_name("ApiMac_wisunSubIE_GTKHashIE")
    7384                            .dwattr $C$DW$614, DW_AT_const_value(0x07)
    7385                            .dwattr $C$DW$614, DW_AT_decl_file("..\Application\api_mac.h")
    7386                            .dwattr $C$DW$614, DW_AT_decl_line(0x44d)
    7387                            .dwattr $C$DW$614, DW_AT_decl_column(0x05)
    7388                    
    7389                            .dwattr $C$DW$T$407, DW_AT_decl_file("..\Application\api_mac.h")
    7390                            .dwattr $C$DW$T$407, DW_AT_decl_line(0x441)
    7391                            .dwattr $C$DW$T$407, DW_AT_decl_column(0x01)
    7392                            .dwendtag $C$DW$T$407
    7393                    
    7394                    $C$DW$T$408     .dwtag  DW_TAG_typedef
    7395                            .dwattr $C$DW$T$408, DW_AT_name("ApiMac_wisunSubIE_t")
    7396                            .dwattr $C$DW$T$408, DW_AT_type(*$C$DW$T$407)
    7397                            .dwattr $C$DW$T$408, DW_AT_language(DW_LANG_C)
    7398                            .dwattr $C$DW$T$408, DW_AT_decl_file("..\Application\api_mac.h")
    7399                            .dwattr $C$DW$T$408, DW_AT_decl_line(0x44e)
    7400                            .dwattr $C$DW$T$408, DW_AT_decl_column(0x03)
    7401                    
    7402                    
    7403                    $C$DW$T$409     .dwtag  DW_TAG_enumeration_type
    7404                            .dwattr $C$DW$T$409, DW_AT_byte_size(0x01)
    7405                    $C$DW$615       .dwtag  DW_TAG_enumerator
    7406                            .dwattr $C$DW$615, DW_AT_name("Smsgs_dataFields_tempSensor")
    7407                            .dwattr $C$DW$615, DW_AT_const_value(0x01)
    7408                            .dwattr $C$DW$615, DW_AT_decl_file("..\Application\smsgs.h")
    7409                            .dwattr $C$DW$615, DW_AT_decl_line(0xf8)
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:12:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C4A3E110-53AC-4E56-B60E-A1B941B7B216} PAGE  136

    7410                            .dwattr $C$DW$615, DW_AT_decl_column(0x05)
    7411                    
    7412                    $C$DW$616       .dwtag  DW_TAG_enumerator
    7413                            .dwattr $C$DW$616, DW_AT_name("Smsgs_dataFields_lightSensor")
    7414                            .dwattr $C$DW$616, DW_AT_const_value(0x02)
    7415                            .dwattr $C$DW$616, DW_AT_decl_file("..\Application\smsgs.h")
    7416                            .dwattr $C$DW$616, DW_AT_decl_line(0xfa)
    7417                            .dwattr $C$DW$616, DW_AT_decl_column(0x05)
    7418                    
    7419                    $C$DW$617       .dwtag  DW_TAG_enumerator
    7420                            .dwattr $C$DW$617, DW_AT_name("Smsgs_dataFields_humiditySensor")
    7421                            .dwattr $C$DW$617, DW_AT_const_value(0x04)
    7422                            .dwattr $C$DW$617, DW_AT_decl_file("..\Application\smsgs.h")
    7423                            .dwattr $C$DW$617, DW_AT_decl_line(0xfc)
    7424                            .dwattr $C$DW$617, DW_AT_decl_column(0x05)
    7425                    
    7426                    $C$DW$618       .dwtag  DW_TAG_enumerator
    7427                            .dwattr $C$DW$618, DW_AT_name("Smsgs_dataFields_msgStats")
    7428                            .dwattr $C$DW$618, DW_AT_const_value(0x08)
    7429                            .dwattr $C$DW$618, DW_AT_decl_file("..\Application\smsgs.h")
    7430                            .dwattr $C$DW$618, DW_AT_decl_line(0xfe)
    7431                            .dwattr $C$DW$618, DW_AT_decl_column(0x05)
    7432                    
    7433                    $C$DW$619       .dwtag  DW_TAG_enumerator
    7434                            .dwattr $C$DW$619, DW_AT_name("Smsgs_dataFields_configSettings")
    7435                            .dwattr $C$DW$619, DW_AT_const_value(0x10)
    7436                            .dwattr $C$DW$619, DW_AT_decl_file("..\Application\smsgs.h")
    7437                            .dwattr $C$DW$619, DW_AT_decl_line(0x100)
    7438                            .dwattr $C$DW$619, DW_AT_decl_column(0x05)
    7439                    
    7440                            .dwattr $C$DW$T$409, DW_AT_decl_file("..\Application\smsgs.h")
    7441                            .dwattr $C$DW$T$409, DW_AT_decl_line(0xf6)
    7442                            .dwattr $C$DW$T$409, DW_AT_decl_column(0x01)
    7443                            .dwendtag $C$DW$T$409
    7444                    
    7445                    $C$DW$T$410     .dwtag  DW_TAG_typedef
    7446                            .dwattr $C$DW$T$410, DW_AT_name("Smsgs_dataFields_t")
    7447                            .dwattr $C$DW$T$410, DW_AT_type(*$C$DW$T$409)
    7448                            .dwattr $C$DW$T$410, DW_AT_language(DW_LANG_C)
    7449                            .dwattr $C$DW$T$410, DW_AT_decl_file("..\Application\smsgs.h")
    7450                            .dwattr $C$DW$T$410, DW_AT_decl_line(0x101)
    7451                            .dwattr $C$DW$T$410, DW_AT_decl_column(0x03)
    7452                    
    7453                    
    7454                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    7455                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x0a)
    7456                    $C$DW$620       .dwtag  DW_TAG_member
    7457                            .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$47)
    7458                            .dwattr $C$DW$620, DW_AT_name("addr")
    7459                            .dwattr $C$DW$620, DW_AT_TI_symbol_name("addr")
    7460                            .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7461                            .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    7462                            .dwattr $C$DW$620, DW_AT_decl_file("..\Application\api_mac.h")
    7463                            .dwattr $C$DW$620, DW_AT_decl_line(0x4a7)
    7464                            .dwattr $C$DW$620, DW_AT_decl_column(0x07)
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:12:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C4A3E110-53AC-4E56-B60E-A1B941B7B216} PAGE  137

    7465                    
    7466                    $C$DW$621       .dwtag  DW_TAG_member
    7467                            .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$20)
    7468                            .dwattr $C$DW$621, DW_AT_name("addrMode")
    7469                            .dwattr $C$DW$621, DW_AT_TI_symbol_name("addrMode")
    7470                            .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7471                            .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    7472                            .dwattr $C$DW$621, DW_AT_decl_file("..\Application\api_mac.h")
    7473                            .dwattr $C$DW$621, DW_AT_decl_line(0x4aa)
    7474                            .dwattr $C$DW$621, DW_AT_decl_column(0x17)
    7475                    
    7476                            .dwattr $C$DW$T$21, DW_AT_decl_file("..\Application\api_mac.h")
    7477                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x49c)
    7478                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x01)
    7479                            .dwendtag $C$DW$T$21
    7480                    
    7481                    $C$DW$T$222     .dwtag  DW_TAG_typedef
    7482                            .dwattr $C$DW$T$222, DW_AT_name("ApiMac_sAddr_t")
    7483                            .dwattr $C$DW$T$222, DW_AT_type(*$C$DW$T$21)
    7484                            .dwattr $C$DW$T$222, DW_AT_language(DW_LANG_C)
    7485                            .dwattr $C$DW$T$222, DW_AT_decl_file("..\Application\api_mac.h")
    7486                            .dwattr $C$DW$T$222, DW_AT_decl_line(0x4ab)
    7487                            .dwattr $C$DW$T$222, DW_AT_decl_column(0x03)
    7488                    
    7489                    $C$DW$T$411     .dwtag  DW_TAG_pointer_type
    7490                            .dwattr $C$DW$T$411, DW_AT_type(*$C$DW$T$222)
    7491                            .dwattr $C$DW$T$411, DW_AT_address_class(0x20)
    7492                    
    7493                    
    7494                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    7495                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x40)
    7496                    $C$DW$622       .dwtag  DW_TAG_member
    7497                            .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$23)
    7498                            .dwattr $C$DW$622, DW_AT_name("beaconType")
    7499                            .dwattr $C$DW$622, DW_AT_TI_symbol_name("beaconType")
    7500                            .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7501                            .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    7502                            .dwattr $C$DW$622, DW_AT_decl_file("..\Application\api_mac.h")
    7503                            .dwattr $C$DW$622, DW_AT_decl_line(0x848)
    7504                            .dwattr $C$DW$622, DW_AT_decl_column(0x19)
    7505                    
    7506                    $C$DW$623       .dwtag  DW_TAG_member
    7507                            .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$24)
    7508                            .dwattr $C$DW$623, DW_AT_name("bsn")
    7509                            .dwattr $C$DW$623, DW_AT_TI_symbol_name("bsn")
    7510                            .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7511                            .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    7512                            .dwattr $C$DW$623, DW_AT_decl_file("..\Application\api_mac.h")
    7513                            .dwattr $C$DW$623, DW_AT_decl_line(0x84a)
    7514                            .dwattr $C$DW$623, DW_AT_decl_column(0x0d)
    7515                    
    7516                    $C$DW$624       .dwtag  DW_TAG_member
    7517                            .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$25)
    7518                            .dwattr $C$DW$624, DW_AT_name("panDesc")
    7519                            .dwattr $C$DW$624, DW_AT_TI_symbol_name("panDesc")
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:12:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C4A3E110-53AC-4E56-B60E-A1B941B7B216} PAGE  138

    7520                            .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7521                            .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    7522                            .dwattr $C$DW$624, DW_AT_decl_file("..\Application\api_mac.h")
    7523                            .dwattr $C$DW$624, DW_AT_decl_line(0x84c)
    7524                            .dwattr $C$DW$624, DW_AT_decl_column(0x16)
    7525                    
    7526                    $C$DW$625       .dwtag  DW_TAG_member
    7527                            .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$50)
    7528                            .dwattr $C$DW$625, DW_AT_name("beaconData")
    7529                            .dwattr $C$DW$625, DW_AT_TI_symbol_name("beaconData")
    7530                            .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7531                            .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    7532                            .dwattr $C$DW$625, DW_AT_decl_file("..\Application\api_mac.h")
    7533                            .dwattr $C$DW$625, DW_AT_decl_line(0x857)
    7534                            .dwattr $C$DW$625, DW_AT_decl_column(0x07)
    7535                    
    7536                            .dwattr $C$DW$T$26, DW_AT_decl_file("..\Application\api_mac.h")
    7537                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x846)
    7538                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x01)
    7539                            .dwendtag $C$DW$T$26
    7540                    
    7541                    $C$DW$T$135     .dwtag  DW_TAG_typedef
    7542                            .dwattr $C$DW$T$135, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
    7543                            .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$26)
    7544                            .dwattr $C$DW$T$135, DW_AT_language(DW_LANG_C)
    7545                            .dwattr $C$DW$T$135, DW_AT_decl_file("..\Application\api_mac.h")
    7546                            .dwattr $C$DW$T$135, DW_AT_decl_line(0x858)
    7547                            .dwattr $C$DW$T$135, DW_AT_decl_column(0x03)
    7548                    
    7549                    $C$DW$T$136     .dwtag  DW_TAG_pointer_type
    7550                            .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$135)
    7551                            .dwattr $C$DW$T$136, DW_AT_address_class(0x20)
    7552                    
    7553                    $C$DW$T$413     .dwtag  DW_TAG_const_type
    7554                            .dwattr $C$DW$T$413, DW_AT_type(*$C$DW$T$136)
    7555                    
    7556                    
    7557                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    7558                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x0e)
    7559                    $C$DW$626       .dwtag  DW_TAG_member
    7560                            .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$27)
    7561                            .dwattr $C$DW$626, DW_AT_name("devInfo")
    7562                            .dwattr $C$DW$626, DW_AT_TI_symbol_name("devInfo")
    7563                            .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7564                            .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    7565                            .dwattr $C$DW$626, DW_AT_decl_file("..\Application\llc.h")
    7566                            .dwattr $C$DW$626, DW_AT_decl_line(0x47)
    7567                            .dwattr $C$DW$626, DW_AT_decl_column(0x1f)
    7568                    
    7569                    $C$DW$627       .dwtag  DW_TAG_member
    7570                            .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$24)
    7571                            .dwattr $C$DW$627, DW_AT_name("channel")
    7572                            .dwattr $C$DW$627, DW_AT_TI_symbol_name("channel")
    7573                            .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7574                            .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:12:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C4A3E110-53AC-4E56-B60E-A1B941B7B216} PAGE  139

    7575                            .dwattr $C$DW$627, DW_AT_decl_file("..\Application\llc.h")
    7576                            .dwattr $C$DW$627, DW_AT_decl_line(0x49)
    7577                            .dwattr $C$DW$627, DW_AT_decl_column(0x0d)
    7578                    
    7579                    $C$DW$628       .dwtag  DW_TAG_member
    7580                            .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$28)
    7581                            .dwattr $C$DW$628, DW_AT_name("fh")
    7582                            .dwattr $C$DW$628, DW_AT_TI_symbol_name("fh")
    7583                            .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7584                            .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    7585                            .dwattr $C$DW$628, DW_AT_decl_file("..\Application\llc.h")
    7586                            .dwattr $C$DW$628, DW_AT_decl_line(0x4b)
    7587                            .dwattr $C$DW$628, DW_AT_decl_column(0x0a)
    7588                    
    7589                            .dwattr $C$DW$T$29, DW_AT_decl_file("..\Application\llc.h")
    7590                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x45)
    7591                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    7592                            .dwendtag $C$DW$T$29
    7593                    
    7594                    $C$DW$T$65      .dwtag  DW_TAG_const_type
    7595                            .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$29)
    7596                    
    7597                    $C$DW$T$73      .dwtag  DW_TAG_typedef
    7598                            .dwattr $C$DW$T$73, DW_AT_name("Llc_netInfo_t")
    7599                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$29)
    7600                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    7601                            .dwattr $C$DW$T$73, DW_AT_decl_file("..\Application\llc.h")
    7602                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x4c)
    7603                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    7604                    
    7605                    $C$DW$T$417     .dwtag  DW_TAG_const_type
    7606                            .dwattr $C$DW$T$417, DW_AT_type(*$C$DW$T$73)
    7607                    
    7608                    $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    7609                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    7610                            .dwattr $C$DW$T$74, DW_AT_address_class(0x20)
    7611                    
    7612                    $C$DW$T$418     .dwtag  DW_TAG_const_type
    7613                            .dwattr $C$DW$T$418, DW_AT_type(*$C$DW$T$74)
    7614                    
    7615                    
    7616                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    7617                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x0c)
    7618                    $C$DW$629       .dwtag  DW_TAG_member
    7619                            .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$30)
    7620                            .dwattr $C$DW$629, DW_AT_name("shortAddr")
    7621                            .dwattr $C$DW$629, DW_AT_TI_symbol_name("shortAddr")
    7622                            .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7623                            .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    7624                            .dwattr $C$DW$629, DW_AT_decl_file("..\Application\cllc.h")
    7625                            .dwattr $C$DW$629, DW_AT_decl_line(0x7c)
    7626                            .dwattr $C$DW$629, DW_AT_decl_column(0x0e)
    7627                    
    7628                    $C$DW$630       .dwtag  DW_TAG_member
    7629                            .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$31)
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:12:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C4A3E110-53AC-4E56-B60E-A1B941B7B216} PAGE  140

    7630                            .dwattr $C$DW$630, DW_AT_name("capInfo")
    7631                            .dwattr $C$DW$630, DW_AT_TI_symbol_name("capInfo")
    7632                            .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7633                            .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    7634                            .dwattr $C$DW$630, DW_AT_decl_file("..\Application\cllc.h")
    7635                            .dwattr $C$DW$630, DW_AT_decl_line(0x7e)
    7636                            .dwattr $C$DW$630, DW_AT_decl_column(0x1d)
    7637                    
    7638                    $C$DW$631       .dwtag  DW_TAG_member
    7639                            .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$32)
    7640                            .dwattr $C$DW$631, DW_AT_name("rssi")
    7641                            .dwattr $C$DW$631, DW_AT_TI_symbol_name("rssi")
    7642                            .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7643                            .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    7644                            .dwattr $C$DW$631, DW_AT_decl_file("..\Application\cllc.h")
    7645                            .dwattr $C$DW$631, DW_AT_decl_line(0x80)
    7646                            .dwattr $C$DW$631, DW_AT_decl_column(0x0c)
    7647                    
    7648                    $C$DW$632       .dwtag  DW_TAG_member
    7649                            .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$30)
    7650                            .dwattr $C$DW$632, DW_AT_name("status")
    7651                            .dwattr $C$DW$632, DW_AT_TI_symbol_name("status")
    7652                            .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7653                            .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    7654                            .dwattr $C$DW$632, DW_AT_decl_file("..\Application\cllc.h")
    7655                            .dwattr $C$DW$632, DW_AT_decl_line(0x82)
    7656                            .dwattr $C$DW$632, DW_AT_decl_column(0x0e)
    7657                    
    7658                            .dwattr $C$DW$T$33, DW_AT_decl_file("..\Application\cllc.h")
    7659                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x7a)
    7660                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    7661                            .dwendtag $C$DW$T$33
    7662                    
    7663                    $C$DW$T$421     .dwtag  DW_TAG_typedef
    7664                            .dwattr $C$DW$T$421, DW_AT_name("Cllc_associated_devices_t")
    7665                            .dwattr $C$DW$T$421, DW_AT_type(*$C$DW$T$33)
    7666                            .dwattr $C$DW$T$421, DW_AT_language(DW_LANG_C)
    7667                            .dwattr $C$DW$T$421, DW_AT_decl_file("..\Application\cllc.h")
    7668                            .dwattr $C$DW$T$421, DW_AT_decl_line(0x83)
    7669                            .dwattr $C$DW$T$421, DW_AT_decl_column(0x03)
    7670                    
    7671                    $C$DW$T$422     .dwtag  DW_TAG_pointer_type
    7672                            .dwattr $C$DW$T$422, DW_AT_type(*$C$DW$T$421)
    7673                            .dwattr $C$DW$T$422, DW_AT_address_class(0x20)
    7674                    
    7675                    
    7676                    $C$DW$T$424     .dwtag  DW_TAG_array_type
    7677                            .dwattr $C$DW$T$424, DW_AT_type(*$C$DW$T$421)
    7678                            .dwattr $C$DW$T$424, DW_AT_language(DW_LANG_C)
    7679                            .dwattr $C$DW$T$424, DW_AT_byte_size(0x258)
    7680                    $C$DW$633       .dwtag  DW_TAG_subrange_type
    7681                            .dwattr $C$DW$633, DW_AT_upper_bound(0x31)
    7682                    
    7683                            .dwendtag $C$DW$T$424
    7684                    
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:12:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C4A3E110-53AC-4E56-B60E-A1B941B7B216} PAGE  141

    7685                    $C$DW$T$57      .dwtag  DW_TAG_pointer_type
    7686                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$33)
    7687                            .dwattr $C$DW$T$57, DW_AT_address_class(0x20)
    7688                    
    7689                    
    7690                    $C$DW$T$59      .dwtag  DW_TAG_array_type
    7691                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$33)
    7692                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    7693                            .dwattr $C$DW$T$59, DW_AT_byte_size(0x258)
    7694                    $C$DW$634       .dwtag  DW_TAG_subrange_type
    7695                            .dwattr $C$DW$634, DW_AT_upper_bound(0x31)
    7696                    
    7697                            .dwendtag $C$DW$T$59
    7698                    
    7699                    
    7700                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    7701                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x14)
    7702                    $C$DW$635       .dwtag  DW_TAG_member
    7703                            .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$34)
    7704                            .dwattr $C$DW$635, DW_AT_name("fhNumPASolicitReceived")
    7705                            .dwattr $C$DW$635, DW_AT_TI_symbol_name("fhNumPASolicitReceived")
    7706                            .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7707                            .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    7708                            .dwattr $C$DW$635, DW_AT_decl_file("..\Application\cllc.h")
    7709                            .dwattr $C$DW$635, DW_AT_decl_line(0x89)
    7710                            .dwattr $C$DW$635, DW_AT_decl_column(0x0e)
    7711                    
    7712                    $C$DW$636       .dwtag  DW_TAG_member
    7713                            .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$34)
    7714                            .dwattr $C$DW$636, DW_AT_name("fhNumPASent")
    7715                            .dwattr $C$DW$636, DW_AT_TI_symbol_name("fhNumPASent")
    7716                            .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7717                            .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    7718                            .dwattr $C$DW$636, DW_AT_decl_file("..\Application\cllc.h")
    7719                            .dwattr $C$DW$636, DW_AT_decl_line(0x8b)
    7720                            .dwattr $C$DW$636, DW_AT_decl_column(0x0e)
    7721                    
    7722                    $C$DW$637       .dwtag  DW_TAG_member
    7723                            .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$34)
    7724                            .dwattr $C$DW$637, DW_AT_name("fhNumPANConfigSolicitsReceived")
    7725                            .dwattr $C$DW$637, DW_AT_TI_symbol_name("fhNumPANConfigSolicitsReceived")
    7726                            .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7727                            .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    7728                            .dwattr $C$DW$637, DW_AT_decl_file("..\Application\cllc.h")
    7729                            .dwattr $C$DW$637, DW_AT_decl_line(0x8d)
    7730                            .dwattr $C$DW$637, DW_AT_decl_column(0x0e)
    7731                    
    7732                    $C$DW$638       .dwtag  DW_TAG_member
    7733                            .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$34)
    7734                            .dwattr $C$DW$638, DW_AT_name("fhNumPANConfigSent")
    7735                            .dwattr $C$DW$638, DW_AT_TI_symbol_name("fhNumPANConfigSent")
    7736                            .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7737                            .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    7738                            .dwattr $C$DW$638, DW_AT_decl_file("..\Application\cllc.h")
    7739                            .dwattr $C$DW$638, DW_AT_decl_line(0x8f)
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:12:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C4A3E110-53AC-4E56-B60E-A1B941B7B216} PAGE  142

    7740                            .dwattr $C$DW$638, DW_AT_decl_column(0x0e)
    7741                    
    7742                    $C$DW$639       .dwtag  DW_TAG_member
    7743                            .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$34)
    7744                            .dwattr $C$DW$639, DW_AT_name("otherStats")
    7745                            .dwattr $C$DW$639, DW_AT_TI_symbol_name("otherStats")
    7746                            .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7747                            .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    7748                            .dwattr $C$DW$639, DW_AT_decl_file("..\Application\cllc.h")
    7749                            .dwattr $C$DW$639, DW_AT_decl_line(0x90)
    7750                            .dwattr $C$DW$639, DW_AT_decl_column(0x0e)
    7751                    
    7752                            .dwattr $C$DW$T$35, DW_AT_decl_file("..\Application\cllc.h")
    7753                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x87)
    7754                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x01)
    7755                            .dwendtag $C$DW$T$35
    7756                    
    7757                    $C$DW$T$428     .dwtag  DW_TAG_typedef
    7758                            .dwattr $C$DW$T$428, DW_AT_name("Cllc_statistics_t")
    7759                            .dwattr $C$DW$T$428, DW_AT_type(*$C$DW$T$35)
    7760                            .dwattr $C$DW$T$428, DW_AT_language(DW_LANG_C)
    7761                            .dwattr $C$DW$T$428, DW_AT_decl_file("..\Application\cllc.h")
    7762                            .dwattr $C$DW$T$428, DW_AT_decl_line(0x91)
    7763                            .dwattr $C$DW$T$428, DW_AT_decl_column(0x03)
    7764                    
    7765                    
    7766                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    7767                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x08)
    7768                    $C$DW$640       .dwtag  DW_TAG_member
    7769                            .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$24)
    7770                            .dwattr $C$DW$640, DW_AT_name("channel")
    7771                            .dwattr $C$DW$640, DW_AT_TI_symbol_name("channel")
    7772                            .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7773                            .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    7774                            .dwattr $C$DW$640, DW_AT_decl_file("../Application/cllc.c")
    7775                            .dwattr $C$DW$640, DW_AT_decl_line(0x93)
    7776                            .dwattr $C$DW$640, DW_AT_decl_column(0x0d)
    7777                    
    7778                    $C$DW$641       .dwtag  DW_TAG_member
    7779                            .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$30)
    7780                            .dwattr $C$DW$641, DW_AT_name("panID")
    7781                            .dwattr $C$DW$641, DW_AT_TI_symbol_name("panID")
    7782                            .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7783                            .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    7784                            .dwattr $C$DW$641, DW_AT_decl_file("../Application/cllc.c")
    7785                            .dwattr $C$DW$641, DW_AT_decl_line(0x94)
    7786                            .dwattr $C$DW$641, DW_AT_decl_column(0x0e)
    7787                    
    7788                    $C$DW$642       .dwtag  DW_TAG_member
    7789                            .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$30)
    7790                            .dwattr $C$DW$642, DW_AT_name("shortAddr")
    7791                            .dwattr $C$DW$642, DW_AT_TI_symbol_name("shortAddr")
    7792                            .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7793                            .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    7794                            .dwattr $C$DW$642, DW_AT_decl_file("../Application/cllc.c")
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:12:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C4A3E110-53AC-4E56-B60E-A1B941B7B216} PAGE  143

    7795                            .dwattr $C$DW$642, DW_AT_decl_line(0x95)
    7796                            .dwattr $C$DW$642, DW_AT_decl_column(0x0e)
    7797                    
    7798                    $C$DW$643       .dwtag  DW_TAG_member
    7799                            .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$37)
    7800                            .dwattr $C$DW$643, DW_AT_name("currentCllcState")
    7801                            .dwattr $C$DW$643, DW_AT_TI_symbol_name("currentCllcState")
    7802                            .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7803                            .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    7804                            .dwattr $C$DW$643, DW_AT_decl_file("../Application/cllc.c")
    7805                            .dwattr $C$DW$643, DW_AT_decl_line(0x96)
    7806                            .dwattr $C$DW$643, DW_AT_decl_column(0x13)
    7807                    
    7808                    $C$DW$644       .dwtag  DW_TAG_member
    7809                            .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$39)
    7810                            .dwattr $C$DW$644, DW_AT_name("currentCoordState")
    7811                            .dwattr $C$DW$644, DW_AT_TI_symbol_name("currentCoordState")
    7812                            .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7813                            .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    7814                            .dwattr $C$DW$644, DW_AT_decl_file("../Application/cllc.c")
    7815                            .dwattr $C$DW$644, DW_AT_decl_line(0x97)
    7816                            .dwattr $C$DW$644, DW_AT_decl_column(0x19)
    7817                    
    7818                            .dwattr $C$DW$T$40, DW_AT_decl_file("../Application/cllc.c")
    7819                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x92)
    7820                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x01)
    7821                            .dwendtag $C$DW$T$40
    7822                    
    7823                    $C$DW$T$430     .dwtag  DW_TAG_typedef
    7824                            .dwattr $C$DW$T$430, DW_AT_name("coordInformation_t")
    7825                            .dwattr $C$DW$T$430, DW_AT_type(*$C$DW$T$40)
    7826                            .dwattr $C$DW$T$430, DW_AT_language(DW_LANG_C)
    7827                            .dwattr $C$DW$T$430, DW_AT_decl_file("../Application/cllc.c")
    7828                            .dwattr $C$DW$T$430, DW_AT_decl_line(0x98)
    7829                            .dwattr $C$DW$T$430, DW_AT_decl_column(0x03)
    7830                    
    7831                    
    7832                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    7833                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x28)
    7834                    $C$DW$645       .dwtag  DW_TAG_member
    7835                            .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$3)
    7836                            .dwattr $C$DW$645, DW_AT_name("pNext")
    7837                            .dwattr $C$DW$645, DW_AT_TI_symbol_name("pNext")
    7838                            .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7839                            .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    7840                            .dwattr $C$DW$645, DW_AT_decl_file("../Application/cllc.c")
    7841                            .dwattr $C$DW$645, DW_AT_decl_line(0x8c)
    7842                            .dwattr $C$DW$645, DW_AT_decl_column(0x0b)
    7843                    
    7844                    $C$DW$646       .dwtag  DW_TAG_member
    7845                            .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$25)
    7846                            .dwattr $C$DW$646, DW_AT_name("panDescList")
    7847                            .dwattr $C$DW$646, DW_AT_TI_symbol_name("panDescList")
    7848                            .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7849                            .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:12:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C4A3E110-53AC-4E56-B60E-A1B941B7B216} PAGE  144

    7850                            .dwattr $C$DW$646, DW_AT_decl_file("../Application/cllc.c")
    7851                            .dwattr $C$DW$646, DW_AT_decl_line(0x8d)
    7852                            .dwattr $C$DW$646, DW_AT_decl_column(0x16)
    7853                    
    7854                            .dwattr $C$DW$T$41, DW_AT_decl_file("../Application/cllc.c")
    7855                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x8b)
    7856                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    7857                            .dwendtag $C$DW$T$41
    7858                    
    7859                    $C$DW$T$55      .dwtag  DW_TAG_pointer_type
    7860                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$41)
    7861                            .dwattr $C$DW$T$55, DW_AT_address_class(0x20)
    7862                    
    7863                    $C$DW$T$432     .dwtag  DW_TAG_typedef
    7864                            .dwattr $C$DW$T$432, DW_AT_name("panDescList_t")
    7865                            .dwattr $C$DW$T$432, DW_AT_type(*$C$DW$T$41)
    7866                            .dwattr $C$DW$T$432, DW_AT_language(DW_LANG_C)
    7867                            .dwattr $C$DW$T$432, DW_AT_decl_file("../Application/cllc.c")
    7868                            .dwattr $C$DW$T$432, DW_AT_decl_line(0x8e)
    7869                            .dwattr $C$DW$T$432, DW_AT_decl_column(0x03)
    7870                    
    7871                    $C$DW$T$433     .dwtag  DW_TAG_pointer_type
    7872                            .dwattr $C$DW$T$433, DW_AT_type(*$C$DW$T$432)
    7873                            .dwattr $C$DW$T$433, DW_AT_address_class(0x20)
    7874                    
    7875                    
    7876                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    7877                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x08)
    7878                    $C$DW$647       .dwtag  DW_TAG_member
    7879                            .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$10)
    7880                            .dwattr $C$DW$647, DW_AT_name("quot")
    7881                            .dwattr $C$DW$647, DW_AT_TI_symbol_name("quot")
    7882                            .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7883                            .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    7884                            .dwattr $C$DW$647, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    7885                            .dwattr $C$DW$647, DW_AT_decl_line(0x5c)
    7886                            .dwattr $C$DW$647, DW_AT_decl_column(0x16)
    7887                    
    7888                    $C$DW$648       .dwtag  DW_TAG_member
    7889                            .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$10)
    7890                            .dwattr $C$DW$648, DW_AT_name("rem")
    7891                            .dwattr $C$DW$648, DW_AT_TI_symbol_name("rem")
    7892                            .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7893                            .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
    7894                            .dwattr $C$DW$648, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    7895                            .dwattr $C$DW$648, DW_AT_decl_line(0x5c)
    7896                            .dwattr $C$DW$648, DW_AT_decl_column(0x1c)
    7897                    
    7898                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
    7899                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x5c)
    7900                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
    7901                            .dwendtag $C$DW$T$42
    7902                    
    7903                    $C$DW$T$434     .dwtag  DW_TAG_typedef
    7904                            .dwattr $C$DW$T$434, DW_AT_name("div_t")
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:12:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C4A3E110-53AC-4E56-B60E-A1B941B7B216} PAGE  145

    7905                            .dwattr $C$DW$T$434, DW_AT_type(*$C$DW$T$42)
    7906                            .dwattr $C$DW$T$434, DW_AT_language(DW_LANG_C)
    7907                            .dwattr $C$DW$T$434, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    7908                            .dwattr $C$DW$T$434, DW_AT_decl_line(0x5c)
    7909                            .dwattr $C$DW$T$434, DW_AT_decl_column(0x23)
    7910                    
    7911                    
    7912                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    7913                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x08)
    7914                    $C$DW$649       .dwtag  DW_TAG_member
    7915                            .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$10)
    7916                            .dwattr $C$DW$649, DW_AT_name("quot")
    7917                            .dwattr $C$DW$649, DW_AT_TI_symbol_name("quot")
    7918                            .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7919                            .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    7920                            .dwattr $C$DW$649, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    7921                            .dwattr $C$DW$649, DW_AT_decl_line(0x5e)
    7922                            .dwattr $C$DW$649, DW_AT_decl_column(0x16)
    7923                    
    7924                    $C$DW$650       .dwtag  DW_TAG_member
    7925                            .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$10)
    7926                            .dwattr $C$DW$650, DW_AT_name("rem")
    7927                            .dwattr $C$DW$650, DW_AT_TI_symbol_name("rem")
    7928                            .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7929                            .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    7930                            .dwattr $C$DW$650, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    7931                            .dwattr $C$DW$650, DW_AT_decl_line(0x5e)
    7932                            .dwattr $C$DW$650, DW_AT_decl_column(0x1c)
    7933                    
    7934                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
    7935                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x5e)
    7936                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x10)
    7937                            .dwendtag $C$DW$T$43
    7938                    
    7939                    $C$DW$T$435     .dwtag  DW_TAG_typedef
    7940                            .dwattr $C$DW$T$435, DW_AT_name("ldiv_t")
    7941                            .dwattr $C$DW$T$435, DW_AT_type(*$C$DW$T$43)
    7942                            .dwattr $C$DW$T$435, DW_AT_language(DW_LANG_C)
    7943                            .dwattr $C$DW$T$435, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    7944                            .dwattr $C$DW$T$435, DW_AT_decl_line(0x5e)
    7945                            .dwattr $C$DW$T$435, DW_AT_decl_column(0x23)
    7946                    
    7947                    
    7948                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    7949                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x10)
    7950                    $C$DW$651       .dwtag  DW_TAG_member
    7951                            .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$14)
    7952                            .dwattr $C$DW$651, DW_AT_name("quot")
    7953                            .dwattr $C$DW$651, DW_AT_TI_symbol_name("quot")
    7954                            .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7955                            .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    7956                            .dwattr $C$DW$651, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    7957                            .dwattr $C$DW$651, DW_AT_decl_line(0x61)
    7958                            .dwattr $C$DW$651, DW_AT_decl_column(0x1c)
    7959                    
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:12:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C4A3E110-53AC-4E56-B60E-A1B941B7B216} PAGE  146

    7960                    $C$DW$652       .dwtag  DW_TAG_member
    7961                            .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$14)
    7962                            .dwattr $C$DW$652, DW_AT_name("rem")
    7963                            .dwattr $C$DW$652, DW_AT_TI_symbol_name("rem")
    7964                            .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7965                            .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    7966                            .dwattr $C$DW$652, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    7967                            .dwattr $C$DW$652, DW_AT_decl_line(0x61)
    7968                            .dwattr $C$DW$652, DW_AT_decl_column(0x22)
    7969                    
    7970                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
    7971                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x61)
    7972                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    7973                            .dwendtag $C$DW$T$44
    7974                    
    7975                    $C$DW$T$436     .dwtag  DW_TAG_typedef
    7976                            .dwattr $C$DW$T$436, DW_AT_name("lldiv_t")
    7977                            .dwattr $C$DW$T$436, DW_AT_type(*$C$DW$T$44)
    7978                            .dwattr $C$DW$T$436, DW_AT_language(DW_LANG_C)
    7979                            .dwattr $C$DW$T$436, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    7980                            .dwattr $C$DW$T$436, DW_AT_decl_line(0x61)
    7981                            .dwattr $C$DW$T$436, DW_AT_decl_column(0x29)
    7982                    
    7983                    
    7984                    $C$DW$T$47      .dwtag  DW_TAG_union_type
    7985                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x08)
    7986                    $C$DW$653       .dwtag  DW_TAG_member
    7987                            .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$30)
    7988                            .dwattr $C$DW$653, DW_AT_name("shortAddr")
    7989                            .dwattr $C$DW$653, DW_AT_TI_symbol_name("shortAddr")
    7990                            .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7991                            .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    7992                            .dwattr $C$DW$653, DW_AT_decl_file("..\Application\api_mac.h")
    7993                            .dwattr $C$DW$653, DW_AT_decl_line(0x4a4)
    7994                            .dwattr $C$DW$653, DW_AT_decl_column(0x12)
    7995                    
    7996                    $C$DW$654       .dwtag  DW_TAG_member
    7997                            .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$46)
    7998                            .dwattr $C$DW$654, DW_AT_name("extAddr")
    7999                            .dwattr $C$DW$654, DW_AT_TI_symbol_name("extAddr")
    8000                            .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8001                            .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    8002                            .dwattr $C$DW$654, DW_AT_decl_file("..\Application\api_mac.h")
    8003                            .dwattr $C$DW$654, DW_AT_decl_line(0x4a6)
    8004                            .dwattr $C$DW$654, DW_AT_decl_column(0x1b)
    8005                    
    8006                            .dwattr $C$DW$T$47, DW_AT_decl_file("..\Application\api_mac.h")
    8007                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x4a2)
    8008                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x05)
    8009                            .dwendtag $C$DW$T$47
    8010                    
    8011                    
    8012                    $C$DW$T$50      .dwtag  DW_TAG_union_type
    8013                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x18)
    8014                    $C$DW$655       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:12:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C4A3E110-53AC-4E56-B60E-A1B941B7B216} PAGE  147

    8015                            .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$48)
    8016                            .dwattr $C$DW$655, DW_AT_name("beacon")
    8017                            .dwattr $C$DW$655, DW_AT_TI_symbol_name("beacon")
    8018                            .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8019                            .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    8020                            .dwattr $C$DW$655, DW_AT_decl_file("..\Application\api_mac.h")
    8021                            .dwattr $C$DW$655, DW_AT_decl_line(0x854)
    8022                            .dwattr $C$DW$655, DW_AT_decl_column(0x1d)
    8023                    
    8024                    $C$DW$656       .dwtag  DW_TAG_member
    8025                            .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$49)
    8026                            .dwattr $C$DW$656, DW_AT_name("eBeacon")
    8027                            .dwattr $C$DW$656, DW_AT_TI_symbol_name("eBeacon")
    8028                            .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8029                            .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    8030                            .dwattr $C$DW$656, DW_AT_decl_file("..\Application\api_mac.h")
    8031                            .dwattr $C$DW$656, DW_AT_decl_line(0x856)
    8032                            .dwattr $C$DW$656, DW_AT_decl_column(0x1e)
    8033                    
    8034                            .dwattr $C$DW$T$50, DW_AT_decl_file("..\Application\api_mac.h")
    8035                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x852)
    8036                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x05)
    8037                            .dwendtag $C$DW$T$50
    8038                    
    8039                    
    8040                    $C$DW$T$53      .dwtag  DW_TAG_union_type
    8041                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x04)
    8042                    $C$DW$657       .dwtag  DW_TAG_member
    8043                            .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$51)
    8044                            .dwattr $C$DW$657, DW_AT_name("pEnergyDetect")
    8045                            .dwattr $C$DW$657, DW_AT_TI_symbol_name("pEnergyDetect")
    8046                            .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8047                            .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    8048                            .dwattr $C$DW$657, DW_AT_decl_file("..\Application\api_mac.h")
    8049                            .dwattr $C$DW$657, DW_AT_decl_line(0x876)
    8050                            .dwattr $C$DW$657, DW_AT_decl_column(0x12)
    8051                    
    8052                    $C$DW$658       .dwtag  DW_TAG_member
    8053                            .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$52)
    8054                            .dwattr $C$DW$658, DW_AT_name("pPanDescriptor")
    8055                            .dwattr $C$DW$658, DW_AT_TI_symbol_name("pPanDescriptor")
    8056                            .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8057                            .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    8058                            .dwattr $C$DW$658, DW_AT_decl_file("..\Application\api_mac.h")
    8059                            .dwattr $C$DW$658, DW_AT_decl_line(0x878)
    8060                            .dwattr $C$DW$658, DW_AT_decl_column(0x1b)
    8061                    
    8062                            .dwattr $C$DW$T$53, DW_AT_decl_file("..\Application\api_mac.h")
    8063                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x874)
    8064                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x05)
    8065                            .dwendtag $C$DW$T$53
    8066                    
    8067                    
    8068                    $C$DW$T$60      .dwtag  DW_TAG_structure_type
    8069                            .dwattr $C$DW$T$60, DW_AT_name(".ggroup1")
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:12:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C4A3E110-53AC-4E56-B60E-A1B941B7B216} PAGE  148

    8070                            .dwattr $C$DW$T$60, DW_AT_byte_size(0x2fc)
    8071                    $C$DW$659       .dwtag  DW_TAG_member
    8072                            .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$6)
    8073                            .dwattr $C$DW$659, DW_AT_name("Cllc_numOfDevices")
    8074                            .dwattr $C$DW$659, DW_AT_TI_symbol_name("Cllc_numOfDevices")
    8075                            .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8076                            .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    8077                    
    8078                    $C$DW$660       .dwtag  DW_TAG_member
    8079                            .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$6)
    8080                            .dwattr $C$DW$660, DW_AT_name("optAsyncFlag")
    8081                            .dwattr $C$DW$660, DW_AT_TI_symbol_name("optAsyncFlag")
    8082                            .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8083                            .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    8084                    
    8085                    $C$DW$661       .dwtag  DW_TAG_member
    8086                            .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$54)
    8087                            .dwattr $C$DW$661, DW_AT_name("macSecurity")
    8088                            .dwattr $C$DW$661, DW_AT_TI_symbol_name("macSecurity")
    8089                            .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8090                            .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    8091                    
    8092                    $C$DW$662       .dwtag  DW_TAG_member
    8093                            .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$9)
    8094                            .dwattr $C$DW$662, DW_AT_name("Cllc_events")
    8095                            .dwattr $C$DW$662, DW_AT_TI_symbol_name("Cllc_events")
    8096                            .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8097                            .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    8098                    
    8099                    $C$DW$663       .dwtag  DW_TAG_member
    8100                            .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$55)
    8101                            .dwattr $C$DW$663, DW_AT_name("pPANDesclist")
    8102                            .dwattr $C$DW$663, DW_AT_TI_symbol_name("pPANDesclist")
    8103                            .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8104                            .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    8105                    
    8106                    $C$DW$664       .dwtag  DW_TAG_member
    8107                            .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$56)
    8108                            .dwattr $C$DW$664, DW_AT_name("pCllcCallbacksCopy")
    8109                            .dwattr $C$DW$664, DW_AT_TI_symbol_name("pCllcCallbacksCopy")
    8110                            .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8111                            .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    8112                    
    8113                    $C$DW$665       .dwtag  DW_TAG_member
    8114                            .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$11)
    8115                            .dwattr $C$DW$665, DW_AT_name("fhPAtrickleTime")
    8116                            .dwattr $C$DW$665, DW_AT_TI_symbol_name("fhPAtrickleTime")
    8117                            .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8118                            .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    8119                    
    8120                    $C$DW$666       .dwtag  DW_TAG_member
    8121                            .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$11)
    8122                            .dwattr $C$DW$666, DW_AT_name("fhPCtrickleTime")
    8123                            .dwattr $C$DW$666, DW_AT_TI_symbol_name("fhPCtrickleTime")
    8124                            .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:12:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C4A3E110-53AC-4E56-B60E-A1B941B7B216} PAGE  149

    8125                            .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    8126                    
    8127                    $C$DW$667       .dwtag  DW_TAG_member
    8128                            .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$57)
    8129                            .dwattr $C$DW$667, DW_AT_name("pItem")
    8130                            .dwattr $C$DW$667, DW_AT_TI_symbol_name("pItem$3")
    8131                            .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8132                            .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    8133                    
    8134                    $C$DW$668       .dwtag  DW_TAG_member
    8135                            .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$40)
    8136                            .dwattr $C$DW$668, DW_AT_name("coordInfoBlock")
    8137                            .dwattr $C$DW$668, DW_AT_TI_symbol_name("coordInfoBlock")
    8138                            .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8139                            .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    8140                    
    8141                    $C$DW$669       .dwtag  DW_TAG_member
    8142                            .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$58)
    8143                            .dwattr $C$DW$669, DW_AT_name("optPAChMask")
    8144                            .dwattr $C$DW$669, DW_AT_TI_symbol_name("optPAChMask")
    8145                            .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    8146                            .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    8147                    
    8148                    $C$DW$670       .dwtag  DW_TAG_member
    8149                            .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$58)
    8150                            .dwattr $C$DW$670, DW_AT_name("optPCChMask")
    8151                            .dwattr $C$DW$670, DW_AT_TI_symbol_name("optPCChMask")
    8152                            .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    8153                            .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    8154                    
    8155                    $C$DW$671       .dwtag  DW_TAG_member
    8156                            .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$35)
    8157                            .dwattr $C$DW$671, DW_AT_name("Cllc_statistics")
    8158                            .dwattr $C$DW$671, DW_AT_TI_symbol_name("Cllc_statistics")
    8159                            .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    8160                            .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    8161                    
    8162                    $C$DW$672       .dwtag  DW_TAG_member
    8163                            .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$203)
    8164                            .dwattr $C$DW$672, DW_AT_name("macCallbacksCopy")
    8165                            .dwattr $C$DW$672, DW_AT_TI_symbol_name("macCallbacksCopy")
    8166                            .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    8167                            .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    8168                    
    8169                    $C$DW$673       .dwtag  DW_TAG_member
    8170                            .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$59)
    8171                            .dwattr $C$DW$673, DW_AT_name("Cllc_associatedDevList")
    8172                            .dwattr $C$DW$673, DW_AT_TI_symbol_name("Cllc_associatedDevList")
    8173                            .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    8174                            .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    8175                    
    8176                            .dwendtag $C$DW$T$60
    8177                    
    8178                    
    8179                    $C$DW$T$70      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:12:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C4A3E110-53AC-4E56-B60E-A1B941B7B216} PAGE  150

    8180                            .dwattr $C$DW$T$70, DW_AT_name(".ggroup2")
    8181                            .dwattr $C$DW$T$70, DW_AT_byte_size(0xb4)
    8182                    $C$DW$674       .dwtag  DW_TAG_member
    8183                            .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$61)
    8184                            .dwattr $C$DW$674, DW_AT_name("securityLevelEntry")
    8185                            .dwattr $C$DW$674, DW_AT_TI_symbol_name("securityLevelEntry")
    8186                            .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8187                            .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    8188                    
    8189                    $C$DW$675       .dwtag  DW_TAG_member
    8190                            .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$62)
    8191                            .dwattr $C$DW$675, DW_AT_name("Cllc_keySource")
    8192                            .dwattr $C$DW$675, DW_AT_TI_symbol_name("Cllc_keySource")
    8193                            .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8194                            .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    8195                    
    8196                    $C$DW$676       .dwtag  DW_TAG_member
    8197                            .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$62)
    8198                            .dwattr $C$DW$676, DW_AT_name("fhGtkHash0")
    8199                            .dwattr $C$DW$676, DW_AT_TI_symbol_name("fhGtkHash0")
    8200                            .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8201                            .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    8202                    
    8203                    $C$DW$677       .dwtag  DW_TAG_member
    8204                            .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$62)
    8205                            .dwattr $C$DW$677, DW_AT_name("fhGtkHash1")
    8206                            .dwattr $C$DW$677, DW_AT_TI_symbol_name("fhGtkHash1")
    8207                            .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    8208                            .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    8209                    
    8210                    $C$DW$678       .dwtag  DW_TAG_member
    8211                            .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$62)
    8212                            .dwattr $C$DW$678, DW_AT_name("fhGtkHash2")
    8213                            .dwattr $C$DW$678, DW_AT_TI_symbol_name("fhGtkHash2")
    8214                            .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    8215                            .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    8216                    
    8217                    $C$DW$679       .dwtag  DW_TAG_member
    8218                            .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$62)
    8219                            .dwattr $C$DW$679, DW_AT_name("fhGtkHash3")
    8220                            .dwattr $C$DW$679, DW_AT_TI_symbol_name("fhGtkHash3")
    8221                            .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    8222                            .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    8223                    
    8224                    $C$DW$680       .dwtag  DW_TAG_member
    8225                            .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$64)
    8226                            .dwattr $C$DW$680, DW_AT_name("keyIdLookupList")
    8227                            .dwattr $C$DW$680, DW_AT_TI_symbol_name("keyIdLookupList")
    8228                            .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    8229                            .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    8230                    
    8231                    $C$DW$681       .dwtag  DW_TAG_member
    8232                            .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$65)
    8233                            .dwattr $C$DW$681, DW_AT_name("$P$T1$2")
    8234                            .dwattr $C$DW$681, DW_AT_TI_symbol_name("$P$T1$2")
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:12:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C4A3E110-53AC-4E56-B60E-A1B941B7B216} PAGE  151

    8235                            .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    8236                            .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    8237                    
    8238                    $C$DW$682       .dwtag  DW_TAG_member
    8239                            .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$66)
    8240                            .dwattr $C$DW$682, DW_AT_name("chanMask")
    8241                            .dwattr $C$DW$682, DW_AT_TI_symbol_name("chanMask")
    8242                            .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    8243                            .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    8244                    
    8245                    $C$DW$683       .dwtag  DW_TAG_member
    8246                            .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$66)
    8247                            .dwattr $C$DW$683, DW_AT_name("$P$T2$4")
    8248                            .dwattr $C$DW$683, DW_AT_TI_symbol_name("$P$T2$4")
    8249                            .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x57]
    8250                            .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    8251                    
    8252                    $C$DW$684       .dwtag  DW_TAG_member
    8253                            .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$67)
    8254                            .dwattr $C$DW$684, DW_AT_name("fhNetname")
    8255                            .dwattr $C$DW$684, DW_AT_TI_symbol_name("fhNetname")
    8256                            .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    8257                            .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    8258                    
    8259                    $C$DW$685       .dwtag  DW_TAG_member
    8260                            .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$69)
    8261                            .dwattr $C$DW$685, DW_AT_name("keyTable")
    8262                            .dwattr $C$DW$685, DW_AT_TI_symbol_name("keyTable")
    8263                            .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    8264                            .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    8265                    
    8266                            .dwendtag $C$DW$T$70
    8267                    
    8268                    
    8269                    $C$DW$T$71      .dwtag  DW_TAG_structure_type
    8270                            .dwattr $C$DW$T$71, DW_AT_name("S3_1")
    8271                            .dwattr $C$DW$T$71, DW_AT_declaration
    8272                            .dwendtag $C$DW$T$71
    8273                    
    8274                    
    8275                    $C$DW$T$72      .dwtag  DW_TAG_union_type
    8276                            .dwattr $C$DW$T$72, DW_AT_name("U3_0")
    8277                            .dwattr $C$DW$T$72, DW_AT_declaration
    8278                            .dwendtag $C$DW$T$72
    8279                    
    8280                    
    8281                    $C$DW$T$88      .dwtag  DW_TAG_structure_type
    8282                            .dwattr $C$DW$T$88, DW_AT_name("_Cllc_callbacks_t")
    8283                            .dwattr $C$DW$T$88, DW_AT_byte_size(0x0c)
    8284                    $C$DW$686       .dwtag  DW_TAG_member
    8285                            .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$77)
    8286                            .dwattr $C$DW$686, DW_AT_name("pStartedCb")
    8287                            .dwattr $C$DW$686, DW_AT_TI_symbol_name("pStartedCb")
    8288                            .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8289                            .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:12:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C4A3E110-53AC-4E56-B60E-A1B941B7B216} PAGE  152

    8290                            .dwattr $C$DW$686, DW_AT_decl_file("..\Application\cllc.h")
    8291                            .dwattr $C$DW$686, DW_AT_decl_line(0xbf)
    8292                            .dwattr $C$DW$686, DW_AT_decl_column(0x16)
    8293                    
    8294                    $C$DW$687       .dwtag  DW_TAG_member
    8295                            .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$84)
    8296                            .dwattr $C$DW$687, DW_AT_name("pDeviceJoiningCb")
    8297                            .dwattr $C$DW$687, DW_AT_TI_symbol_name("pDeviceJoiningCb")
    8298                            .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8299                            .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    8300                            .dwattr $C$DW$687, DW_AT_decl_file("..\Application\cllc.h")
    8301                            .dwattr $C$DW$687, DW_AT_decl_line(0xc1)
    8302                            .dwattr $C$DW$687, DW_AT_decl_column(0x1c)
    8303                    
    8304                    $C$DW$688       .dwtag  DW_TAG_member
    8305                            .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$87)
    8306                            .dwattr $C$DW$688, DW_AT_name("pStateChangeCb")
    8307                            .dwattr $C$DW$688, DW_AT_TI_symbol_name("pStateChangeCb")
    8308                            .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8309                            .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    8310                            .dwattr $C$DW$688, DW_AT_decl_file("..\Application\cllc.h")
    8311                            .dwattr $C$DW$688, DW_AT_decl_line(0xc3)
    8312                            .dwattr $C$DW$688, DW_AT_decl_column(0x1b)
    8313                    
    8314                            .dwattr $C$DW$T$88, DW_AT_decl_file("..\Application\cllc.h")
    8315                            .dwattr $C$DW$T$88, DW_AT_decl_line(0xbc)
    8316                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x10)
    8317                            .dwendtag $C$DW$T$88
    8318                    
    8319                    $C$DW$T$441     .dwtag  DW_TAG_typedef
    8320                            .dwattr $C$DW$T$441, DW_AT_name("Cllc_callbacks_t")
    8321                            .dwattr $C$DW$T$441, DW_AT_type(*$C$DW$T$88)
    8322                            .dwattr $C$DW$T$441, DW_AT_language(DW_LANG_C)
    8323                            .dwattr $C$DW$T$441, DW_AT_decl_file("..\Application\cllc.h")
    8324                            .dwattr $C$DW$T$441, DW_AT_decl_line(0xc4)
    8325                            .dwattr $C$DW$T$441, DW_AT_decl_column(0x03)
    8326                    
    8327                    $C$DW$T$442     .dwtag  DW_TAG_pointer_type
    8328                            .dwattr $C$DW$T$442, DW_AT_type(*$C$DW$T$441)
    8329                            .dwattr $C$DW$T$442, DW_AT_address_class(0x20)
    8330                    
    8331                    $C$DW$T$443     .dwtag  DW_TAG_const_type
    8332                            .dwattr $C$DW$T$443, DW_AT_type(*$C$DW$T$442)
    8333                    
    8334                    $C$DW$T$56      .dwtag  DW_TAG_pointer_type
    8335                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$88)
    8336                            .dwattr $C$DW$T$56, DW_AT_address_class(0x20)
    8337                    
    8338                    
    8339                    $C$DW$T$91      .dwtag  DW_TAG_structure_type
    8340                            .dwattr $C$DW$T$91, DW_AT_name("_Smsgs_broadcastcmdmsg_t")
    8341                            .dwattr $C$DW$T$91, DW_AT_byte_size(0x04)
    8342                    $C$DW$689       .dwtag  DW_TAG_member
    8343                            .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$90)
    8344                            .dwattr $C$DW$689, DW_AT_name("cmdId")
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:12:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C4A3E110-53AC-4E56-B60E-A1B941B7B216} PAGE  153

    8345                            .dwattr $C$DW$689, DW_AT_TI_symbol_name("cmdId")
    8346                            .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8347                            .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    8348                            .dwattr $C$DW$689, DW_AT_decl_file("..\Application\smsgs.h")
    8349                            .dwattr $C$DW$689, DW_AT_decl_line(0x21f)
    8350                            .dwattr $C$DW$689, DW_AT_decl_column(0x14)
    8351                    
    8352                    $C$DW$690       .dwtag  DW_TAG_member
    8353                            .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$30)
    8354                            .dwattr $C$DW$690, DW_AT_name("broadcastMsgId")
    8355                            .dwattr $C$DW$690, DW_AT_TI_symbol_name("broadcastMsgId")
    8356                            .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8357                            .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    8358                            .dwattr $C$DW$690, DW_AT_decl_file("..\Application\smsgs.h")
    8359                            .dwattr $C$DW$690, DW_AT_decl_line(0x220)
    8360                            .dwattr $C$DW$690, DW_AT_decl_column(0x0e)
    8361                    
    8362                            .dwattr $C$DW$T$91, DW_AT_decl_file("..\Application\smsgs.h")
    8363                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x21c)
    8364                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x10)
    8365                            .dwendtag $C$DW$T$91
    8366                    
    8367                    $C$DW$T$446     .dwtag  DW_TAG_typedef
    8368                            .dwattr $C$DW$T$446, DW_AT_name("Smsgs_broadcastcmdmsg_t")
    8369                            .dwattr $C$DW$T$446, DW_AT_type(*$C$DW$T$91)
    8370                            .dwattr $C$DW$T$446, DW_AT_language(DW_LANG_C)
    8371                            .dwattr $C$DW$T$446, DW_AT_decl_file("..\Application\smsgs.h")
    8372                            .dwattr $C$DW$T$446, DW_AT_decl_line(0x221)
    8373                            .dwattr $C$DW$T$446, DW_AT_decl_column(0x02)
    8374                    
    8375                    
    8376                    $C$DW$T$92      .dwtag  DW_TAG_structure_type
    8377                            .dwattr $C$DW$T$92, DW_AT_name("_Smsgs_configreqmsg_t")
    8378                            .dwattr $C$DW$T$92, DW_AT_byte_size(0x0c)
    8379                    $C$DW$691       .dwtag  DW_TAG_member
    8380                            .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$90)
    8381                            .dwattr $C$DW$691, DW_AT_name("cmdId")
    8382                            .dwattr $C$DW$691, DW_AT_TI_symbol_name("cmdId")
    8383                            .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8384                            .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    8385                            .dwattr $C$DW$691, DW_AT_decl_file("..\Application\smsgs.h")
    8386                            .dwattr $C$DW$691, DW_AT_decl_line(0x11e)
    8387                            .dwattr $C$DW$691, DW_AT_decl_column(0x14)
    8388                    
    8389                    $C$DW$692       .dwtag  DW_TAG_member
    8390                            .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$30)
    8391                            .dwattr $C$DW$692, DW_AT_name("frameControl")
    8392                            .dwattr $C$DW$692, DW_AT_TI_symbol_name("frameControl")
    8393                            .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8394                            .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    8395                            .dwattr $C$DW$692, DW_AT_decl_file("..\Application\smsgs.h")
    8396                            .dwattr $C$DW$692, DW_AT_decl_line(0x120)
    8397                            .dwattr $C$DW$692, DW_AT_decl_column(0x0e)
    8398                    
    8399                    $C$DW$693       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:12:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C4A3E110-53AC-4E56-B60E-A1B941B7B216} PAGE  154

    8400                            .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$34)
    8401                            .dwattr $C$DW$693, DW_AT_name("reportingInterval")
    8402                            .dwattr $C$DW$693, DW_AT_TI_symbol_name("reportingInterval")
    8403                            .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8404                            .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    8405                            .dwattr $C$DW$693, DW_AT_decl_file("..\Application\smsgs.h")
    8406                            .dwattr $C$DW$693, DW_AT_decl_line(0x122)
    8407                            .dwattr $C$DW$693, DW_AT_decl_column(0x0e)
    8408                    
    8409                    $C$DW$694       .dwtag  DW_TAG_member
    8410                            .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$34)
    8411                            .dwattr $C$DW$694, DW_AT_name("pollingInterval")
    8412                            .dwattr $C$DW$694, DW_AT_TI_symbol_name("pollingInterval")
    8413                            .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8414                            .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    8415                            .dwattr $C$DW$694, DW_AT_decl_file("..\Application\smsgs.h")
    8416                            .dwattr $C$DW$694, DW_AT_decl_line(0x124)
    8417                            .dwattr $C$DW$694, DW_AT_decl_column(0x0e)
    8418                    
    8419                            .dwattr $C$DW$T$92, DW_AT_decl_file("..\Application\smsgs.h")
    8420                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x11b)
    8421                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x10)
    8422                            .dwendtag $C$DW$T$92
    8423                    
    8424                    $C$DW$T$447     .dwtag  DW_TAG_typedef
    8425                            .dwattr $C$DW$T$447, DW_AT_name("Smsgs_configReqMsg_t")
    8426                            .dwattr $C$DW$T$447, DW_AT_type(*$C$DW$T$92)
    8427                            .dwattr $C$DW$T$447, DW_AT_language(DW_LANG_C)
    8428                            .dwattr $C$DW$T$447, DW_AT_decl_file("..\Application\smsgs.h")
    8429                            .dwattr $C$DW$T$447, DW_AT_decl_line(0x125)
    8430                            .dwattr $C$DW$T$447, DW_AT_decl_column(0x03)
    8431                    
    8432                    
    8433                    $C$DW$T$95      .dwtag  DW_TAG_structure_type
    8434                            .dwattr $C$DW$T$95, DW_AT_name("_Smsgs_configrspmsg_t")
    8435                            .dwattr $C$DW$T$95, DW_AT_byte_size(0x0c)
    8436                    $C$DW$695       .dwtag  DW_TAG_member
    8437                            .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$90)
    8438                            .dwattr $C$DW$695, DW_AT_name("cmdId")
    8439                            .dwattr $C$DW$695, DW_AT_TI_symbol_name("cmdId")
    8440                            .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8441                            .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    8442                            .dwattr $C$DW$695, DW_AT_decl_file("..\Application\smsgs.h")
    8443                            .dwattr $C$DW$695, DW_AT_decl_line(0x12e)
    8444                            .dwattr $C$DW$695, DW_AT_decl_column(0x14)
    8445                    
    8446                    $C$DW$696       .dwtag  DW_TAG_member
    8447                            .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$94)
    8448                            .dwattr $C$DW$696, DW_AT_name("status")
    8449                            .dwattr $C$DW$696, DW_AT_TI_symbol_name("status")
    8450                            .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8451                            .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    8452                            .dwattr $C$DW$696, DW_AT_decl_file("..\Application\smsgs.h")
    8453                            .dwattr $C$DW$696, DW_AT_decl_line(0x130)
    8454                            .dwattr $C$DW$696, DW_AT_decl_column(0x1a)
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:12:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C4A3E110-53AC-4E56-B60E-A1B941B7B216} PAGE  155

    8455                    
    8456                    $C$DW$697       .dwtag  DW_TAG_member
    8457                            .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$30)
    8458                            .dwattr $C$DW$697, DW_AT_name("frameControl")
    8459                            .dwattr $C$DW$697, DW_AT_TI_symbol_name("frameControl")
    8460                            .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8461                            .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    8462                            .dwattr $C$DW$697, DW_AT_decl_file("..\Application\smsgs.h")
    8463                            .dwattr $C$DW$697, DW_AT_decl_line(0x132)
    8464                            .dwattr $C$DW$697, DW_AT_decl_column(0x0e)
    8465                    
    8466                    $C$DW$698       .dwtag  DW_TAG_member
    8467                            .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$34)
    8468                            .dwattr $C$DW$698, DW_AT_name("reportingInterval")
    8469                            .dwattr $C$DW$698, DW_AT_TI_symbol_name("reportingInterval")
    8470                            .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8471                            .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    8472                            .dwattr $C$DW$698, DW_AT_decl_file("..\Application\smsgs.h")
    8473                            .dwattr $C$DW$698, DW_AT_decl_line(0x134)
    8474                            .dwattr $C$DW$698, DW_AT_decl_column(0x0e)
    8475                    
    8476                    $C$DW$699       .dwtag  DW_TAG_member
    8477                            .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$34)
    8478                            .dwattr $C$DW$699, DW_AT_name("pollingInterval")
    8479                            .dwattr $C$DW$699, DW_AT_TI_symbol_name("pollingInterval")
    8480                            .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8481                            .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    8482                            .dwattr $C$DW$699, DW_AT_decl_file("..\Application\smsgs.h")
    8483                            .dwattr $C$DW$699, DW_AT_decl_line(0x136)
    8484                            .dwattr $C$DW$699, DW_AT_decl_column(0x0e)
    8485                    
    8486                            .dwattr $C$DW$T$95, DW_AT_decl_file("..\Application\smsgs.h")
    8487                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x12b)
    8488                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x10)
    8489                            .dwendtag $C$DW$T$95
    8490                    
    8491                    $C$DW$T$448     .dwtag  DW_TAG_typedef
    8492                            .dwattr $C$DW$T$448, DW_AT_name("Smsgs_configRspMsg_t")
    8493                            .dwattr $C$DW$T$448, DW_AT_type(*$C$DW$T$95)
    8494                            .dwattr $C$DW$T$448, DW_AT_language(DW_LANG_C)
    8495                            .dwattr $C$DW$T$448, DW_AT_decl_file("..\Application\smsgs.h")
    8496                            .dwattr $C$DW$T$448, DW_AT_decl_line(0x137)
    8497                            .dwattr $C$DW$T$448, DW_AT_decl_column(0x03)
    8498                    
    8499                    
    8500                    $C$DW$T$96      .dwtag  DW_TAG_structure_type
    8501                            .dwattr $C$DW$T$96, DW_AT_name("_Smsgs_configsettingsfield_t")
    8502                            .dwattr $C$DW$T$96, DW_AT_byte_size(0x08)
    8503                    $C$DW$700       .dwtag  DW_TAG_member
    8504                            .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$34)
    8505                            .dwattr $C$DW$700, DW_AT_name("reportingInterval")
    8506                            .dwattr $C$DW$700, DW_AT_TI_symbol_name("reportingInterval")
    8507                            .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8508                            .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    8509                            .dwattr $C$DW$700, DW_AT_decl_file("..\Application\smsgs.h")
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:12:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C4A3E110-53AC-4E56-B60E-A1B941B7B216} PAGE  156

    8510                            .dwattr $C$DW$700, DW_AT_decl_line(0x1ea)
    8511                            .dwattr $C$DW$700, DW_AT_decl_column(0x0e)
    8512                    
    8513                    $C$DW$701       .dwtag  DW_TAG_member
    8514                            .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$34)
    8515                            .dwattr $C$DW$701, DW_AT_name("pollingInterval")
    8516                            .dwattr $C$DW$701, DW_AT_TI_symbol_name("pollingInterval")
    8517                            .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8518                            .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    8519                            .dwattr $C$DW$701, DW_AT_decl_file("..\Application\smsgs.h")
    8520                            .dwattr $C$DW$701, DW_AT_decl_line(0x1f0)
    8521                            .dwattr $C$DW$701, DW_AT_decl_column(0x0e)
    8522                    
    8523                            .dwattr $C$DW$T$96, DW_AT_decl_file("..\Application\smsgs.h")
    8524                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x1e4)
    8525                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x10)
    8526                            .dwendtag $C$DW$T$96
    8527                    
    8528                    $C$DW$T$105     .dwtag  DW_TAG_typedef
    8529                            .dwattr $C$DW$T$105, DW_AT_name("Smsgs_configSettingsField_t")
    8530                            .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$96)
    8531                            .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    8532                            .dwattr $C$DW$T$105, DW_AT_decl_file("..\Application\smsgs.h")
    8533                            .dwattr $C$DW$T$105, DW_AT_decl_line(0x1f1)
    8534                            .dwattr $C$DW$T$105, DW_AT_decl_column(0x03)
    8535                    
    8536                    
    8537                    $C$DW$T$97      .dwtag  DW_TAG_structure_type
    8538                            .dwattr $C$DW$T$97, DW_AT_name("_Smsgs_humiditysensorfield_t")
    8539                            .dwattr $C$DW$T$97, DW_AT_byte_size(0x04)
    8540                    $C$DW$702       .dwtag  DW_TAG_member
    8541                            .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$30)
    8542                            .dwattr $C$DW$702, DW_AT_name("temp")
    8543                            .dwattr $C$DW$702, DW_AT_TI_symbol_name("temp")
    8544                            .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8545                            .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    8546                            .dwattr $C$DW$702, DW_AT_decl_file("..\Application\smsgs.h")
    8547                            .dwattr $C$DW$702, DW_AT_decl_line(0x18c)
    8548                            .dwattr $C$DW$702, DW_AT_decl_column(0x0e)
    8549                    
    8550                    $C$DW$703       .dwtag  DW_TAG_member
    8551                            .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$30)
    8552                            .dwattr $C$DW$703, DW_AT_name("humidity")
    8553                            .dwattr $C$DW$703, DW_AT_TI_symbol_name("humidity")
    8554                            .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8555                            .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    8556                            .dwattr $C$DW$703, DW_AT_decl_file("..\Application\smsgs.h")
    8557                            .dwattr $C$DW$703, DW_AT_decl_line(0x18e)
    8558                            .dwattr $C$DW$703, DW_AT_decl_column(0x0e)
    8559                    
    8560                            .dwattr $C$DW$T$97, DW_AT_decl_file("..\Application\smsgs.h")
    8561                            .dwattr $C$DW$T$97, DW_AT_decl_line(0x189)
    8562                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x10)
    8563                            .dwendtag $C$DW$T$97
    8564                    
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:12:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C4A3E110-53AC-4E56-B60E-A1B941B7B216} PAGE  157

    8565                    $C$DW$T$103     .dwtag  DW_TAG_typedef
    8566                            .dwattr $C$DW$T$103, DW_AT_name("Smsgs_humiditySensorField_t")
    8567                            .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$97)
    8568                            .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    8569                            .dwattr $C$DW$T$103, DW_AT_decl_file("..\Application\smsgs.h")
    8570                            .dwattr $C$DW$T$103, DW_AT_decl_line(0x18f)
    8571                            .dwattr $C$DW$T$103, DW_AT_decl_column(0x03)
    8572                    
    8573                    
    8574                    $C$DW$T$98      .dwtag  DW_TAG_structure_type
    8575                            .dwattr $C$DW$T$98, DW_AT_name("_Smsgs_laserHitmsg_t")
    8576                            .dwattr $C$DW$T$98, DW_AT_byte_size(0x02)
    8577                    $C$DW$704       .dwtag  DW_TAG_member
    8578                            .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$90)
    8579                            .dwattr $C$DW$704, DW_AT_name("cmdId")
    8580                            .dwattr $C$DW$704, DW_AT_TI_symbol_name("cmdId")
    8581                            .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8582                            .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    8583                            .dwattr $C$DW$704, DW_AT_decl_file("..\Application\smsgs.h")
    8584                            .dwattr $C$DW$704, DW_AT_decl_line(0x167)
    8585                            .dwattr $C$DW$704, DW_AT_decl_column(0x14)
    8586                    
    8587                    $C$DW$705       .dwtag  DW_TAG_member
    8588                            .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$24)
    8589                            .dwattr $C$DW$705, DW_AT_name("playerId")
    8590                            .dwattr $C$DW$705, DW_AT_TI_symbol_name("playerId")
    8591                            .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8592                            .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    8593                            .dwattr $C$DW$705, DW_AT_decl_file("..\Application\smsgs.h")
    8594                            .dwattr $C$DW$705, DW_AT_decl_line(0x169)
    8595                            .dwattr $C$DW$705, DW_AT_decl_column(0x0d)
    8596                    
    8597                            .dwattr $C$DW$T$98, DW_AT_decl_file("..\Application\smsgs.h")
    8598                            .dwattr $C$DW$T$98, DW_AT_decl_line(0x164)
    8599                            .dwattr $C$DW$T$98, DW_AT_decl_column(0x10)
    8600                            .dwendtag $C$DW$T$98
    8601                    
    8602                    $C$DW$T$449     .dwtag  DW_TAG_typedef
    8603                            .dwattr $C$DW$T$449, DW_AT_name("Smsgs_laserHitMsg_t")
    8604                            .dwattr $C$DW$T$449, DW_AT_type(*$C$DW$T$98)
    8605                            .dwattr $C$DW$T$449, DW_AT_language(DW_LANG_C)
    8606                            .dwattr $C$DW$T$449, DW_AT_decl_file("..\Application\smsgs.h")
    8607                            .dwattr $C$DW$T$449, DW_AT_decl_line(0x16a)
    8608                            .dwattr $C$DW$T$449, DW_AT_decl_column(0x03)
    8609                    
    8610                    
    8611                    $C$DW$T$99      .dwtag  DW_TAG_structure_type
    8612                            .dwattr $C$DW$T$99, DW_AT_name("_Smsgs_lightsensorfield_t")
    8613                            .dwattr $C$DW$T$99, DW_AT_byte_size(0x02)
    8614                    $C$DW$706       .dwtag  DW_TAG_member
    8615                            .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$30)
    8616                            .dwattr $C$DW$706, DW_AT_name("rawData")
    8617                            .dwattr $C$DW$706, DW_AT_TI_symbol_name("rawData")
    8618                            .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8619                            .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Mon Mar 05 22:12:39 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{C4A3E110-53AC-4E56-B60E-A1B941B7B216} PAGE  158

