TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3AF65006-2768-4EDD-8DF1-46923A6FC145} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Sat Apr 14 15:10:06 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/collector.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\collector_cc1310lp\collector_cc1
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    8280                            .dwattr $C$DW$672, DW_AT_const_value(0x04)
    8281                            .dwattr $C$DW$672, DW_AT_decl_file("..\Application\cllc.h")
    8282                            .dwattr $C$DW$672, DW_AT_decl_line(0x75)
    8283                            .dwattr $C$DW$672, DW_AT_decl_column(0x05)
    8284                    
    8285                            .dwattr $C$DW$T$350, DW_AT_decl_file("..\Application\cllc.h")
    8286                            .dwattr $C$DW$T$350, DW_AT_decl_line(0x6b)
    8287                            .dwattr $C$DW$T$350, DW_AT_decl_column(0x01)
    8288                            .dwendtag $C$DW$T$350
    8289                    
    8290                    $C$DW$T$351     .dwtag  DW_TAG_typedef
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3AF65006-2768-4EDD-8DF1-46923A6FC145} PAGE  152

    8291                            .dwattr $C$DW$T$351, DW_AT_name("Cllc_coord_states_t")
    8292                            .dwattr $C$DW$T$351, DW_AT_type(*$C$DW$T$350)
    8293                            .dwattr $C$DW$T$351, DW_AT_language(DW_LANG_C)
    8294                            .dwattr $C$DW$T$351, DW_AT_decl_file("..\Application\cllc.h")
    8295                            .dwattr $C$DW$T$351, DW_AT_decl_line(0x76)
    8296                            .dwattr $C$DW$T$351, DW_AT_decl_column(0x03)
    8297                    
    8298                    
    8299                    $C$DW$T$352     .dwtag  DW_TAG_enumeration_type
    8300                            .dwattr $C$DW$T$352, DW_AT_byte_size(0x01)
    8301                    $C$DW$673       .dwtag  DW_TAG_enumerator
    8302                            .dwattr $C$DW$673, DW_AT_name("Smsgs_dataFields_tempSensor")
    8303                            .dwattr $C$DW$673, DW_AT_const_value(0x01)
    8304                            .dwattr $C$DW$673, DW_AT_decl_file("..\Application\smsgs.h")
    8305                            .dwattr $C$DW$673, DW_AT_decl_line(0xf8)
    8306                            .dwattr $C$DW$673, DW_AT_decl_column(0x05)
    8307                    
    8308                    $C$DW$674       .dwtag  DW_TAG_enumerator
    8309                            .dwattr $C$DW$674, DW_AT_name("Smsgs_dataFields_lightSensor")
    8310                            .dwattr $C$DW$674, DW_AT_const_value(0x02)
    8311                            .dwattr $C$DW$674, DW_AT_decl_file("..\Application\smsgs.h")
    8312                            .dwattr $C$DW$674, DW_AT_decl_line(0xfa)
    8313                            .dwattr $C$DW$674, DW_AT_decl_column(0x05)
    8314                    
    8315                    $C$DW$675       .dwtag  DW_TAG_enumerator
    8316                            .dwattr $C$DW$675, DW_AT_name("Smsgs_dataFields_humiditySensor")
    8317                            .dwattr $C$DW$675, DW_AT_const_value(0x04)
    8318                            .dwattr $C$DW$675, DW_AT_decl_file("..\Application\smsgs.h")
    8319                            .dwattr $C$DW$675, DW_AT_decl_line(0xfc)
    8320                            .dwattr $C$DW$675, DW_AT_decl_column(0x05)
    8321                    
    8322                    $C$DW$676       .dwtag  DW_TAG_enumerator
    8323                            .dwattr $C$DW$676, DW_AT_name("Smsgs_dataFields_msgStats")
    8324                            .dwattr $C$DW$676, DW_AT_const_value(0x08)
    8325                            .dwattr $C$DW$676, DW_AT_decl_file("..\Application\smsgs.h")
    8326                            .dwattr $C$DW$676, DW_AT_decl_line(0xfe)
    8327                            .dwattr $C$DW$676, DW_AT_decl_column(0x05)
    8328                    
    8329                    $C$DW$677       .dwtag  DW_TAG_enumerator
    8330                            .dwattr $C$DW$677, DW_AT_name("Smsgs_dataFields_configSettings")
    8331                            .dwattr $C$DW$677, DW_AT_const_value(0x10)
    8332                            .dwattr $C$DW$677, DW_AT_decl_file("..\Application\smsgs.h")
    8333                            .dwattr $C$DW$677, DW_AT_decl_line(0x100)
    8334                            .dwattr $C$DW$677, DW_AT_decl_column(0x05)
    8335                    
    8336                            .dwattr $C$DW$T$352, DW_AT_decl_file("..\Application\smsgs.h")
    8337                            .dwattr $C$DW$T$352, DW_AT_decl_line(0xf6)
    8338                            .dwattr $C$DW$T$352, DW_AT_decl_column(0x01)
    8339                            .dwendtag $C$DW$T$352
    8340                    
    8341                    $C$DW$T$353     .dwtag  DW_TAG_typedef
    8342                            .dwattr $C$DW$T$353, DW_AT_name("Smsgs_dataFields_t")
    8343                            .dwattr $C$DW$T$353, DW_AT_type(*$C$DW$T$352)
    8344                            .dwattr $C$DW$T$353, DW_AT_language(DW_LANG_C)
    8345                            .dwattr $C$DW$T$353, DW_AT_decl_file("..\Application\smsgs.h")
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3AF65006-2768-4EDD-8DF1-46923A6FC145} PAGE  153

    8346                            .dwattr $C$DW$T$353, DW_AT_decl_line(0x101)
    8347                            .dwattr $C$DW$T$353, DW_AT_decl_column(0x03)
    8348                    
    8349                    
    8350                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    8351                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x0a)
    8352                    $C$DW$678       .dwtag  DW_TAG_member
    8353                            .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$42)
    8354                            .dwattr $C$DW$678, DW_AT_name("addr")
    8355                            .dwattr $C$DW$678, DW_AT_TI_symbol_name("addr")
    8356                            .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8357                            .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    8358                            .dwattr $C$DW$678, DW_AT_decl_file("..\Application\api_mac.h")
    8359                            .dwattr $C$DW$678, DW_AT_decl_line(0x4a7)
    8360                            .dwattr $C$DW$678, DW_AT_decl_column(0x07)
    8361                    
    8362                    $C$DW$679       .dwtag  DW_TAG_member
    8363                            .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$20)
    8364                            .dwattr $C$DW$679, DW_AT_name("addrMode")
    8365                            .dwattr $C$DW$679, DW_AT_TI_symbol_name("addrMode")
    8366                            .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8367                            .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    8368                            .dwattr $C$DW$679, DW_AT_decl_file("..\Application\api_mac.h")
    8369                            .dwattr $C$DW$679, DW_AT_decl_line(0x4aa)
    8370                            .dwattr $C$DW$679, DW_AT_decl_column(0x17)
    8371                    
    8372                            .dwattr $C$DW$T$21, DW_AT_decl_file("..\Application\api_mac.h")
    8373                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x49c)
    8374                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x01)
    8375                            .dwendtag $C$DW$T$21
    8376                    
    8377                    $C$DW$T$212     .dwtag  DW_TAG_typedef
    8378                            .dwattr $C$DW$T$212, DW_AT_name("ApiMac_sAddr_t")
    8379                            .dwattr $C$DW$T$212, DW_AT_type(*$C$DW$T$21)
    8380                            .dwattr $C$DW$T$212, DW_AT_language(DW_LANG_C)
    8381                            .dwattr $C$DW$T$212, DW_AT_decl_file("..\Application\api_mac.h")
    8382                            .dwattr $C$DW$T$212, DW_AT_decl_line(0x4ab)
    8383                            .dwattr $C$DW$T$212, DW_AT_decl_column(0x03)
    8384                    
    8385                    $C$DW$T$314     .dwtag  DW_TAG_pointer_type
    8386                            .dwattr $C$DW$T$314, DW_AT_type(*$C$DW$T$212)
    8387                            .dwattr $C$DW$T$314, DW_AT_address_class(0x20)
    8388                    
    8389                    $C$DW$T$354     .dwtag  DW_TAG_const_type
    8390                            .dwattr $C$DW$T$354, DW_AT_type(*$C$DW$T$314)
    8391                    
    8392                    
    8393                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    8394                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x40)
    8395                    $C$DW$680       .dwtag  DW_TAG_member
    8396                            .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$23)
    8397                            .dwattr $C$DW$680, DW_AT_name("beaconType")
    8398                            .dwattr $C$DW$680, DW_AT_TI_symbol_name("beaconType")
    8399                            .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8400                            .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3AF65006-2768-4EDD-8DF1-46923A6FC145} PAGE  154

    8401                            .dwattr $C$DW$680, DW_AT_decl_file("..\Application\api_mac.h")
    8402                            .dwattr $C$DW$680, DW_AT_decl_line(0x848)
    8403                            .dwattr $C$DW$680, DW_AT_decl_column(0x19)
    8404                    
    8405                    $C$DW$681       .dwtag  DW_TAG_member
    8406                            .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$24)
    8407                            .dwattr $C$DW$681, DW_AT_name("bsn")
    8408                            .dwattr $C$DW$681, DW_AT_TI_symbol_name("bsn")
    8409                            .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8410                            .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    8411                            .dwattr $C$DW$681, DW_AT_decl_file("..\Application\api_mac.h")
    8412                            .dwattr $C$DW$681, DW_AT_decl_line(0x84a)
    8413                            .dwattr $C$DW$681, DW_AT_decl_column(0x0d)
    8414                    
    8415                    $C$DW$682       .dwtag  DW_TAG_member
    8416                            .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$25)
    8417                            .dwattr $C$DW$682, DW_AT_name("panDesc")
    8418                            .dwattr $C$DW$682, DW_AT_TI_symbol_name("panDesc")
    8419                            .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8420                            .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    8421                            .dwattr $C$DW$682, DW_AT_decl_file("..\Application\api_mac.h")
    8422                            .dwattr $C$DW$682, DW_AT_decl_line(0x84c)
    8423                            .dwattr $C$DW$682, DW_AT_decl_column(0x16)
    8424                    
    8425                    $C$DW$683       .dwtag  DW_TAG_member
    8426                            .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$45)
    8427                            .dwattr $C$DW$683, DW_AT_name("beaconData")
    8428                            .dwattr $C$DW$683, DW_AT_TI_symbol_name("beaconData")
    8429                            .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    8430                            .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    8431                            .dwattr $C$DW$683, DW_AT_decl_file("..\Application\api_mac.h")
    8432                            .dwattr $C$DW$683, DW_AT_decl_line(0x857)
    8433                            .dwattr $C$DW$683, DW_AT_decl_column(0x07)
    8434                    
    8435                            .dwattr $C$DW$T$26, DW_AT_decl_file("..\Application\api_mac.h")
    8436                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x846)
    8437                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x01)
    8438                            .dwendtag $C$DW$T$26
    8439                    
    8440                    $C$DW$T$125     .dwtag  DW_TAG_typedef
    8441                            .dwattr $C$DW$T$125, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
    8442                            .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$26)
    8443                            .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    8444                            .dwattr $C$DW$T$125, DW_AT_decl_file("..\Application\api_mac.h")
    8445                            .dwattr $C$DW$T$125, DW_AT_decl_line(0x858)
    8446                            .dwattr $C$DW$T$125, DW_AT_decl_column(0x03)
    8447                    
    8448                    $C$DW$T$126     .dwtag  DW_TAG_pointer_type
    8449                            .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$125)
    8450                            .dwattr $C$DW$T$126, DW_AT_address_class(0x20)
    8451                    
    8452                    
    8453                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    8454                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x0e)
    8455                    $C$DW$684       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3AF65006-2768-4EDD-8DF1-46923A6FC145} PAGE  155

    8456                            .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$27)
    8457                            .dwattr $C$DW$684, DW_AT_name("devInfo")
    8458                            .dwattr $C$DW$684, DW_AT_TI_symbol_name("devInfo")
    8459                            .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8460                            .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    8461                            .dwattr $C$DW$684, DW_AT_decl_file("..\Application\llc.h")
    8462                            .dwattr $C$DW$684, DW_AT_decl_line(0x47)
    8463                            .dwattr $C$DW$684, DW_AT_decl_column(0x1f)
    8464                    
    8465                    $C$DW$685       .dwtag  DW_TAG_member
    8466                            .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$24)
    8467                            .dwattr $C$DW$685, DW_AT_name("channel")
    8468                            .dwattr $C$DW$685, DW_AT_TI_symbol_name("channel")
    8469                            .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8470                            .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    8471                            .dwattr $C$DW$685, DW_AT_decl_file("..\Application\llc.h")
    8472                            .dwattr $C$DW$685, DW_AT_decl_line(0x49)
    8473                            .dwattr $C$DW$685, DW_AT_decl_column(0x0d)
    8474                    
    8475                    $C$DW$686       .dwtag  DW_TAG_member
    8476                            .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$28)
    8477                            .dwattr $C$DW$686, DW_AT_name("fh")
    8478                            .dwattr $C$DW$686, DW_AT_TI_symbol_name("fh")
    8479                            .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8480                            .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    8481                            .dwattr $C$DW$686, DW_AT_decl_file("..\Application\llc.h")
    8482                            .dwattr $C$DW$686, DW_AT_decl_line(0x4b)
    8483                            .dwattr $C$DW$686, DW_AT_decl_column(0x0a)
    8484                    
    8485                            .dwattr $C$DW$T$29, DW_AT_decl_file("..\Application\llc.h")
    8486                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x45)
    8487                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    8488                            .dwendtag $C$DW$T$29
    8489                    
    8490                    $C$DW$T$61      .dwtag  DW_TAG_typedef
    8491                            .dwattr $C$DW$T$61, DW_AT_name("Llc_netInfo_t")
    8492                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$29)
    8493                            .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    8494                            .dwattr $C$DW$T$61, DW_AT_decl_file("..\Application\llc.h")
    8495                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x4c)
    8496                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
    8497                    
    8498                    $C$DW$T$62      .dwtag  DW_TAG_pointer_type
    8499                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    8500                            .dwattr $C$DW$T$62, DW_AT_address_class(0x20)
    8501                    
    8502                    $C$DW$T$357     .dwtag  DW_TAG_const_type
    8503                            .dwattr $C$DW$T$357, DW_AT_type(*$C$DW$T$62)
    8504                    
    8505                    
    8506                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    8507                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x0c)
    8508                    $C$DW$687       .dwtag  DW_TAG_member
    8509                            .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$30)
    8510                            .dwattr $C$DW$687, DW_AT_name("shortAddr")
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3AF65006-2768-4EDD-8DF1-46923A6FC145} PAGE  156

    8511                            .dwattr $C$DW$687, DW_AT_TI_symbol_name("shortAddr")
    8512                            .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8513                            .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    8514                            .dwattr $C$DW$687, DW_AT_decl_file("..\Application\cllc.h")
    8515                            .dwattr $C$DW$687, DW_AT_decl_line(0x7c)
    8516                            .dwattr $C$DW$687, DW_AT_decl_column(0x0e)
    8517                    
    8518                    $C$DW$688       .dwtag  DW_TAG_member
    8519                            .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$31)
    8520                            .dwattr $C$DW$688, DW_AT_name("capInfo")
    8521                            .dwattr $C$DW$688, DW_AT_TI_symbol_name("capInfo")
    8522                            .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8523                            .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    8524                            .dwattr $C$DW$688, DW_AT_decl_file("..\Application\cllc.h")
    8525                            .dwattr $C$DW$688, DW_AT_decl_line(0x7e)
    8526                            .dwattr $C$DW$688, DW_AT_decl_column(0x1d)
    8527                    
    8528                    $C$DW$689       .dwtag  DW_TAG_member
    8529                            .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$32)
    8530                            .dwattr $C$DW$689, DW_AT_name("rssi")
    8531                            .dwattr $C$DW$689, DW_AT_TI_symbol_name("rssi")
    8532                            .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8533                            .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    8534                            .dwattr $C$DW$689, DW_AT_decl_file("..\Application\cllc.h")
    8535                            .dwattr $C$DW$689, DW_AT_decl_line(0x80)
    8536                            .dwattr $C$DW$689, DW_AT_decl_column(0x0c)
    8537                    
    8538                    $C$DW$690       .dwtag  DW_TAG_member
    8539                            .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$30)
    8540                            .dwattr $C$DW$690, DW_AT_name("status")
    8541                            .dwattr $C$DW$690, DW_AT_TI_symbol_name("status")
    8542                            .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8543                            .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    8544                            .dwattr $C$DW$690, DW_AT_decl_file("..\Application\cllc.h")
    8545                            .dwattr $C$DW$690, DW_AT_decl_line(0x82)
    8546                            .dwattr $C$DW$690, DW_AT_decl_column(0x0e)
    8547                    
    8548                            .dwattr $C$DW$T$33, DW_AT_decl_file("..\Application\cllc.h")
    8549                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x7a)
    8550                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    8551                            .dwendtag $C$DW$T$33
    8552                    
    8553                    $C$DW$T$360     .dwtag  DW_TAG_typedef
    8554                            .dwattr $C$DW$T$360, DW_AT_name("Cllc_associated_devices_t")
    8555                            .dwattr $C$DW$T$360, DW_AT_type(*$C$DW$T$33)
    8556                            .dwattr $C$DW$T$360, DW_AT_language(DW_LANG_C)
    8557                            .dwattr $C$DW$T$360, DW_AT_decl_file("..\Application\cllc.h")
    8558                            .dwattr $C$DW$T$360, DW_AT_decl_line(0x83)
    8559                            .dwattr $C$DW$T$360, DW_AT_decl_column(0x03)
    8560                    
    8561                    $C$DW$T$361     .dwtag  DW_TAG_pointer_type
    8562                            .dwattr $C$DW$T$361, DW_AT_type(*$C$DW$T$360)
    8563                            .dwattr $C$DW$T$361, DW_AT_address_class(0x20)
    8564                    
    8565                    $C$DW$T$364     .dwtag  DW_TAG_const_type
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3AF65006-2768-4EDD-8DF1-46923A6FC145} PAGE  157

    8566                            .dwattr $C$DW$T$364, DW_AT_type(*$C$DW$T$361)
    8567                    
    8568                    
    8569                    $C$DW$T$365     .dwtag  DW_TAG_array_type
    8570                            .dwattr $C$DW$T$365, DW_AT_type(*$C$DW$T$360)
    8571                            .dwattr $C$DW$T$365, DW_AT_language(DW_LANG_C)
    8572                            .dwattr $C$DW$T$365, DW_AT_byte_size(0x258)
    8573                    $C$DW$691       .dwtag  DW_TAG_subrange_type
    8574                            .dwattr $C$DW$691, DW_AT_upper_bound(0x31)
    8575                    
    8576                            .dwendtag $C$DW$T$365
    8577                    
    8578                    
    8579                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    8580                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x3c)
    8581                    $C$DW$692       .dwtag  DW_TAG_member
    8582                            .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$34)
    8583                            .dwattr $C$DW$692, DW_AT_name("trackingRequestAttempts")
    8584                            .dwattr $C$DW$692, DW_AT_TI_symbol_name("trackingRequestAttempts")
    8585                            .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8586                            .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    8587                            .dwattr $C$DW$692, DW_AT_decl_file("..\Application\collector.h")
    8588                            .dwattr $C$DW$692, DW_AT_decl_line(0x60)
    8589                            .dwattr $C$DW$692, DW_AT_decl_column(0x0e)
    8590                    
    8591                    $C$DW$693       .dwtag  DW_TAG_member
    8592                            .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$34)
    8593                            .dwattr $C$DW$693, DW_AT_name("trackingReqRequestSent")
    8594                            .dwattr $C$DW$693, DW_AT_TI_symbol_name("trackingReqRequestSent")
    8595                            .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8596                            .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    8597                            .dwattr $C$DW$693, DW_AT_decl_file("..\Application\collector.h")
    8598                            .dwattr $C$DW$693, DW_AT_decl_line(0x64)
    8599                            .dwattr $C$DW$693, DW_AT_decl_column(0x0e)
    8600                    
    8601                    $C$DW$694       .dwtag  DW_TAG_member
    8602                            .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$34)
    8603                            .dwattr $C$DW$694, DW_AT_name("trackingResponseReceived")
    8604                            .dwattr $C$DW$694, DW_AT_TI_symbol_name("trackingResponseReceived")
    8605                            .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8606                            .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    8607                            .dwattr $C$DW$694, DW_AT_decl_file("..\Application\collector.h")
    8608                            .dwattr $C$DW$694, DW_AT_decl_line(0x68)
    8609                            .dwattr $C$DW$694, DW_AT_decl_column(0x0e)
    8610                    
    8611                    $C$DW$695       .dwtag  DW_TAG_member
    8612                            .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$34)
    8613                            .dwattr $C$DW$695, DW_AT_name("configRequestAttempts")
    8614                            .dwattr $C$DW$695, DW_AT_TI_symbol_name("configRequestAttempts")
    8615                            .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8616                            .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    8617                            .dwattr $C$DW$695, DW_AT_decl_file("..\Application\collector.h")
    8618                            .dwattr $C$DW$695, DW_AT_decl_line(0x6c)
    8619                            .dwattr $C$DW$695, DW_AT_decl_column(0x0e)
    8620                    
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3AF65006-2768-4EDD-8DF1-46923A6FC145} PAGE  158

    8621                    $C$DW$696       .dwtag  DW_TAG_member
    8622                            .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$34)
    8623                            .dwattr $C$DW$696, DW_AT_name("configReqRequestSent")
    8624                            .dwattr $C$DW$696, DW_AT_TI_symbol_name("configReqRequestSent")
    8625                            .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8626                            .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    8627                            .dwattr $C$DW$696, DW_AT_decl_file("..\Application\collector.h")
    8628                            .dwattr $C$DW$696, DW_AT_decl_line(0x70)
    8629                            .dwattr $C$DW$696, DW_AT_decl_column(0x0e)
    8630                    
    8631                    $C$DW$697       .dwtag  DW_TAG_member
    8632                            .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$34)
    8633                            .dwattr $C$DW$697, DW_AT_name("configResponseReceived")
    8634                            .dwattr $C$DW$697, DW_AT_TI_symbol_name("configResponseReceived")
    8635                            .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8636                            .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    8637                            .dwattr $C$DW$697, DW_AT_decl_file("..\Application\collector.h")
    8638                            .dwattr $C$DW$697, DW_AT_decl_line(0x74)
    8639                            .dwattr $C$DW$697, DW_AT_decl_column(0x0e)
    8640                    
    8641                    $C$DW$698       .dwtag  DW_TAG_member
    8642                            .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$34)
    8643                            .dwattr $C$DW$698, DW_AT_name("sensorMessagesReceived")
    8644                            .dwattr $C$DW$698, DW_AT_TI_symbol_name("sensorMessagesReceived")
    8645                            .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8646                            .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    8647                            .dwattr $C$DW$698, DW_AT_decl_file("..\Application\collector.h")
    8648                            .dwattr $C$DW$698, DW_AT_decl_line(0x78)
    8649                            .dwattr $C$DW$698, DW_AT_decl_column(0x0e)
    8650                    
    8651                    $C$DW$699       .dwtag  DW_TAG_member
    8652                            .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$34)
    8653                            .dwattr $C$DW$699, DW_AT_name("channelAccessFailures")
    8654                            .dwattr $C$DW$699, DW_AT_TI_symbol_name("channelAccessFailures")
    8655                            .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8656                            .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    8657                            .dwattr $C$DW$699, DW_AT_decl_file("..\Application\collector.h")
    8658                            .dwattr $C$DW$699, DW_AT_decl_line(0x7c)
    8659                            .dwattr $C$DW$699, DW_AT_decl_column(0x0e)
    8660                    
    8661                    $C$DW$700       .dwtag  DW_TAG_member
    8662                            .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$34)
    8663                            .dwattr $C$DW$700, DW_AT_name("ackFailures")
    8664                            .dwattr $C$DW$700, DW_AT_TI_symbol_name("ackFailures")
    8665                            .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8666                            .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    8667                            .dwattr $C$DW$700, DW_AT_decl_file("..\Application\collector.h")
    8668                            .dwattr $C$DW$700, DW_AT_decl_line(0x80)
    8669                            .dwattr $C$DW$700, DW_AT_decl_column(0x0e)
    8670                    
    8671                    $C$DW$701       .dwtag  DW_TAG_member
    8672                            .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$34)
    8673                            .dwattr $C$DW$701, DW_AT_name("otherTxFailures")
    8674                            .dwattr $C$DW$701, DW_AT_TI_symbol_name("otherTxFailures")
    8675                            .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3AF65006-2768-4EDD-8DF1-46923A6FC145} PAGE  159

    8676                            .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    8677                            .dwattr $C$DW$701, DW_AT_decl_file("..\Application\collector.h")
    8678                            .dwattr $C$DW$701, DW_AT_decl_line(0x85)
    8679                            .dwattr $C$DW$701, DW_AT_decl_column(0x0e)
    8680                    
    8681                    $C$DW$702       .dwtag  DW_TAG_member
    8682                            .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$34)
    8683                            .dwattr $C$DW$702, DW_AT_name("rxDecryptFailures")
    8684                            .dwattr $C$DW$702, DW_AT_TI_symbol_name("rxDecryptFailures")
    8685                            .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    8686                            .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    8687                            .dwattr $C$DW$702, DW_AT_decl_file("..\Application\collector.h")
    8688                            .dwattr $C$DW$702, DW_AT_decl_line(0x87)
    8689                            .dwattr $C$DW$702, DW_AT_decl_column(0x0e)
    8690                    
    8691                    $C$DW$703       .dwtag  DW_TAG_member
    8692                            .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$34)
    8693                            .dwattr $C$DW$703, DW_AT_name("txEncryptFailures")
    8694                            .dwattr $C$DW$703, DW_AT_TI_symbol_name("txEncryptFailures")
    8695                            .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    8696                            .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    8697                            .dwattr $C$DW$703, DW_AT_decl_file("..\Application\collector.h")
    8698                            .dwattr $C$DW$703, DW_AT_decl_line(0x89)
    8699                            .dwattr $C$DW$703, DW_AT_decl_column(0x0e)
    8700                    
    8701                    $C$DW$704       .dwtag  DW_TAG_member
    8702                            .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$34)
    8703                            .dwattr $C$DW$704, DW_AT_name("txTransactionExpired")
    8704                            .dwattr $C$DW$704, DW_AT_TI_symbol_name("txTransactionExpired")
    8705                            .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    8706                            .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    8707                            .dwattr $C$DW$704, DW_AT_decl_file("..\Application\collector.h")
    8708                            .dwattr $C$DW$704, DW_AT_decl_line(0x8b)
    8709                            .dwattr $C$DW$704, DW_AT_decl_column(0x0e)
    8710                    
    8711                    $C$DW$705       .dwtag  DW_TAG_member
    8712                            .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$34)
    8713                            .dwattr $C$DW$705, DW_AT_name("txTransactionOverflow")
    8714                            .dwattr $C$DW$705, DW_AT_TI_symbol_name("txTransactionOverflow")
    8715                            .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    8716                            .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    8717                            .dwattr $C$DW$705, DW_AT_decl_file("..\Application\collector.h")
    8718                            .dwattr $C$DW$705, DW_AT_decl_line(0x8d)
    8719                            .dwattr $C$DW$705, DW_AT_decl_column(0x0e)
    8720                    
    8721                    $C$DW$706       .dwtag  DW_TAG_member
    8722                            .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$30)
    8723                            .dwattr $C$DW$706, DW_AT_name("broadcastMsgSentCnt")
    8724                            .dwattr $C$DW$706, DW_AT_TI_symbol_name("broadcastMsgSentCnt")
    8725                            .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    8726                            .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    8727                            .dwattr $C$DW$706, DW_AT_decl_file("..\Application\collector.h")
    8728                            .dwattr $C$DW$706, DW_AT_decl_line(0x8f)
    8729                            .dwattr $C$DW$706, DW_AT_decl_column(0x0e)
    8730                    
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3AF65006-2768-4EDD-8DF1-46923A6FC145} PAGE  160

    8731                            .dwattr $C$DW$T$35, DW_AT_decl_file("..\Application\collector.h")
    8732                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x5c)
    8733                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x01)
    8734                            .dwendtag $C$DW$T$35
    8735                    
    8736                    $C$DW$T$373     .dwtag  DW_TAG_typedef
    8737                            .dwattr $C$DW$T$373, DW_AT_name("Collector_statistics_t")
    8738                            .dwattr $C$DW$T$373, DW_AT_type(*$C$DW$T$35)
    8739                            .dwattr $C$DW$T$373, DW_AT_language(DW_LANG_C)
    8740                            .dwattr $C$DW$T$373, DW_AT_decl_file("..\Application\collector.h")
    8741                            .dwattr $C$DW$T$373, DW_AT_decl_line(0x90)
    8742                            .dwattr $C$DW$T$373, DW_AT_decl_column(0x03)
    8743                    
    8744                    
    8745                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    8746                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    8747                    $C$DW$707       .dwtag  DW_TAG_member
    8748                            .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$10)
    8749                            .dwattr $C$DW$707, DW_AT_name("quot")
    8750                            .dwattr $C$DW$707, DW_AT_TI_symbol_name("quot")
    8751                            .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8752                            .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    8753                            .dwattr $C$DW$707, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    8754                            .dwattr $C$DW$707, DW_AT_decl_line(0x5c)
    8755                            .dwattr $C$DW$707, DW_AT_decl_column(0x16)
    8756                    
    8757                    $C$DW$708       .dwtag  DW_TAG_member
    8758                            .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$10)
    8759                            .dwattr $C$DW$708, DW_AT_name("rem")
    8760                            .dwattr $C$DW$708, DW_AT_TI_symbol_name("rem")
    8761                            .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8762                            .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    8763                            .dwattr $C$DW$708, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    8764                            .dwattr $C$DW$708, DW_AT_decl_line(0x5c)
    8765                            .dwattr $C$DW$708, DW_AT_decl_column(0x1c)
    8766                    
    8767                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
    8768                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x5c)
    8769                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    8770                            .dwendtag $C$DW$T$36
    8771                    
    8772                    $C$DW$T$375     .dwtag  DW_TAG_typedef
    8773                            .dwattr $C$DW$T$375, DW_AT_name("div_t")
    8774                            .dwattr $C$DW$T$375, DW_AT_type(*$C$DW$T$36)
    8775                            .dwattr $C$DW$T$375, DW_AT_language(DW_LANG_C)
    8776                            .dwattr $C$DW$T$375, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    8777                            .dwattr $C$DW$T$375, DW_AT_decl_line(0x5c)
    8778                            .dwattr $C$DW$T$375, DW_AT_decl_column(0x23)
    8779                    
    8780                    
    8781                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    8782                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x08)
    8783                    $C$DW$709       .dwtag  DW_TAG_member
    8784                            .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$10)
    8785                            .dwattr $C$DW$709, DW_AT_name("quot")
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3AF65006-2768-4EDD-8DF1-46923A6FC145} PAGE  161

    8786                            .dwattr $C$DW$709, DW_AT_TI_symbol_name("quot")
    8787                            .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8788                            .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    8789                            .dwattr $C$DW$709, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    8790                            .dwattr $C$DW$709, DW_AT_decl_line(0x5e)
    8791                            .dwattr $C$DW$709, DW_AT_decl_column(0x16)
    8792                    
    8793                    $C$DW$710       .dwtag  DW_TAG_member
    8794                            .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$10)
    8795                            .dwattr $C$DW$710, DW_AT_name("rem")
    8796                            .dwattr $C$DW$710, DW_AT_TI_symbol_name("rem")
    8797                            .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8798                            .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    8799                            .dwattr $C$DW$710, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    8800                            .dwattr $C$DW$710, DW_AT_decl_line(0x5e)
    8801                            .dwattr $C$DW$710, DW_AT_decl_column(0x1c)
    8802                    
    8803                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
    8804                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x5e)
    8805                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    8806                            .dwendtag $C$DW$T$37
    8807                    
    8808                    $C$DW$T$376     .dwtag  DW_TAG_typedef
    8809                            .dwattr $C$DW$T$376, DW_AT_name("ldiv_t")
    8810                            .dwattr $C$DW$T$376, DW_AT_type(*$C$DW$T$37)
    8811                            .dwattr $C$DW$T$376, DW_AT_language(DW_LANG_C)
    8812                            .dwattr $C$DW$T$376, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    8813                            .dwattr $C$DW$T$376, DW_AT_decl_line(0x5e)
    8814                            .dwattr $C$DW$T$376, DW_AT_decl_column(0x23)
    8815                    
    8816                    
    8817                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    8818                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x10)
    8819                    $C$DW$711       .dwtag  DW_TAG_member
    8820                            .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$14)
    8821                            .dwattr $C$DW$711, DW_AT_name("quot")
    8822                            .dwattr $C$DW$711, DW_AT_TI_symbol_name("quot")
    8823                            .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8824                            .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    8825                            .dwattr $C$DW$711, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    8826                            .dwattr $C$DW$711, DW_AT_decl_line(0x61)
    8827                            .dwattr $C$DW$711, DW_AT_decl_column(0x1c)
    8828                    
    8829                    $C$DW$712       .dwtag  DW_TAG_member
    8830                            .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$14)
    8831                            .dwattr $C$DW$712, DW_AT_name("rem")
    8832                            .dwattr $C$DW$712, DW_AT_TI_symbol_name("rem")
    8833                            .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8834                            .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    8835                            .dwattr $C$DW$712, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    8836                            .dwattr $C$DW$712, DW_AT_decl_line(0x61)
    8837                            .dwattr $C$DW$712, DW_AT_decl_column(0x22)
    8838                    
    8839                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
    8840                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x61)
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3AF65006-2768-4EDD-8DF1-46923A6FC145} PAGE  162

    8841                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    8842                            .dwendtag $C$DW$T$38
    8843                    
    8844                    $C$DW$T$377     .dwtag  DW_TAG_typedef
    8845                            .dwattr $C$DW$T$377, DW_AT_name("lldiv_t")
    8846                            .dwattr $C$DW$T$377, DW_AT_type(*$C$DW$T$38)
    8847                            .dwattr $C$DW$T$377, DW_AT_language(DW_LANG_C)
    8848                            .dwattr $C$DW$T$377, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include
    8849                            .dwattr $C$DW$T$377, DW_AT_decl_line(0x61)
    8850                            .dwattr $C$DW$T$377, DW_AT_decl_column(0x29)
    8851                    
    8852                    
    8853                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    8854                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
    8855                    $C$DW$713       .dwtag  DW_TAG_member
    8856                            .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$34)
    8857                            .dwattr $C$DW$713, DW_AT_name("fhNumPASolicitReceived")
    8858                            .dwattr $C$DW$713, DW_AT_TI_symbol_name("fhNumPASolicitReceived")
    8859                            .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8860                            .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    8861                            .dwattr $C$DW$713, DW_AT_decl_file("..\Application\cllc.h")
    8862                            .dwattr $C$DW$713, DW_AT_decl_line(0x89)
    8863                            .dwattr $C$DW$713, DW_AT_decl_column(0x0e)
    8864                    
    8865                    $C$DW$714       .dwtag  DW_TAG_member
    8866                            .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$34)
    8867                            .dwattr $C$DW$714, DW_AT_name("fhNumPASent")
    8868                            .dwattr $C$DW$714, DW_AT_TI_symbol_name("fhNumPASent")
    8869                            .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8870                            .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    8871                            .dwattr $C$DW$714, DW_AT_decl_file("..\Application\cllc.h")
    8872                            .dwattr $C$DW$714, DW_AT_decl_line(0x8b)
    8873                            .dwattr $C$DW$714, DW_AT_decl_column(0x0e)
    8874                    
    8875                    $C$DW$715       .dwtag  DW_TAG_member
    8876                            .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$34)
    8877                            .dwattr $C$DW$715, DW_AT_name("fhNumPANConfigSolicitsReceived")
    8878                            .dwattr $C$DW$715, DW_AT_TI_symbol_name("fhNumPANConfigSolicitsReceived")
    8879                            .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8880                            .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    8881                            .dwattr $C$DW$715, DW_AT_decl_file("..\Application\cllc.h")
    8882                            .dwattr $C$DW$715, DW_AT_decl_line(0x8d)
    8883                            .dwattr $C$DW$715, DW_AT_decl_column(0x0e)
    8884                    
    8885                    $C$DW$716       .dwtag  DW_TAG_member
    8886                            .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$34)
    8887                            .dwattr $C$DW$716, DW_AT_name("fhNumPANConfigSent")
    8888                            .dwattr $C$DW$716, DW_AT_TI_symbol_name("fhNumPANConfigSent")
    8889                            .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8890                            .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    8891                            .dwattr $C$DW$716, DW_AT_decl_file("..\Application\cllc.h")
    8892                            .dwattr $C$DW$716, DW_AT_decl_line(0x8f)
    8893                            .dwattr $C$DW$716, DW_AT_decl_column(0x0e)
    8894                    
    8895                    $C$DW$717       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3AF65006-2768-4EDD-8DF1-46923A6FC145} PAGE  163

    8896                            .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$34)
    8897                            .dwattr $C$DW$717, DW_AT_name("otherStats")
    8898                            .dwattr $C$DW$717, DW_AT_TI_symbol_name("otherStats")
    8899                            .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8900                            .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    8901                            .dwattr $C$DW$717, DW_AT_decl_file("..\Application\cllc.h")
    8902                            .dwattr $C$DW$717, DW_AT_decl_line(0x90)
    8903                            .dwattr $C$DW$717, DW_AT_decl_column(0x0e)
    8904                    
    8905                            .dwattr $C$DW$T$39, DW_AT_decl_file("..\Application\cllc.h")
    8906                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x87)
    8907                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
    8908                            .dwendtag $C$DW$T$39
    8909                    
    8910                    $C$DW$T$378     .dwtag  DW_TAG_typedef
    8911                            .dwattr $C$DW$T$378, DW_AT_name("Cllc_statistics_t")
    8912                            .dwattr $C$DW$T$378, DW_AT_type(*$C$DW$T$39)
    8913                            .dwattr $C$DW$T$378, DW_AT_language(DW_LANG_C)
    8914                            .dwattr $C$DW$T$378, DW_AT_decl_file("..\Application\cllc.h")
    8915                            .dwattr $C$DW$T$378, DW_AT_decl_line(0x91)
    8916                            .dwattr $C$DW$T$378, DW_AT_decl_column(0x03)
    8917                    
    8918                    
    8919                    $C$DW$T$42      .dwtag  DW_TAG_union_type
    8920                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x08)
    8921                    $C$DW$718       .dwtag  DW_TAG_member
    8922                            .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$30)
    8923                            .dwattr $C$DW$718, DW_AT_name("shortAddr")
    8924                            .dwattr $C$DW$718, DW_AT_TI_symbol_name("shortAddr")
    8925                            .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8926                            .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    8927                            .dwattr $C$DW$718, DW_AT_decl_file("..\Application\api_mac.h")
    8928                            .dwattr $C$DW$718, DW_AT_decl_line(0x4a4)
    8929                            .dwattr $C$DW$718, DW_AT_decl_column(0x12)
    8930                    
    8931                    $C$DW$719       .dwtag  DW_TAG_member
    8932                            .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$41)
    8933                            .dwattr $C$DW$719, DW_AT_name("extAddr")
    8934                            .dwattr $C$DW$719, DW_AT_TI_symbol_name("extAddr")
    8935                            .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8936                            .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    8937                            .dwattr $C$DW$719, DW_AT_decl_file("..\Application\api_mac.h")
    8938                            .dwattr $C$DW$719, DW_AT_decl_line(0x4a6)
    8939                            .dwattr $C$DW$719, DW_AT_decl_column(0x1b)
    8940                    
    8941                            .dwattr $C$DW$T$42, DW_AT_decl_file("..\Application\api_mac.h")
    8942                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x4a2)
    8943                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x05)
    8944                            .dwendtag $C$DW$T$42
    8945                    
    8946                    
    8947                    $C$DW$T$45      .dwtag  DW_TAG_union_type
    8948                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x18)
    8949                    $C$DW$720       .dwtag  DW_TAG_member
    8950                            .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$43)
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3AF65006-2768-4EDD-8DF1-46923A6FC145} PAGE  164

    8951                            .dwattr $C$DW$720, DW_AT_name("beacon")
    8952                            .dwattr $C$DW$720, DW_AT_TI_symbol_name("beacon")
    8953                            .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8954                            .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    8955                            .dwattr $C$DW$720, DW_AT_decl_file("..\Application\api_mac.h")
    8956                            .dwattr $C$DW$720, DW_AT_decl_line(0x854)
    8957                            .dwattr $C$DW$720, DW_AT_decl_column(0x1d)
    8958                    
    8959                    $C$DW$721       .dwtag  DW_TAG_member
    8960                            .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$44)
    8961                            .dwattr $C$DW$721, DW_AT_name("eBeacon")
    8962                            .dwattr $C$DW$721, DW_AT_TI_symbol_name("eBeacon")
    8963                            .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8964                            .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    8965                            .dwattr $C$DW$721, DW_AT_decl_file("..\Application\api_mac.h")
    8966                            .dwattr $C$DW$721, DW_AT_decl_line(0x856)
    8967                            .dwattr $C$DW$721, DW_AT_decl_column(0x1e)
    8968                    
    8969                            .dwattr $C$DW$T$45, DW_AT_decl_file("..\Application\api_mac.h")
    8970                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x852)
    8971                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x05)
    8972                            .dwendtag $C$DW$T$45
    8973                    
    8974                    
    8975                    $C$DW$T$48      .dwtag  DW_TAG_union_type
    8976                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x04)
    8977                    $C$DW$722       .dwtag  DW_TAG_member
    8978                            .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$46)
    8979                            .dwattr $C$DW$722, DW_AT_name("pEnergyDetect")
    8980                            .dwattr $C$DW$722, DW_AT_TI_symbol_name("pEnergyDetect")
    8981                            .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8982                            .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    8983                            .dwattr $C$DW$722, DW_AT_decl_file("..\Application\api_mac.h")
    8984                            .dwattr $C$DW$722, DW_AT_decl_line(0x876)
    8985                            .dwattr $C$DW$722, DW_AT_decl_column(0x12)
    8986                    
    8987                    $C$DW$723       .dwtag  DW_TAG_member
    8988                            .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$47)
    8989                            .dwattr $C$DW$723, DW_AT_name("pPanDescriptor")
    8990                            .dwattr $C$DW$723, DW_AT_TI_symbol_name("pPanDescriptor")
    8991                            .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8992                            .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    8993                            .dwattr $C$DW$723, DW_AT_decl_file("..\Application\api_mac.h")
    8994                            .dwattr $C$DW$723, DW_AT_decl_line(0x878)
    8995                            .dwattr $C$DW$723, DW_AT_decl_column(0x1b)
    8996                    
    8997                            .dwattr $C$DW$T$48, DW_AT_decl_file("..\Application\api_mac.h")
    8998                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x874)
    8999                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x05)
    9000                            .dwendtag $C$DW$T$48
    9001                    
    9002                    
    9003                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
    9004                            .dwattr $C$DW$T$49, DW_AT_name(".ggroup1")
    9005                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x9c)
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3AF65006-2768-4EDD-8DF1-46923A6FC145} PAGE  165

    9006                    $C$DW$724       .dwtag  DW_TAG_member
    9007                            .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$6)
    9008                            .dwattr $C$DW$724, DW_AT_name("restarted")
    9009                            .dwattr $C$DW$724, DW_AT_TI_symbol_name("restarted")
    9010                            .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9011                            .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    9012                    
    9013                    $C$DW$725       .dwtag  DW_TAG_member
    9014                            .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$6)
    9015                            .dwattr $C$DW$725, DW_AT_name("cllcState")
    9016                            .dwattr $C$DW$725, DW_AT_TI_symbol_name("cllcState")
    9017                            .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9018                            .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    9019                    
    9020                    $C$DW$726       .dwtag  DW_TAG_member
    9021                            .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$6)
    9022                            .dwattr $C$DW$726, DW_AT_name("deviceTxMsduHandle")
    9023                            .dwattr $C$DW$726, DW_AT_TI_symbol_name("deviceTxMsduHandle")
    9024                            .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9025                            .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    9026                    
    9027                    $C$DW$727       .dwtag  DW_TAG_member
    9028                            .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$6)
    9029                            .dwattr $C$DW$727, DW_AT_name("fhEnabled")
    9030                            .dwattr $C$DW$727, DW_AT_TI_symbol_name("fhEnabled")
    9031                            .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9032                            .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    9033                    
    9034                    $C$DW$728       .dwtag  DW_TAG_member
    9035                            .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$9)
    9036                            .dwattr $C$DW$728, DW_AT_name("Collector_events")
    9037                            .dwattr $C$DW$728, DW_AT_TI_symbol_name("Collector_events")
    9038                            .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9039                            .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    9040                    
    9041                    $C$DW$729       .dwtag  DW_TAG_member
    9042                            .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$9)
    9043                            .dwattr $C$DW$729, DW_AT_name("devicePanId")
    9044                            .dwattr $C$DW$729, DW_AT_TI_symbol_name("devicePanId")
    9045                            .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9046                            .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    9047                    
    9048                    $C$DW$730       .dwtag  DW_TAG_member
    9049                            .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$3)
    9050                            .dwattr $C$DW$730, DW_AT_name("sem")
    9051                            .dwattr $C$DW$730, DW_AT_TI_symbol_name("sem")
    9052                            .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9053                            .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    9054                    
    9055                    $C$DW$731       .dwtag  DW_TAG_member
    9056                            .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$78)
    9057                            .dwattr $C$DW$731, DW_AT_name("cllcCallbacks")
    9058                            .dwattr $C$DW$731, DW_AT_TI_symbol_name("cllcCallbacks")
    9059                            .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9060                            .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3AF65006-2768-4EDD-8DF1-46923A6FC145} PAGE  166

    9061                    
    9062                    $C$DW$732       .dwtag  DW_TAG_member
    9063                            .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$35)
    9064                            .dwattr $C$DW$732, DW_AT_name("Collector_statistics")
    9065                            .dwattr $C$DW$732, DW_AT_TI_symbol_name("Collector_statistics")
    9066                            .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9067                            .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    9068                    
    9069                    $C$DW$733       .dwtag  DW_TAG_member
    9070                            .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$193)
    9071                            .dwattr $C$DW$733, DW_AT_name("Collector_macCallbacks")
    9072                            .dwattr $C$DW$733, DW_AT_TI_symbol_name("Collector_macCallbacks")
    9073                            .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    9074                            .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    9075                    
    9076                            .dwendtag $C$DW$T$49
    9077                    
    9078                    
    9079                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    9080                            .dwattr $C$DW$T$50, DW_AT_name("S3_1")
    9081                            .dwattr $C$DW$T$50, DW_AT_declaration
    9082                            .dwendtag $C$DW$T$50
    9083                    
    9084                    
    9085                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
    9086                            .dwattr $C$DW$T$51, DW_AT_name("S3_1")
    9087                            .dwattr $C$DW$T$51, DW_AT_declaration
    9088                            .dwendtag $C$DW$T$51
    9089                    
    9090                    
    9091                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    9092                            .dwattr $C$DW$T$52, DW_AT_name("S4_3")
    9093                            .dwattr $C$DW$T$52, DW_AT_declaration
    9094                            .dwendtag $C$DW$T$52
    9095                    
    9096                    
    9097                    $C$DW$T$54      .dwtag  DW_TAG_structure_type
    9098                            .dwattr $C$DW$T$54, DW_AT_name("S4_4")
    9099                            .dwattr $C$DW$T$54, DW_AT_declaration
    9100                            .dwendtag $C$DW$T$54
    9101                    
    9102                    
    9103                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    9104                            .dwattr $C$DW$T$55, DW_AT_name("S5_5")
    9105                            .dwattr $C$DW$T$55, DW_AT_declaration
    9106                            .dwendtag $C$DW$T$55
    9107                    
    9108                    
    9109                    $C$DW$T$56      .dwtag  DW_TAG_union_type
    9110                            .dwattr $C$DW$T$56, DW_AT_name("U3_0")
    9111                            .dwattr $C$DW$T$56, DW_AT_declaration
    9112                            .dwendtag $C$DW$T$56
    9113                    
    9114                    
    9115                    $C$DW$T$57      .dwtag  DW_TAG_union_type
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3AF65006-2768-4EDD-8DF1-46923A6FC145} PAGE  167

    9116                            .dwattr $C$DW$T$57, DW_AT_name("U3_0")
    9117                            .dwattr $C$DW$T$57, DW_AT_declaration
    9118                            .dwendtag $C$DW$T$57
    9119                    
    9120                    
    9121                    $C$DW$T$58      .dwtag  DW_TAG_union_type
    9122                            .dwattr $C$DW$T$58, DW_AT_name("U4_2")
    9123                            .dwattr $C$DW$T$58, DW_AT_declaration
    9124                            .dwendtag $C$DW$T$58
    9125                    
    9126                    
    9127                    $C$DW$T$59      .dwtag  DW_TAG_union_type
    9128                            .dwattr $C$DW$T$59, DW_AT_name("U4_3")
    9129                            .dwattr $C$DW$T$59, DW_AT_declaration
    9130                            .dwendtag $C$DW$T$59
    9131                    
    9132                    
    9133                    $C$DW$T$60      .dwtag  DW_TAG_union_type
    9134                            .dwattr $C$DW$T$60, DW_AT_name("U5_4")
    9135                            .dwattr $C$DW$T$60, DW_AT_declaration
    9136                            .dwendtag $C$DW$T$60
    9137                    
    9138                    
    9139                    $C$DW$T$78      .dwtag  DW_TAG_structure_type
    9140                            .dwattr $C$DW$T$78, DW_AT_name("_Cllc_callbacks_t")
    9141                            .dwattr $C$DW$T$78, DW_AT_byte_size(0x0c)
    9142                    $C$DW$734       .dwtag  DW_TAG_member
    9143                            .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$65)
    9144                            .dwattr $C$DW$734, DW_AT_name("pStartedCb")
    9145                            .dwattr $C$DW$734, DW_AT_TI_symbol_name("pStartedCb")
    9146                            .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9147                            .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    9148                            .dwattr $C$DW$734, DW_AT_decl_file("..\Application\cllc.h")
    9149                            .dwattr $C$DW$734, DW_AT_decl_line(0xbf)
    9150                            .dwattr $C$DW$734, DW_AT_decl_column(0x16)
    9151                    
    9152                    $C$DW$735       .dwtag  DW_TAG_member
    9153                            .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$72)
    9154                            .dwattr $C$DW$735, DW_AT_name("pDeviceJoiningCb")
    9155                            .dwattr $C$DW$735, DW_AT_TI_symbol_name("pDeviceJoiningCb")
    9156                            .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9157                            .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    9158                            .dwattr $C$DW$735, DW_AT_decl_file("..\Application\cllc.h")
    9159                            .dwattr $C$DW$735, DW_AT_decl_line(0xc1)
    9160                            .dwattr $C$DW$735, DW_AT_decl_column(0x1c)
    9161                    
    9162                    $C$DW$736       .dwtag  DW_TAG_member
    9163                            .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$77)
    9164                            .dwattr $C$DW$736, DW_AT_name("pStateChangeCb")
    9165                            .dwattr $C$DW$736, DW_AT_TI_symbol_name("pStateChangeCb")
    9166                            .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9167                            .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    9168                            .dwattr $C$DW$736, DW_AT_decl_file("..\Application\cllc.h")
    9169                            .dwattr $C$DW$736, DW_AT_decl_line(0xc3)
    9170                            .dwattr $C$DW$736, DW_AT_decl_column(0x1b)
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3AF65006-2768-4EDD-8DF1-46923A6FC145} PAGE  168

    9171                    
    9172                            .dwattr $C$DW$T$78, DW_AT_decl_file("..\Application\cllc.h")
    9173                            .dwattr $C$DW$T$78, DW_AT_decl_line(0xbc)
    9174                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x10)
    9175                            .dwendtag $C$DW$T$78
    9176                    
    9177                    $C$DW$T$382     .dwtag  DW_TAG_typedef
    9178                            .dwattr $C$DW$T$382, DW_AT_name("Cllc_callbacks_t")
    9179                            .dwattr $C$DW$T$382, DW_AT_type(*$C$DW$T$78)
    9180                            .dwattr $C$DW$T$382, DW_AT_language(DW_LANG_C)
    9181                            .dwattr $C$DW$T$382, DW_AT_decl_file("..\Application\cllc.h")
    9182                            .dwattr $C$DW$T$382, DW_AT_decl_line(0xc4)
    9183                            .dwattr $C$DW$T$382, DW_AT_decl_column(0x03)
    9184                    
    9185                    $C$DW$T$383     .dwtag  DW_TAG_pointer_type
    9186                            .dwattr $C$DW$T$383, DW_AT_type(*$C$DW$T$382)
    9187                            .dwattr $C$DW$T$383, DW_AT_address_class(0x20)
    9188                    
    9189                    
    9190                    $C$DW$T$81      .dwtag  DW_TAG_structure_type
    9191                            .dwattr $C$DW$T$81, DW_AT_name("_Smsgs_broadcastcmdmsg_t")
    9192                            .dwattr $C$DW$T$81, DW_AT_byte_size(0x04)
    9193                    $C$DW$737       .dwtag  DW_TAG_member
    9194                            .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$80)
    9195                            .dwattr $C$DW$737, DW_AT_name("cmdId")
    9196                            .dwattr $C$DW$737, DW_AT_TI_symbol_name("cmdId")
    9197                            .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9198                            .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    9199                            .dwattr $C$DW$737, DW_AT_decl_file("..\Application\smsgs.h")
    9200                            .dwattr $C$DW$737, DW_AT_decl_line(0x21f)
    9201                            .dwattr $C$DW$737, DW_AT_decl_column(0x14)
    9202                    
    9203                    $C$DW$738       .dwtag  DW_TAG_member
    9204                            .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$30)
    9205                            .dwattr $C$DW$738, DW_AT_name("broadcastMsgId")
    9206                            .dwattr $C$DW$738, DW_AT_TI_symbol_name("broadcastMsgId")
    9207                            .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9208                            .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    9209                            .dwattr $C$DW$738, DW_AT_decl_file("..\Application\smsgs.h")
    9210                            .dwattr $C$DW$738, DW_AT_decl_line(0x220)
    9211                            .dwattr $C$DW$738, DW_AT_decl_column(0x0e)
    9212                    
    9213                            .dwattr $C$DW$T$81, DW_AT_decl_file("..\Application\smsgs.h")
    9214                            .dwattr $C$DW$T$81, DW_AT_decl_line(0x21c)
    9215                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x10)
    9216                            .dwendtag $C$DW$T$81
    9217                    
    9218                    $C$DW$T$385     .dwtag  DW_TAG_typedef
    9219                            .dwattr $C$DW$T$385, DW_AT_name("Smsgs_broadcastcmdmsg_t")
    9220                            .dwattr $C$DW$T$385, DW_AT_type(*$C$DW$T$81)
    9221                            .dwattr $C$DW$T$385, DW_AT_language(DW_LANG_C)
    9222                            .dwattr $C$DW$T$385, DW_AT_decl_file("..\Application\smsgs.h")
    9223                            .dwattr $C$DW$T$385, DW_AT_decl_line(0x221)
    9224                            .dwattr $C$DW$T$385, DW_AT_decl_column(0x02)
    9225                    
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3AF65006-2768-4EDD-8DF1-46923A6FC145} PAGE  169

    9226                    
    9227                    $C$DW$T$82      .dwtag  DW_TAG_structure_type
    9228                            .dwattr $C$DW$T$82, DW_AT_name("_Smsgs_configreqmsg_t")
    9229                            .dwattr $C$DW$T$82, DW_AT_byte_size(0x0c)
    9230                    $C$DW$739       .dwtag  DW_TAG_member
    9231                            .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$80)
    9232                            .dwattr $C$DW$739, DW_AT_name("cmdId")
    9233                            .dwattr $C$DW$739, DW_AT_TI_symbol_name("cmdId")
    9234                            .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9235                            .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    9236                            .dwattr $C$DW$739, DW_AT_decl_file("..\Application\smsgs.h")
    9237                            .dwattr $C$DW$739, DW_AT_decl_line(0x11e)
    9238                            .dwattr $C$DW$739, DW_AT_decl_column(0x14)
    9239                    
    9240                    $C$DW$740       .dwtag  DW_TAG_member
    9241                            .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$30)
    9242                            .dwattr $C$DW$740, DW_AT_name("frameControl")
    9243                            .dwattr $C$DW$740, DW_AT_TI_symbol_name("frameControl")
    9244                            .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9245                            .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    9246                            .dwattr $C$DW$740, DW_AT_decl_file("..\Application\smsgs.h")
    9247                            .dwattr $C$DW$740, DW_AT_decl_line(0x120)
    9248                            .dwattr $C$DW$740, DW_AT_decl_column(0x0e)
    9249                    
    9250                    $C$DW$741       .dwtag  DW_TAG_member
    9251                            .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$34)
    9252                            .dwattr $C$DW$741, DW_AT_name("reportingInterval")
    9253                            .dwattr $C$DW$741, DW_AT_TI_symbol_name("reportingInterval")
    9254                            .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9255                            .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    9256                            .dwattr $C$DW$741, DW_AT_decl_file("..\Application\smsgs.h")
    9257                            .dwattr $C$DW$741, DW_AT_decl_line(0x122)
    9258                            .dwattr $C$DW$741, DW_AT_decl_column(0x0e)
    9259                    
    9260                    $C$DW$742       .dwtag  DW_TAG_member
    9261                            .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$34)
    9262                            .dwattr $C$DW$742, DW_AT_name("pollingInterval")
    9263                            .dwattr $C$DW$742, DW_AT_TI_symbol_name("pollingInterval")
    9264                            .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9265                            .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    9266                            .dwattr $C$DW$742, DW_AT_decl_file("..\Application\smsgs.h")
    9267                            .dwattr $C$DW$742, DW_AT_decl_line(0x124)
    9268                            .dwattr $C$DW$742, DW_AT_decl_column(0x0e)
    9269                    
    9270                            .dwattr $C$DW$T$82, DW_AT_decl_file("..\Application\smsgs.h")
    9271                            .dwattr $C$DW$T$82, DW_AT_decl_line(0x11b)
    9272                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x10)
    9273                            .dwendtag $C$DW$T$82
    9274                    
    9275                    $C$DW$T$386     .dwtag  DW_TAG_typedef
    9276                            .dwattr $C$DW$T$386, DW_AT_name("Smsgs_configReqMsg_t")
    9277                            .dwattr $C$DW$T$386, DW_AT_type(*$C$DW$T$82)
    9278                            .dwattr $C$DW$T$386, DW_AT_language(DW_LANG_C)
    9279                            .dwattr $C$DW$T$386, DW_AT_decl_file("..\Application\smsgs.h")
    9280                            .dwattr $C$DW$T$386, DW_AT_decl_line(0x125)
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3AF65006-2768-4EDD-8DF1-46923A6FC145} PAGE  170

    9281                            .dwattr $C$DW$T$386, DW_AT_decl_column(0x03)
    9282                    
    9283                    
    9284                    $C$DW$T$85      .dwtag  DW_TAG_structure_type
    9285                            .dwattr $C$DW$T$85, DW_AT_name("_Smsgs_configrspmsg_t")
    9286                            .dwattr $C$DW$T$85, DW_AT_byte_size(0x0c)
    9287                    $C$DW$743       .dwtag  DW_TAG_member
    9288                            .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$80)
    9289                            .dwattr $C$DW$743, DW_AT_name("cmdId")
    9290                            .dwattr $C$DW$743, DW_AT_TI_symbol_name("cmdId")
    9291                            .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9292                            .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    9293                            .dwattr $C$DW$743, DW_AT_decl_file("..\Application\smsgs.h")
    9294                            .dwattr $C$DW$743, DW_AT_decl_line(0x12e)
    9295                            .dwattr $C$DW$743, DW_AT_decl_column(0x14)
    9296                    
    9297                    $C$DW$744       .dwtag  DW_TAG_member
    9298                            .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$84)
    9299                            .dwattr $C$DW$744, DW_AT_name("status")
    9300                            .dwattr $C$DW$744, DW_AT_TI_symbol_name("status")
    9301                            .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9302                            .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    9303                            .dwattr $C$DW$744, DW_AT_decl_file("..\Application\smsgs.h")
    9304                            .dwattr $C$DW$744, DW_AT_decl_line(0x130)
    9305                            .dwattr $C$DW$744, DW_AT_decl_column(0x1a)
    9306                    
    9307                    $C$DW$745       .dwtag  DW_TAG_member
    9308                            .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$30)
    9309                            .dwattr $C$DW$745, DW_AT_name("frameControl")
    9310                            .dwattr $C$DW$745, DW_AT_TI_symbol_name("frameControl")
    9311                            .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9312                            .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    9313                            .dwattr $C$DW$745, DW_AT_decl_file("..\Application\smsgs.h")
    9314                            .dwattr $C$DW$745, DW_AT_decl_line(0x132)
    9315                            .dwattr $C$DW$745, DW_AT_decl_column(0x0e)
    9316                    
    9317                    $C$DW$746       .dwtag  DW_TAG_member
    9318                            .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$34)
    9319                            .dwattr $C$DW$746, DW_AT_name("reportingInterval")
    9320                            .dwattr $C$DW$746, DW_AT_TI_symbol_name("reportingInterval")
    9321                            .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9322                            .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    9323                            .dwattr $C$DW$746, DW_AT_decl_file("..\Application\smsgs.h")
    9324                            .dwattr $C$DW$746, DW_AT_decl_line(0x134)
    9325                            .dwattr $C$DW$746, DW_AT_decl_column(0x0e)
    9326                    
    9327                    $C$DW$747       .dwtag  DW_TAG_member
    9328                            .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$34)
    9329                            .dwattr $C$DW$747, DW_AT_name("pollingInterval")
    9330                            .dwattr $C$DW$747, DW_AT_TI_symbol_name("pollingInterval")
    9331                            .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9332                            .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    9333                            .dwattr $C$DW$747, DW_AT_decl_file("..\Application\smsgs.h")
    9334                            .dwattr $C$DW$747, DW_AT_decl_line(0x136)
    9335                            .dwattr $C$DW$747, DW_AT_decl_column(0x0e)
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3AF65006-2768-4EDD-8DF1-46923A6FC145} PAGE  171

    9336                    
    9337                            .dwattr $C$DW$T$85, DW_AT_decl_file("..\Application\smsgs.h")
    9338                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x12b)
    9339                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x10)
    9340                            .dwendtag $C$DW$T$85
    9341                    
    9342                    $C$DW$T$387     .dwtag  DW_TAG_typedef
    9343                            .dwattr $C$DW$T$387, DW_AT_name("Smsgs_configRspMsg_t")
    9344                            .dwattr $C$DW$T$387, DW_AT_type(*$C$DW$T$85)
    9345                            .dwattr $C$DW$T$387, DW_AT_language(DW_LANG_C)
    9346                            .dwattr $C$DW$T$387, DW_AT_decl_file("..\Application\smsgs.h")
    9347                            .dwattr $C$DW$T$387, DW_AT_decl_line(0x137)
    9348                            .dwattr $C$DW$T$387, DW_AT_decl_column(0x03)
    9349                    
    9350                    $C$DW$T$388     .dwtag  DW_TAG_pointer_type
    9351                            .dwattr $C$DW$T$388, DW_AT_type(*$C$DW$T$387)
    9352                            .dwattr $C$DW$T$388, DW_AT_address_class(0x20)
    9353                    
    9354                    
    9355                    $C$DW$T$86      .dwtag  DW_TAG_structure_type
    9356                            .dwattr $C$DW$T$86, DW_AT_name("_Smsgs_configsettingsfield_t")
    9357                            .dwattr $C$DW$T$86, DW_AT_byte_size(0x08)
    9358                    $C$DW$748       .dwtag  DW_TAG_member
    9359                            .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$34)
    9360                            .dwattr $C$DW$748, DW_AT_name("reportingInterval")
    9361                            .dwattr $C$DW$748, DW_AT_TI_symbol_name("reportingInterval")
    9362                            .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9363                            .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    9364                            .dwattr $C$DW$748, DW_AT_decl_file("..\Application\smsgs.h")
    9365                            .dwattr $C$DW$748, DW_AT_decl_line(0x1ea)
    9366                            .dwattr $C$DW$748, DW_AT_decl_column(0x0e)
    9367                    
    9368                    $C$DW$749       .dwtag  DW_TAG_member
    9369                            .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$34)
    9370                            .dwattr $C$DW$749, DW_AT_name("pollingInterval")
    9371                            .dwattr $C$DW$749, DW_AT_TI_symbol_name("pollingInterval")
    9372                            .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9373                            .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    9374                            .dwattr $C$DW$749, DW_AT_decl_file("..\Application\smsgs.h")
    9375                            .dwattr $C$DW$749, DW_AT_decl_line(0x1f0)
    9376                            .dwattr $C$DW$749, DW_AT_decl_column(0x0e)
    9377                    
    9378                            .dwattr $C$DW$T$86, DW_AT_decl_file("..\Application\smsgs.h")
    9379                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x1e4)
    9380                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x10)
    9381                            .dwendtag $C$DW$T$86
    9382                    
    9383                    $C$DW$T$95      .dwtag  DW_TAG_typedef
    9384                            .dwattr $C$DW$T$95, DW_AT_name("Smsgs_configSettingsField_t")
    9385                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$86)
    9386                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    9387                            .dwattr $C$DW$T$95, DW_AT_decl_file("..\Application\smsgs.h")
    9388                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x1f1)
    9389                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x03)
    9390                    
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3AF65006-2768-4EDD-8DF1-46923A6FC145} PAGE  172

    9391                    
    9392                    $C$DW$T$87      .dwtag  DW_TAG_structure_type
    9393                            .dwattr $C$DW$T$87, DW_AT_name("_Smsgs_humiditysensorfield_t")
    9394                            .dwattr $C$DW$T$87, DW_AT_byte_size(0x04)
    9395                    $C$DW$750       .dwtag  DW_TAG_member
    9396                            .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$30)
    9397                            .dwattr $C$DW$750, DW_AT_name("temp")
    9398                            .dwattr $C$DW$750, DW_AT_TI_symbol_name("temp")
    9399                            .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9400                            .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    9401                            .dwattr $C$DW$750, DW_AT_decl_file("..\Application\smsgs.h")
    9402                            .dwattr $C$DW$750, DW_AT_decl_line(0x18c)
    9403                            .dwattr $C$DW$750, DW_AT_decl_column(0x0e)
    9404                    
    9405                    $C$DW$751       .dwtag  DW_TAG_member
    9406                            .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$30)
    9407                            .dwattr $C$DW$751, DW_AT_name("humidity")
    9408                            .dwattr $C$DW$751, DW_AT_TI_symbol_name("humidity")
    9409                            .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9410                            .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    9411                            .dwattr $C$DW$751, DW_AT_decl_file("..\Application\smsgs.h")
    9412                            .dwattr $C$DW$751, DW_AT_decl_line(0x18e)
    9413                            .dwattr $C$DW$751, DW_AT_decl_column(0x0e)
    9414                    
    9415                            .dwattr $C$DW$T$87, DW_AT_decl_file("..\Application\smsgs.h")
    9416                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x189)
    9417                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x10)
    9418                            .dwendtag $C$DW$T$87
    9419                    
    9420                    $C$DW$T$93      .dwtag  DW_TAG_typedef
    9421                            .dwattr $C$DW$T$93, DW_AT_name("Smsgs_humiditySensorField_t")
    9422                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$87)
    9423                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    9424                            .dwattr $C$DW$T$93, DW_AT_decl_file("..\Application\smsgs.h")
    9425                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x18f)
    9426                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x03)
    9427                    
    9428                    
    9429                    $C$DW$T$88      .dwtag  DW_TAG_structure_type
    9430                            .dwattr $C$DW$T$88, DW_AT_name("_Smsgs_laserHitmsg_t")
    9431                            .dwattr $C$DW$T$88, DW_AT_byte_size(0x02)
    9432                    $C$DW$752       .dwtag  DW_TAG_member
    9433                            .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$80)
    9434                            .dwattr $C$DW$752, DW_AT_name("cmdId")
    9435                            .dwattr $C$DW$752, DW_AT_TI_symbol_name("cmdId")
    9436                            .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9437                            .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    9438                            .dwattr $C$DW$752, DW_AT_decl_file("..\Application\smsgs.h")
    9439                            .dwattr $C$DW$752, DW_AT_decl_line(0x167)
    9440                            .dwattr $C$DW$752, DW_AT_decl_column(0x14)
    9441                    
    9442                    $C$DW$753       .dwtag  DW_TAG_member
    9443                            .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$24)
    9444                            .dwattr $C$DW$753, DW_AT_name("playerId")
    9445                            .dwattr $C$DW$753, DW_AT_TI_symbol_name("playerId")
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3AF65006-2768-4EDD-8DF1-46923A6FC145} PAGE  173

    9446                            .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9447                            .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    9448                            .dwattr $C$DW$753, DW_AT_decl_file("..\Application\smsgs.h")
    9449                            .dwattr $C$DW$753, DW_AT_decl_line(0x169)
    9450                            .dwattr $C$DW$753, DW_AT_decl_column(0x0d)
    9451                    
    9452                            .dwattr $C$DW$T$88, DW_AT_decl_file("..\Application\smsgs.h")
    9453                            .dwattr $C$DW$T$88, DW_AT_decl_line(0x164)
    9454                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x10)
    9455                            .dwendtag $C$DW$T$88
    9456                    
    9457                    $C$DW$T$390     .dwtag  DW_TAG_typedef
    9458                            .dwattr $C$DW$T$390, DW_AT_name("Smsgs_laserHitMsg_t")
    9459                            .dwattr $C$DW$T$390, DW_AT_type(*$C$DW$T$88)
    9460                            .dwattr $C$DW$T$390, DW_AT_language(DW_LANG_C)
    9461                            .dwattr $C$DW$T$390, DW_AT_decl_file("..\Application\smsgs.h")
    9462                            .dwattr $C$DW$T$390, DW_AT_decl_line(0x16a)
    9463                            .dwattr $C$DW$T$390, DW_AT_decl_column(0x03)
    9464                    
    9465                    
    9466                    $C$DW$T$89      .dwtag  DW_TAG_structure_type
    9467                            .dwattr $C$DW$T$89, DW_AT_name("_Smsgs_lightsensorfield_t")
    9468                            .dwattr $C$DW$T$89, DW_AT_byte_size(0x02)
    9469                    $C$DW$754       .dwtag  DW_TAG_member
    9470                            .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$30)
    9471                            .dwattr $C$DW$754, DW_AT_name("rawData")
    9472                            .dwattr $C$DW$754, DW_AT_TI_symbol_name("rawData")
    9473                            .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9474                            .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    9475                            .dwattr $C$DW$754, DW_AT_decl_file("..\Application\smsgs.h")
    9476                            .dwattr $C$DW$754, DW_AT_decl_line(0x183)
    9477                            .dwattr $C$DW$754, DW_AT_decl_column(0x0e)
    9478                    
    9479                            .dwattr $C$DW$T$89, DW_AT_decl_file("..\Application\smsgs.h")
    9480                            .dwattr $C$DW$T$89, DW_AT_decl_line(0x180)
    9481                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x10)
    9482                            .dwendtag $C$DW$T$89
    9483                    
    9484                    $C$DW$T$92      .dwtag  DW_TAG_typedef
    9485                            .dwattr $C$DW$T$92, DW_AT_name("Smsgs_lightSensorField_t")
    9486                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$89)
    9487                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    9488                            .dwattr $C$DW$T$92, DW_AT_decl_file("..\Application\smsgs.h")
    9489                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x184)
    9490                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x03)
    9491                    
    9492                    
    9493                    $C$DW$T$90      .dwtag  DW_TAG_structure_type
    9494                            .dwattr $C$DW$T$90, DW_AT_name("_Smsgs_msgstatsfield_t")
    9495                            .dwattr $C$DW$T$90, DW_AT_byte_size(0x2c)
    9496                    $C$DW$755       .dwtag  DW_TAG_member
    9497                            .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$30)
    9498                            .dwattr $C$DW$755, DW_AT_name("joinAttempts")
    9499                            .dwattr $C$DW$755, DW_AT_TI_symbol_name("joinAttempts")
    9500                            .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.4 Sat Apr 14 15:10:08 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{3AF65006-2768-4EDD-8DF1-46923A6FC145} PAGE  174

    9501                            .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    9502                            .dwattr $C$DW$755, DW_AT_decl_file("..\Application\smsgs.h")
    9503                            .dwattr $C$DW$755, DW_AT_decl_line(0x197)
    9504                            .dwattr $C$DW$755, DW_AT_decl_column(0x0e)
    9505                    
    9506                    $C$DW$756       .dwtag  DW_TAG_member
    9507                            .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$30)
    9508                            .dwattr $C$DW$756, DW_AT_name("joinFails")
    9509                            .dwattr $C$DW$756, DW_AT_TI_symbol_name("joinFails")
    9510                            .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9511                            .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    9512                            .dwattr $C$DW$756, DW_AT_decl_file("..\Application\smsgs.h")
    9513                            .dwattr $C$DW$756, DW_AT_decl_line(0x199)
    9514                            .dwattr $C$DW$756, DW_AT_decl_column(0x0e)
    9515                    
    9516                    $C$DW$757       .dwtag  DW_TAG_member
    9517                            .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$30)
    9518                            .dwattr $C$DW$757, DW_AT_name("msgsAttempted")
