TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:50 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{DC18D6BA-4494-45CB-997B-AC060EFC778A} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Sat Nov 25 18:51:49 2017                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/HighLevel/mac_security_pib.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\collector_cc1310lp\collector_cc1
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    4911                            .dwattr $C$DW$T$559, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    4912                            .dwattr $C$DW$T$559, DW_AT_decl_line(0x9f)
    4913                            .dwattr $C$DW$T$559, DW_AT_decl_column(0x01)
    4914                            .dwendtag $C$DW$T$559
    4915                    
    4916                    
    4917                    $C$DW$T$560     .dwtag  DW_TAG_enumeration_type
    4918                            .dwattr $C$DW$T$560, DW_AT_byte_size(0x01)
    4919                    $C$DW$448       .dwtag  DW_TAG_enumerator
    4920                            .dwattr $C$DW$448, DW_AT_name("MAC_FEAT_DEVICE")
    4921                            .dwattr $C$DW$448, DW_AT_const_value(0x00)
    4922                            .dwattr $C$DW$448, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4923                            .dwattr $C$DW$448, DW_AT_decl_line(0x103)
    4924                            .dwattr $C$DW$448, DW_AT_decl_column(0x03)
    4925                    
    4926                    $C$DW$449       .dwtag  DW_TAG_enumerator
    4927                            .dwattr $C$DW$449, DW_AT_name("MAC_FEAT_COORD")
    4928                            .dwattr $C$DW$449, DW_AT_const_value(0x01)
    4929                            .dwattr $C$DW$449, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4930                            .dwattr $C$DW$449, DW_AT_decl_line(0x104)
    4931                            .dwattr $C$DW$449, DW_AT_decl_column(0x03)
    4932                    
    4933                    $C$DW$450       .dwtag  DW_TAG_enumerator
    4934                            .dwattr $C$DW$450, DW_AT_name("MAC_FEAT_SECURITY")
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:50 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{DC18D6BA-4494-45CB-997B-AC060EFC778A} PAGE   91

    4935                            .dwattr $C$DW$450, DW_AT_const_value(0x02)
    4936                            .dwattr $C$DW$450, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4937                            .dwattr $C$DW$450, DW_AT_decl_line(0x105)
    4938                            .dwattr $C$DW$450, DW_AT_decl_column(0x03)
    4939                    
    4940                    $C$DW$451       .dwtag  DW_TAG_enumerator
    4941                            .dwattr $C$DW$451, DW_AT_name("MAC_FEAT_BEACON_COORD")
    4942                            .dwattr $C$DW$451, DW_AT_const_value(0x03)
    4943                            .dwattr $C$DW$451, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4944                            .dwattr $C$DW$451, DW_AT_decl_line(0x106)
    4945                            .dwattr $C$DW$451, DW_AT_decl_column(0x03)
    4946                    
    4947                    $C$DW$452       .dwtag  DW_TAG_enumerator
    4948                            .dwattr $C$DW$452, DW_AT_name("MAC_FEAT_BEACON_DEVICE")
    4949                            .dwattr $C$DW$452, DW_AT_const_value(0x04)
    4950                            .dwattr $C$DW$452, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4951                            .dwattr $C$DW$452, DW_AT_decl_line(0x107)
    4952                            .dwattr $C$DW$452, DW_AT_decl_column(0x03)
    4953                    
    4954                    $C$DW$453       .dwtag  DW_TAG_enumerator
    4955                            .dwattr $C$DW$453, DW_AT_name("MAC_FEAT_GTS_CLIENT")
    4956                            .dwattr $C$DW$453, DW_AT_const_value(0x05)
    4957                            .dwattr $C$DW$453, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4958                            .dwattr $C$DW$453, DW_AT_decl_line(0x108)
    4959                            .dwattr $C$DW$453, DW_AT_decl_column(0x03)
    4960                    
    4961                    $C$DW$454       .dwtag  DW_TAG_enumerator
    4962                            .dwattr $C$DW$454, DW_AT_name("MAC_FEAT_GTS_SERVER")
    4963                            .dwattr $C$DW$454, DW_AT_const_value(0x06)
    4964                            .dwattr $C$DW$454, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4965                            .dwattr $C$DW$454, DW_AT_decl_line(0x109)
    4966                            .dwattr $C$DW$454, DW_AT_decl_column(0x03)
    4967                    
    4968                    $C$DW$455       .dwtag  DW_TAG_enumerator
    4969                            .dwattr $C$DW$455, DW_AT_name("MAC_FEAT_MAX")
    4970                            .dwattr $C$DW$455, DW_AT_const_value(0x07)
    4971                            .dwattr $C$DW$455, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4972                            .dwattr $C$DW$455, DW_AT_decl_line(0x10a)
    4973                            .dwattr $C$DW$455, DW_AT_decl_column(0x03)
    4974                    
    4975                            .dwattr $C$DW$T$560, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154st
    4976                            .dwattr $C$DW$T$560, DW_AT_decl_line(0x102)
    4977                            .dwattr $C$DW$T$560, DW_AT_decl_column(0x01)
    4978                            .dwendtag $C$DW$T$560
    4979                    
    4980                    
    4981                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
    4982                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
    4983                    $C$DW$456       .dwtag  DW_TAG_member
    4984                            .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$19)
    4985                            .dwattr $C$DW$456, DW_AT_name("offset")
    4986                            .dwattr $C$DW$456, DW_AT_TI_symbol_name("offset")
    4987                            .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4988                            .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4989                            .dwattr $C$DW$456, DW_AT_decl_file("../Application/MAC/HighLevel/mac_security_pib.c")
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:50 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{DC18D6BA-4494-45CB-997B-AC060EFC778A} PAGE   92

    4990                            .dwattr $C$DW$456, DW_AT_decl_line(0x55)
    4991                            .dwattr $C$DW$456, DW_AT_decl_column(0x0d)
    4992                    
    4993                    $C$DW$457       .dwtag  DW_TAG_member
    4994                            .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$19)
    4995                            .dwattr $C$DW$457, DW_AT_name("len")
    4996                            .dwattr $C$DW$457, DW_AT_TI_symbol_name("len")
    4997                            .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4998                            .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4999                            .dwattr $C$DW$457, DW_AT_decl_file("../Application/MAC/HighLevel/mac_security_pib.c")
    5000                            .dwattr $C$DW$457, DW_AT_decl_line(0x56)
    5001                            .dwattr $C$DW$457, DW_AT_decl_column(0x0d)
    5002                    
    5003                    $C$DW$458       .dwtag  DW_TAG_member
    5004                            .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$19)
    5005                            .dwattr $C$DW$458, DW_AT_name("min")
    5006                            .dwattr $C$DW$458, DW_AT_TI_symbol_name("min")
    5007                            .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5008                            .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    5009                            .dwattr $C$DW$458, DW_AT_decl_file("../Application/MAC/HighLevel/mac_security_pib.c")
    5010                            .dwattr $C$DW$458, DW_AT_decl_line(0x57)
    5011                            .dwattr $C$DW$458, DW_AT_decl_column(0x0d)
    5012                    
    5013                    $C$DW$459       .dwtag  DW_TAG_member
    5014                            .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$19)
    5015                            .dwattr $C$DW$459, DW_AT_name("max")
    5016                            .dwattr $C$DW$459, DW_AT_TI_symbol_name("max")
    5017                            .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5018                            .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    5019                            .dwattr $C$DW$459, DW_AT_decl_file("../Application/MAC/HighLevel/mac_security_pib.c")
    5020                            .dwattr $C$DW$459, DW_AT_decl_line(0x58)
    5021                            .dwattr $C$DW$459, DW_AT_decl_column(0x0d)
    5022                    
    5023                            .dwattr $C$DW$T$20, DW_AT_decl_file("../Application/MAC/HighLevel/mac_security_pib.c")
    5024                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x54)
    5025                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x01)
    5026                            .dwendtag $C$DW$T$20
    5027                    
    5028                    $C$DW$T$564     .dwtag  DW_TAG_typedef
    5029                            .dwattr $C$DW$T$564, DW_AT_name("macSecurityPibTbl_t")
    5030                            .dwattr $C$DW$T$564, DW_AT_type(*$C$DW$T$20)
    5031                            .dwattr $C$DW$T$564, DW_AT_language(DW_LANG_C)
    5032                            .dwattr $C$DW$T$564, DW_AT_decl_file("../Application/MAC/HighLevel/mac_security_pib.c")
    5033                            .dwattr $C$DW$T$564, DW_AT_decl_line(0x59)
    5034                            .dwattr $C$DW$T$564, DW_AT_decl_column(0x03)
    5035                    
    5036                    $C$DW$T$565     .dwtag  DW_TAG_const_type
    5037                            .dwattr $C$DW$T$565, DW_AT_type(*$C$DW$T$564)
    5038                    
    5039                    
    5040                    $C$DW$T$566     .dwtag  DW_TAG_array_type
    5041                            .dwattr $C$DW$T$566, DW_AT_type(*$C$DW$T$565)
    5042                            .dwattr $C$DW$T$566, DW_AT_language(DW_LANG_C)
    5043                            .dwattr $C$DW$T$566, DW_AT_byte_size(0x2c)
    5044                    $C$DW$460       .dwtag  DW_TAG_subrange_type
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:50 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{DC18D6BA-4494-45CB-997B-AC060EFC778A} PAGE   93

    5045                            .dwattr $C$DW$460, DW_AT_upper_bound(0x0a)
    5046                    
    5047                            .dwendtag $C$DW$T$566
    5048                    
    5049                    
    5050                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    5051                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x0a)
    5052                    $C$DW$461       .dwtag  DW_TAG_member
    5053                            .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$190)
    5054                            .dwattr $C$DW$461, DW_AT_name("addr")
    5055                            .dwattr $C$DW$461, DW_AT_TI_symbol_name("addr")
    5056                            .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5057                            .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    5058                            .dwattr $C$DW$461, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5059                            .dwattr $C$DW$461, DW_AT_decl_line(0x52)
    5060                            .dwattr $C$DW$461, DW_AT_decl_column(0x05)
    5061                    
    5062                    $C$DW$462       .dwtag  DW_TAG_member
    5063                            .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$19)
    5064                            .dwattr $C$DW$462, DW_AT_name("addrMode")
    5065                            .dwattr $C$DW$462, DW_AT_TI_symbol_name("addrMode")
    5066                            .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5067                            .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    5068                            .dwattr $C$DW$462, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5069                            .dwattr $C$DW$462, DW_AT_decl_line(0x53)
    5070                            .dwattr $C$DW$462, DW_AT_decl_column(0x11)
    5071                    
    5072                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicatio
    5073                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x4d)
    5074                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x01)
    5075                            .dwendtag $C$DW$T$21
    5076                    
    5077                    $C$DW$T$42      .dwtag  DW_TAG_typedef
    5078                            .dwattr $C$DW$T$42, DW_AT_name("sAddr_t")
    5079                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$21)
    5080                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    5081                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicatio
    5082                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x54)
    5083                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x03)
    5084                    
    5085                    
    5086                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    5087                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x0a)
    5088                    $C$DW$463       .dwtag  DW_TAG_member
    5089                            .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$22)
    5090                            .dwattr $C$DW$463, DW_AT_name("lookupData")
    5091                            .dwattr $C$DW$463, DW_AT_TI_symbol_name("lookupData")
    5092                            .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5093                            .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    5094                            .dwattr $C$DW$463, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5095                            .dwattr $C$DW$463, DW_AT_decl_line(0x2b6)
    5096                            .dwattr $C$DW$463, DW_AT_decl_column(0x16)
    5097                    
    5098                    $C$DW$464       .dwtag  DW_TAG_member
    5099                            .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$19)
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:50 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{DC18D6BA-4494-45CB-997B-AC060EFC778A} PAGE   94

    5100                            .dwattr $C$DW$464, DW_AT_name("lookupDataSize")
    5101                            .dwattr $C$DW$464, DW_AT_TI_symbol_name("lookupDataSize")
    5102                            .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    5103                            .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    5104                            .dwattr $C$DW$464, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5105                            .dwattr $C$DW$464, DW_AT_decl_line(0x2b7)
    5106                            .dwattr $C$DW$464, DW_AT_decl_column(0x16)
    5107                    
    5108                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicatio
    5109                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x2b5)
    5110                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x01)
    5111                            .dwendtag $C$DW$T$23
    5112                    
    5113                    $C$DW$T$27      .dwtag  DW_TAG_typedef
    5114                            .dwattr $C$DW$T$27, DW_AT_name("keyIdLookupDescriptor_t")
    5115                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$23)
    5116                            .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    5117                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicatio
    5118                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x2b8)
    5119                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x03)
    5120                    
    5121                    $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    5122                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    5123                            .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
    5124                    
    5125                    
    5126                    $C$DW$T$45      .dwtag  DW_TAG_array_type
    5127                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$27)
    5128                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    5129                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x0a)
    5130                    $C$DW$465       .dwtag  DW_TAG_subrange_type
    5131                            .dwattr $C$DW$465, DW_AT_upper_bound(0x00)
    5132                    
    5133                            .dwendtag $C$DW$T$45
    5134                    
    5135                    
    5136                    $C$DW$T$46      .dwtag  DW_TAG_array_type
    5137                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$27)
    5138                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    5139                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x14)
    5140                    $C$DW$466       .dwtag  DW_TAG_subrange_type
    5141                            .dwattr $C$DW$466, DW_AT_upper_bound(0x01)
    5142                    
    5143                    $C$DW$467       .dwtag  DW_TAG_subrange_type
    5144                            .dwattr $C$DW$467, DW_AT_upper_bound(0x00)
    5145                    
    5146                            .dwendtag $C$DW$T$46
    5147                    
    5148                    
    5149                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    5150                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x03)
    5151                    $C$DW$468       .dwtag  DW_TAG_member
    5152                            .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$19)
    5153                            .dwattr $C$DW$468, DW_AT_name("deviceDescriptorHandle")
    5154                            .dwattr $C$DW$468, DW_AT_TI_symbol_name("deviceDescriptorHandle")
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:50 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{DC18D6BA-4494-45CB-997B-AC060EFC778A} PAGE   95

    5155                            .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5156                            .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    5157                            .dwattr $C$DW$468, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5158                            .dwattr $C$DW$468, DW_AT_decl_line(0x2bd)
    5159                            .dwattr $C$DW$468, DW_AT_decl_column(0x16)
    5160                    
    5161                    $C$DW$469       .dwtag  DW_TAG_member
    5162                            .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$24)
    5163                            .dwattr $C$DW$469, DW_AT_name("uniqueDevice")
    5164                            .dwattr $C$DW$469, DW_AT_TI_symbol_name("uniqueDevice")
    5165                            .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5166                            .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    5167                            .dwattr $C$DW$469, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5168                            .dwattr $C$DW$469, DW_AT_decl_line(0x2be)
    5169                            .dwattr $C$DW$469, DW_AT_decl_column(0x16)
    5170                    
    5171                    $C$DW$470       .dwtag  DW_TAG_member
    5172                            .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$24)
    5173                            .dwattr $C$DW$470, DW_AT_name("blackListed")
    5174                            .dwattr $C$DW$470, DW_AT_TI_symbol_name("blackListed")
    5175                            .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5176                            .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    5177                            .dwattr $C$DW$470, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5178                            .dwattr $C$DW$470, DW_AT_decl_line(0x2bf)
    5179                            .dwattr $C$DW$470, DW_AT_decl_column(0x16)
    5180                    
    5181                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicatio
    5182                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x2bc)
    5183                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
    5184                            .dwendtag $C$DW$T$25
    5185                    
    5186                    $C$DW$T$29      .dwtag  DW_TAG_typedef
    5187                            .dwattr $C$DW$T$29, DW_AT_name("keyDeviceDescriptor_t")
    5188                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$25)
    5189                            .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    5190                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicatio
    5191                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x2c0)
    5192                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x03)
    5193                    
    5194                    $C$DW$T$30      .dwtag  DW_TAG_pointer_type
    5195                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    5196                            .dwattr $C$DW$T$30, DW_AT_address_class(0x20)
    5197                    
    5198                    
    5199                    $C$DW$T$47      .dwtag  DW_TAG_array_type
    5200                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$29)
    5201                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    5202                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x96)
    5203                    $C$DW$471       .dwtag  DW_TAG_subrange_type
    5204                            .dwattr $C$DW$471, DW_AT_upper_bound(0x31)
    5205                    
    5206                            .dwendtag $C$DW$T$47
    5207                    
    5208                    
    5209                    $C$DW$T$48      .dwtag  DW_TAG_array_type
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:50 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{DC18D6BA-4494-45CB-997B-AC060EFC778A} PAGE   96

    5210                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$29)
    5211                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    5212                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x12c)
    5213                    $C$DW$472       .dwtag  DW_TAG_subrange_type
    5214                            .dwattr $C$DW$472, DW_AT_upper_bound(0x01)
    5215                    
    5216                    $C$DW$473       .dwtag  DW_TAG_subrange_type
    5217                            .dwattr $C$DW$473, DW_AT_upper_bound(0x31)
    5218                    
    5219                            .dwendtag $C$DW$T$48
    5220                    
    5221                    
    5222                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    5223                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    5224                    $C$DW$474       .dwtag  DW_TAG_member
    5225                            .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$19)
    5226                            .dwattr $C$DW$474, DW_AT_name("frameType")
    5227                            .dwattr $C$DW$474, DW_AT_TI_symbol_name("frameType")
    5228                            .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5229                            .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    5230                            .dwattr $C$DW$474, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5231                            .dwattr $C$DW$474, DW_AT_decl_line(0x2c5)
    5232                            .dwattr $C$DW$474, DW_AT_decl_column(0x16)
    5233                    
    5234                    $C$DW$475       .dwtag  DW_TAG_member
    5235                            .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$19)
    5236                            .dwattr $C$DW$475, DW_AT_name("cmdFrameId")
    5237                            .dwattr $C$DW$475, DW_AT_TI_symbol_name("cmdFrameId")
    5238                            .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5239                            .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    5240                            .dwattr $C$DW$475, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5241                            .dwattr $C$DW$475, DW_AT_decl_line(0x2c6)
    5242                            .dwattr $C$DW$475, DW_AT_decl_column(0x16)
    5243                    
    5244                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicatio
    5245                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x2c4)
    5246                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x01)
    5247                            .dwendtag $C$DW$T$26
    5248                    
    5249                    $C$DW$T$31      .dwtag  DW_TAG_typedef
    5250                            .dwattr $C$DW$T$31, DW_AT_name("keyUsageDescriptor_t")
    5251                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$26)
    5252                            .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    5253                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicatio
    5254                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x2c7)
    5255                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x03)
    5256                    
    5257                    $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    5258                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    5259                            .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    5260                    
    5261                    
    5262                    $C$DW$T$49      .dwtag  DW_TAG_array_type
    5263                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$31)
    5264                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:50 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{DC18D6BA-4494-45CB-997B-AC060EFC778A} PAGE   97

    5265                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x04)
    5266                    $C$DW$476       .dwtag  DW_TAG_subrange_type
    5267                            .dwattr $C$DW$476, DW_AT_upper_bound(0x01)
    5268                    
    5269                            .dwendtag $C$DW$T$49
    5270                    
    5271                    
    5272                    $C$DW$T$50      .dwtag  DW_TAG_array_type
    5273                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$31)
    5274                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    5275                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x08)
    5276                    $C$DW$477       .dwtag  DW_TAG_subrange_type
    5277                            .dwattr $C$DW$477, DW_AT_upper_bound(0x01)
    5278                    
    5279                    $C$DW$478       .dwtag  DW_TAG_subrange_type
    5280                            .dwattr $C$DW$478, DW_AT_upper_bound(0x01)
    5281                    
    5282                            .dwendtag $C$DW$T$50
    5283                    
    5284                    
    5285                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    5286                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x2c)
    5287                    $C$DW$479       .dwtag  DW_TAG_member
    5288                            .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$28)
    5289                            .dwattr $C$DW$479, DW_AT_name("keyIdLookupList")
    5290                            .dwattr $C$DW$479, DW_AT_TI_symbol_name("keyIdLookupList")
    5291                            .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5292                            .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    5293                            .dwattr $C$DW$479, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5294                            .dwattr $C$DW$479, DW_AT_decl_line(0x2cc)
    5295                            .dwattr $C$DW$479, DW_AT_decl_column(0x1d)
    5296                    
    5297                    $C$DW$480       .dwtag  DW_TAG_member
    5298                            .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$19)
    5299                            .dwattr $C$DW$480, DW_AT_name("keyIdLookupEntries")
    5300                            .dwattr $C$DW$480, DW_AT_TI_symbol_name("keyIdLookupEntries")
    5301                            .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5302                            .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    5303                            .dwattr $C$DW$480, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5304                            .dwattr $C$DW$480, DW_AT_decl_line(0x2cd)
    5305                            .dwattr $C$DW$480, DW_AT_decl_column(0x1c)
    5306                    
    5307                    $C$DW$481       .dwtag  DW_TAG_member
    5308                            .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$30)
    5309                            .dwattr $C$DW$481, DW_AT_name("keyDeviceList")
    5310                            .dwattr $C$DW$481, DW_AT_TI_symbol_name("keyDeviceList")
    5311                            .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5312                            .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    5313                            .dwattr $C$DW$481, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5314                            .dwattr $C$DW$481, DW_AT_decl_line(0x2cf)
    5315                            .dwattr $C$DW$481, DW_AT_decl_column(0x1d)
    5316                    
    5317                    $C$DW$482       .dwtag  DW_TAG_member
    5318                            .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$19)
    5319                            .dwattr $C$DW$482, DW_AT_name("keyDeviceListEntries")
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:50 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{DC18D6BA-4494-45CB-997B-AC060EFC778A} PAGE   98

    5320                            .dwattr $C$DW$482, DW_AT_TI_symbol_name("keyDeviceListEntries")
    5321                            .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5322                            .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    5323                            .dwattr $C$DW$482, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5324                            .dwattr $C$DW$482, DW_AT_decl_line(0x2d2)
    5325                            .dwattr $C$DW$482, DW_AT_decl_column(0x1c)
    5326                    
    5327                    $C$DW$483       .dwtag  DW_TAG_member
    5328                            .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$32)
    5329                            .dwattr $C$DW$483, DW_AT_name("keyUsageList")
    5330                            .dwattr $C$DW$483, DW_AT_TI_symbol_name("keyUsageList")
    5331                            .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5332                            .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    5333                            .dwattr $C$DW$483, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5334                            .dwattr $C$DW$483, DW_AT_decl_line(0x2d4)
    5335                            .dwattr $C$DW$483, DW_AT_decl_column(0x1d)
    5336                    
    5337                    $C$DW$484       .dwtag  DW_TAG_member
    5338                            .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$19)
    5339                            .dwattr $C$DW$484, DW_AT_name("keyUsageListEntries")
    5340                            .dwattr $C$DW$484, DW_AT_TI_symbol_name("keyUsageListEntries")
    5341                            .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5342                            .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    5343                            .dwattr $C$DW$484, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5344                            .dwattr $C$DW$484, DW_AT_decl_line(0x2d6)
    5345                            .dwattr $C$DW$484, DW_AT_decl_column(0x1c)
    5346                    
    5347                    $C$DW$485       .dwtag  DW_TAG_member
    5348                            .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$33)
    5349                            .dwattr $C$DW$485, DW_AT_name("key")
    5350                            .dwattr $C$DW$485, DW_AT_TI_symbol_name("key")
    5351                            .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    5352                            .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    5353                            .dwattr $C$DW$485, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5354                            .dwattr $C$DW$485, DW_AT_decl_line(0x2d8)
    5355                            .dwattr $C$DW$485, DW_AT_decl_column(0x1c)
    5356                    
    5357                    $C$DW$486       .dwtag  DW_TAG_member
    5358                            .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$34)
    5359                            .dwattr $C$DW$486, DW_AT_name("frameCounter")
    5360                            .dwattr $C$DW$486, DW_AT_TI_symbol_name("frameCounter")
    5361                            .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5362                            .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    5363                            .dwattr $C$DW$486, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5364                            .dwattr $C$DW$486, DW_AT_decl_line(0x2d9)
    5365                            .dwattr $C$DW$486, DW_AT_decl_column(0x1c)
    5366                    
    5367                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicatio
    5368                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x2cb)
    5369                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x01)
    5370                            .dwendtag $C$DW$T$35
    5371                    
    5372                    $C$DW$T$43      .dwtag  DW_TAG_typedef
    5373                            .dwattr $C$DW$T$43, DW_AT_name("keyDescriptor_t")
    5374                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$35)
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:50 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{DC18D6BA-4494-45CB-997B-AC060EFC778A} PAGE   99

    5375                            .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    5376                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicatio
    5377                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x2dc)
    5378                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x03)
    5379                    
    5380                    
    5381                    $C$DW$T$44      .dwtag  DW_TAG_array_type
    5382                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    5383                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    5384                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x58)
    5385                    $C$DW$487       .dwtag  DW_TAG_subrange_type
    5386                            .dwattr $C$DW$487, DW_AT_upper_bound(0x01)
    5387                    
    5388                            .dwendtag $C$DW$T$44
    5389                    
    5390                    $C$DW$T$127     .dwtag  DW_TAG_pointer_type
    5391                            .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$43)
    5392                            .dwattr $C$DW$T$127, DW_AT_address_class(0x20)
    5393                    
    5394                    
    5395                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    5396                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x18)
    5397                    $C$DW$488       .dwtag  DW_TAG_member
    5398                            .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$36)
    5399                            .dwattr $C$DW$488, DW_AT_name("panID")
    5400                            .dwattr $C$DW$488, DW_AT_TI_symbol_name("panID")
    5401                            .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5402                            .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    5403                            .dwattr $C$DW$488, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5404                            .dwattr $C$DW$488, DW_AT_decl_line(0x2e1)
    5405                            .dwattr $C$DW$488, DW_AT_decl_column(0x16)
    5406                    
    5407                    $C$DW$489       .dwtag  DW_TAG_member
    5408                            .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$36)
    5409                            .dwattr $C$DW$489, DW_AT_name("shortAddress")
    5410                            .dwattr $C$DW$489, DW_AT_TI_symbol_name("shortAddress")
    5411                            .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5412                            .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    5413                            .dwattr $C$DW$489, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5414                            .dwattr $C$DW$489, DW_AT_decl_line(0x2e2)
    5415                            .dwattr $C$DW$489, DW_AT_decl_column(0x16)
    5416                    
    5417                    $C$DW$490       .dwtag  DW_TAG_member
    5418                            .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$38)
    5419                            .dwattr $C$DW$490, DW_AT_name("extAddress")
    5420                            .dwattr $C$DW$490, DW_AT_TI_symbol_name("extAddress")
    5421                            .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5422                            .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    5423                            .dwattr $C$DW$490, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5424                            .dwattr $C$DW$490, DW_AT_decl_line(0x2e3)
    5425                            .dwattr $C$DW$490, DW_AT_decl_column(0x16)
    5426                    
    5427                    $C$DW$491       .dwtag  DW_TAG_member
    5428                            .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$39)
    5429                            .dwattr $C$DW$491, DW_AT_name("frameCounter")
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:50 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{DC18D6BA-4494-45CB-997B-AC060EFC778A} PAGE  100

    5430                            .dwattr $C$DW$491, DW_AT_TI_symbol_name("frameCounter")
    5431                            .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5432                            .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    5433                            .dwattr $C$DW$491, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5434                            .dwattr $C$DW$491, DW_AT_decl_line(0x2e7)
    5435                            .dwattr $C$DW$491, DW_AT_decl_column(0x16)
    5436                    
    5437                    $C$DW$492       .dwtag  DW_TAG_member
    5438                            .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$24)
    5439                            .dwattr $C$DW$492, DW_AT_name("exempt")
    5440                            .dwattr $C$DW$492, DW_AT_TI_symbol_name("exempt")
    5441                            .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5442                            .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    5443                            .dwattr $C$DW$492, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5444                            .dwattr $C$DW$492, DW_AT_decl_line(0x2eb)
    5445                            .dwattr $C$DW$492, DW_AT_decl_column(0x16)
    5446                    
    5447                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicatio
    5448                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x2e0)
    5449                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x01)
    5450                            .dwendtag $C$DW$T$40
    5451                    
    5452                    $C$DW$T$51      .dwtag  DW_TAG_typedef
    5453                            .dwattr $C$DW$T$51, DW_AT_name("deviceDescriptor_t")
    5454                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$40)
    5455                            .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    5456                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicatio
    5457                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x2ed)
    5458                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x03)
    5459                    
    5460                    
    5461                    $C$DW$T$52      .dwtag  DW_TAG_array_type
    5462                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    5463                            .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    5464                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x4b0)
    5465                    $C$DW$493       .dwtag  DW_TAG_subrange_type
    5466                            .dwattr $C$DW$493, DW_AT_upper_bound(0x31)
    5467                    
    5468                            .dwendtag $C$DW$T$52
    5469                    
    5470                    
    5471                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    5472                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    5473                    $C$DW$494       .dwtag  DW_TAG_member
    5474                            .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$19)
    5475                            .dwattr $C$DW$494, DW_AT_name("frameType")
    5476                            .dwattr $C$DW$494, DW_AT_TI_symbol_name("frameType")
    5477                            .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5478                            .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    5479                            .dwattr $C$DW$494, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5480                            .dwattr $C$DW$494, DW_AT_decl_line(0x2f2)
    5481                            .dwattr $C$DW$494, DW_AT_decl_column(0x16)
    5482                    
    5483                    $C$DW$495       .dwtag  DW_TAG_member
    5484                            .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$19)
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:50 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{DC18D6BA-4494-45CB-997B-AC060EFC778A} PAGE  101

    5485                            .dwattr $C$DW$495, DW_AT_name("commandFrameIdentifier")
    5486                            .dwattr $C$DW$495, DW_AT_TI_symbol_name("commandFrameIdentifier")
    5487                            .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5488                            .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    5489                            .dwattr $C$DW$495, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5490                            .dwattr $C$DW$495, DW_AT_decl_line(0x2f3)
    5491                            .dwattr $C$DW$495, DW_AT_decl_column(0x16)
    5492                    
    5493                    $C$DW$496       .dwtag  DW_TAG_member
    5494                            .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$19)
    5495                            .dwattr $C$DW$496, DW_AT_name("securityMinimum")
    5496                            .dwattr $C$DW$496, DW_AT_TI_symbol_name("securityMinimum")
    5497                            .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5498                            .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    5499                            .dwattr $C$DW$496, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5500                            .dwattr $C$DW$496, DW_AT_decl_line(0x2f4)
    5501                            .dwattr $C$DW$496, DW_AT_decl_column(0x16)
    5502                    
    5503                    $C$DW$497       .dwtag  DW_TAG_member
    5504                            .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$24)
    5505                            .dwattr $C$DW$497, DW_AT_name("securityOverrideSecurityMinimum")
    5506                            .dwattr $C$DW$497, DW_AT_TI_symbol_name("securityOverrideSecurityMinimum")
    5507                            .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5508                            .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    5509                            .dwattr $C$DW$497, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5510                            .dwattr $C$DW$497, DW_AT_decl_line(0x2f6)
    5511                            .dwattr $C$DW$497, DW_AT_decl_column(0x16)
    5512                    
    5513                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicatio
    5514                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x2f1)
    5515                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    5516                            .dwendtag $C$DW$T$41
    5517                    
    5518                    $C$DW$T$53      .dwtag  DW_TAG_typedef
    5519                            .dwattr $C$DW$T$53, DW_AT_name("securityLevelDescriptor_t")
    5520                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$41)
    5521                            .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    5522                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicatio
    5523                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x2ff)
    5524                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x03)
    5525                    
    5526                    
    5527                    $C$DW$T$54      .dwtag  DW_TAG_array_type
    5528                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    5529                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    5530                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x08)
    5531                    $C$DW$498       .dwtag  DW_TAG_subrange_type
    5532                            .dwattr $C$DW$498, DW_AT_upper_bound(0x01)
    5533                    
    5534                            .dwendtag $C$DW$T$54
    5535                    
    5536                    
    5537                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    5538                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x67c)
    5539                    $C$DW$499       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:50 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{DC18D6BA-4494-45CB-997B-AC060EFC778A} PAGE  102

    5540                            .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$19)
    5541                            .dwattr $C$DW$499, DW_AT_name("keyTableEntries")
    5542                            .dwattr $C$DW$499, DW_AT_TI_symbol_name("keyTableEntries")
    5543                            .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5544                            .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    5545                            .dwattr $C$DW$499, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5546                            .dwattr $C$DW$499, DW_AT_decl_line(0x62)
    5547                            .dwattr $C$DW$499, DW_AT_decl_column(0x16)
    5548                    
    5549                    $C$DW$500       .dwtag  DW_TAG_member
    5550                            .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$19)
    5551                            .dwattr $C$DW$500, DW_AT_name("deviceTableEntries")
    5552                            .dwattr $C$DW$500, DW_AT_TI_symbol_name("deviceTableEntries")
    5553                            .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5554                            .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    5555                            .dwattr $C$DW$500, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5556                            .dwattr $C$DW$500, DW_AT_decl_line(0x63)
    5557                            .dwattr $C$DW$500, DW_AT_decl_column(0x16)
    5558                    
    5559                    $C$DW$501       .dwtag  DW_TAG_member
    5560                            .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$19)
    5561                            .dwattr $C$DW$501, DW_AT_name("securityLevelTableEntries")
    5562                            .dwattr $C$DW$501, DW_AT_TI_symbol_name("securityLevelTableEntries")
    5563                            .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5564                            .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    5565                            .dwattr $C$DW$501, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5566                            .dwattr $C$DW$501, DW_AT_decl_line(0x64)
    5567                            .dwattr $C$DW$501, DW_AT_decl_column(0x16)
    5568                    
    5569                    $C$DW$502       .dwtag  DW_TAG_member
    5570                            .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$19)
    5571                            .dwattr $C$DW$502, DW_AT_name("autoRequestSecurityLevel")
    5572                            .dwattr $C$DW$502, DW_AT_TI_symbol_name("autoRequestSecurityLevel")
    5573                            .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5574                            .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    5575                            .dwattr $C$DW$502, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5576                            .dwattr $C$DW$502, DW_AT_decl_line(0x66)
    5577                            .dwattr $C$DW$502, DW_AT_decl_column(0x16)
    5578                    
    5579                    $C$DW$503       .dwtag  DW_TAG_member
    5580                            .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$19)
    5581                            .dwattr $C$DW$503, DW_AT_name("autoRequestKeyIdMode")
    5582                            .dwattr $C$DW$503, DW_AT_TI_symbol_name("autoRequestKeyIdMode")
    5583                            .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5584                            .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    5585                            .dwattr $C$DW$503, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5586                            .dwattr $C$DW$503, DW_AT_decl_line(0x67)
    5587                            .dwattr $C$DW$503, DW_AT_decl_column(0x16)
    5588                    
    5589                    $C$DW$504       .dwtag  DW_TAG_member
    5590                            .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$37)
    5591                            .dwattr $C$DW$504, DW_AT_name("autoRequestKeySource")
    5592                            .dwattr $C$DW$504, DW_AT_TI_symbol_name("autoRequestKeySource")
    5593                            .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5594                            .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:50 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{DC18D6BA-4494-45CB-997B-AC060EFC778A} PAGE  103

    5595                            .dwattr $C$DW$504, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5596                            .dwattr $C$DW$504, DW_AT_decl_line(0x68)
    5597                            .dwattr $C$DW$504, DW_AT_decl_column(0x16)
    5598                    
    5599                    $C$DW$505       .dwtag  DW_TAG_member
    5600                            .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$19)
    5601                            .dwattr $C$DW$505, DW_AT_name("autoRequestKeyIndex")
    5602                            .dwattr $C$DW$505, DW_AT_TI_symbol_name("autoRequestKeyIndex")
    5603                            .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5604                            .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    5605                            .dwattr $C$DW$505, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5606                            .dwattr $C$DW$505, DW_AT_decl_line(0x69)
    5607                            .dwattr $C$DW$505, DW_AT_decl_column(0x16)
    5608                    
    5609                    $C$DW$506       .dwtag  DW_TAG_member
    5610                            .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$37)
    5611                            .dwattr $C$DW$506, DW_AT_name("defaultKeySource")
    5612                            .dwattr $C$DW$506, DW_AT_TI_symbol_name("defaultKeySource")
    5613                            .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5614                            .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    5615                            .dwattr $C$DW$506, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5616                            .dwattr $C$DW$506, DW_AT_decl_line(0x6b)
    5617                            .dwattr $C$DW$506, DW_AT_decl_column(0x16)
    5618                    
    5619                    $C$DW$507       .dwtag  DW_TAG_member
    5620                            .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$42)
    5621                            .dwattr $C$DW$507, DW_AT_name("panCoordExtendedAddress")
    5622                            .dwattr $C$DW$507, DW_AT_TI_symbol_name("panCoordExtendedAddress")
    5623                            .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5624                            .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    5625                            .dwattr $C$DW$507, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5626                            .dwattr $C$DW$507, DW_AT_decl_line(0x6c)
    5627                            .dwattr $C$DW$507, DW_AT_decl_column(0x16)
    5628                    
    5629                    $C$DW$508       .dwtag  DW_TAG_member
    5630                            .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$36)
    5631                            .dwattr $C$DW$508, DW_AT_name("panCoordShortAddress")
    5632                            .dwattr $C$DW$508, DW_AT_TI_symbol_name("panCoordShortAddress")
    5633                            .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5634                            .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    5635                            .dwattr $C$DW$508, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5636                            .dwattr $C$DW$508, DW_AT_decl_line(0x6d)
    5637                            .dwattr $C$DW$508, DW_AT_decl_column(0x16)
    5638                    
    5639                    $C$DW$509       .dwtag  DW_TAG_member
    5640                            .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$44)
    5641                            .dwattr $C$DW$509, DW_AT_name("macKeyTable")
    5642                            .dwattr $C$DW$509, DW_AT_TI_symbol_name("macKeyTable")
    5643                            .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    5644                            .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    5645                            .dwattr $C$DW$509, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5646                            .dwattr $C$DW$509, DW_AT_decl_line(0x70)
    5647                            .dwattr $C$DW$509, DW_AT_decl_column(0x1e)
    5648                    
    5649                    $C$DW$510       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:50 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{DC18D6BA-4494-45CB-997B-AC060EFC778A} PAGE  104

    5650                            .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$46)
    5651                            .dwattr $C$DW$510, DW_AT_name("macKeyIdLookupList")
    5652                            .dwattr $C$DW$510, DW_AT_TI_symbol_name("macKeyIdLookupList")
    5653                            .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    5654                            .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    5655                            .dwattr $C$DW$510, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5656                            .dwattr $C$DW$510, DW_AT_decl_line(0x71)
    5657                            .dwattr $C$DW$510, DW_AT_decl_column(0x1e)
    5658                    
    5659                    $C$DW$511       .dwtag  DW_TAG_member
    5660                            .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$48)
    5661                            .dwattr $C$DW$511, DW_AT_name("macKeyDeviceList")
    5662                            .dwattr $C$DW$511, DW_AT_TI_symbol_name("macKeyDeviceList")
    5663                            .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    5664                            .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    5665                            .dwattr $C$DW$511, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5666                            .dwattr $C$DW$511, DW_AT_decl_line(0x72)
    5667                            .dwattr $C$DW$511, DW_AT_decl_column(0x1e)
    5668                    
    5669                    $C$DW$512       .dwtag  DW_TAG_member
    5670                            .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$50)
    5671                            .dwattr $C$DW$512, DW_AT_name("macKeyUsageList")
    5672                            .dwattr $C$DW$512, DW_AT_TI_symbol_name("macKeyUsageList")
    5673                            .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x1bc]
    5674                            .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    5675                            .dwattr $C$DW$512, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5676                            .dwattr $C$DW$512, DW_AT_decl_line(0x73)
    5677                            .dwattr $C$DW$512, DW_AT_decl_column(0x1e)
    5678                    
    5679                    $C$DW$513       .dwtag  DW_TAG_member
    5680                            .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$52)
    5681                            .dwattr $C$DW$513, DW_AT_name("macDeviceTable")
    5682                            .dwattr $C$DW$513, DW_AT_TI_symbol_name("macDeviceTable")
    5683                            .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c4]
    5684                            .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    5685                            .dwattr $C$DW$513, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5686                            .dwattr $C$DW$513, DW_AT_decl_line(0x74)
    5687                            .dwattr $C$DW$513, DW_AT_decl_column(0x1e)
    5688                    
    5689                    $C$DW$514       .dwtag  DW_TAG_member
    5690                            .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$54)
    5691                            .dwattr $C$DW$514, DW_AT_name("macSecurityLevelTable")
    5692                            .dwattr $C$DW$514, DW_AT_TI_symbol_name("macSecurityLevelTable")
    5693                            .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x674]
    5694                            .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    5695                            .dwattr $C$DW$514, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5696                            .dwattr $C$DW$514, DW_AT_decl_line(0x75)
    5697                            .dwattr $C$DW$514, DW_AT_decl_column(0x1e)
    5698                    
    5699                            .dwattr $C$DW$T$55, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5700                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x61)
    5701                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x01)
    5702                            .dwendtag $C$DW$T$55
    5703                    
    5704                    $C$DW$T$589     .dwtag  DW_TAG_typedef
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:50 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{DC18D6BA-4494-45CB-997B-AC060EFC778A} PAGE  105

    5705                            .dwattr $C$DW$T$589, DW_AT_name("macSecurityPib_t")
    5706                            .dwattr $C$DW$T$589, DW_AT_type(*$C$DW$T$55)
    5707                            .dwattr $C$DW$T$589, DW_AT_language(DW_LANG_C)
    5708                            .dwattr $C$DW$T$589, DW_AT_decl_file("..\Application\MAC\HighLevel\mac_security_pib.h")
    5709                            .dwattr $C$DW$T$589, DW_AT_decl_line(0x77)
    5710                            .dwattr $C$DW$T$589, DW_AT_decl_column(0x03)
    5711                    
    5712                    
    5713                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    5714                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x0c)
    5715                    $C$DW$515       .dwtag  DW_TAG_member
    5716                            .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$19)
    5717                            .dwattr $C$DW$515, DW_AT_name("key_index")
    5718                            .dwattr $C$DW$515, DW_AT_TI_symbol_name("key_index")
    5719                            .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5720                            .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    5721                            .dwattr $C$DW$515, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5722                            .dwattr $C$DW$515, DW_AT_decl_line(0x304)
    5723                            .dwattr $C$DW$515, DW_AT_decl_column(0x1b)
    5724                    
    5725                    $C$DW$516       .dwtag  DW_TAG_member
    5726                            .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$19)
    5727                            .dwattr $C$DW$516, DW_AT_name("key_id_lookup_index")
    5728                            .dwattr $C$DW$516, DW_AT_TI_symbol_name("key_id_lookup_index")
    5729                            .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5730                            .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    5731                            .dwattr $C$DW$516, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5732                            .dwattr $C$DW$516, DW_AT_decl_line(0x305)
    5733                            .dwattr $C$DW$516, DW_AT_decl_column(0x1b)
    5734                    
    5735                    $C$DW$517       .dwtag  DW_TAG_member
    5736                            .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$27)
    5737                            .dwattr $C$DW$517, DW_AT_name("macKeyIdLookupEntry")
    5738                            .dwattr $C$DW$517, DW_AT_TI_symbol_name("macKeyIdLookupEntry")
    5739                            .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5740                            .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    5741                            .dwattr $C$DW$517, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5742                            .dwattr $C$DW$517, DW_AT_decl_line(0x306)
    5743                            .dwattr $C$DW$517, DW_AT_decl_column(0x1b)
    5744                    
    5745                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicatio
    5746                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x303)
    5747                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x01)
    5748                            .dwendtag $C$DW$T$56
    5749                    
    5750                    $C$DW$T$591     .dwtag  DW_TAG_typedef
    5751                            .dwattr $C$DW$T$591, DW_AT_name("macSecurityPibKeyIdLookupEntry_t")
    5752                            .dwattr $C$DW$T$591, DW_AT_type(*$C$DW$T$56)
    5753                            .dwattr $C$DW$T$591, DW_AT_language(DW_LANG_C)
    5754                            .dwattr $C$DW$T$591, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicati
    5755                            .dwattr $C$DW$T$591, DW_AT_decl_line(0x307)
    5756                            .dwattr $C$DW$T$591, DW_AT_decl_column(0x03)
    5757                    
    5758                    
    5759                    $C$DW$T$57      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:50 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{DC18D6BA-4494-45CB-997B-AC060EFC778A} PAGE  106

    5760                            .dwattr $C$DW$T$57, DW_AT_byte_size(0x05)
    5761                    $C$DW$518       .dwtag  DW_TAG_member
    5762                            .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$19)
    5763                            .dwattr $C$DW$518, DW_AT_name("key_index")
    5764                            .dwattr $C$DW$518, DW_AT_TI_symbol_name("key_index")
    5765                            .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5766                            .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    5767                            .dwattr $C$DW$518, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5768                            .dwattr $C$DW$518, DW_AT_decl_line(0x30b)
    5769                            .dwattr $C$DW$518, DW_AT_decl_column(0x1b)
    5770                    
    5771                    $C$DW$519       .dwtag  DW_TAG_member
    5772                            .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$19)
    5773                            .dwattr $C$DW$519, DW_AT_name("key_device_index")
    5774                            .dwattr $C$DW$519, DW_AT_TI_symbol_name("key_device_index")
    5775                            .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5776                            .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    5777                            .dwattr $C$DW$519, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5778                            .dwattr $C$DW$519, DW_AT_decl_line(0x30c)
    5779                            .dwattr $C$DW$519, DW_AT_decl_column(0x1b)
    5780                    
    5781                    $C$DW$520       .dwtag  DW_TAG_member
    5782                            .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$29)
    5783                            .dwattr $C$DW$520, DW_AT_name("macKeyDeviceEntry")
    5784                            .dwattr $C$DW$520, DW_AT_TI_symbol_name("macKeyDeviceEntry")
    5785                            .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5786                            .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    5787                            .dwattr $C$DW$520, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5788                            .dwattr $C$DW$520, DW_AT_decl_line(0x30d)
    5789                            .dwattr $C$DW$520, DW_AT_decl_column(0x1b)
    5790                    
    5791                            .dwattr $C$DW$T$57, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicatio
    5792                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x30a)
    5793                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x01)
    5794                            .dwendtag $C$DW$T$57
    5795                    
    5796                    $C$DW$T$593     .dwtag  DW_TAG_typedef
    5797                            .dwattr $C$DW$T$593, DW_AT_name("macSecurityPibKeyDeviceEntry_t")
    5798                            .dwattr $C$DW$T$593, DW_AT_type(*$C$DW$T$57)
    5799                            .dwattr $C$DW$T$593, DW_AT_language(DW_LANG_C)
    5800                            .dwattr $C$DW$T$593, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicati
    5801                            .dwattr $C$DW$T$593, DW_AT_decl_line(0x30e)
    5802                            .dwattr $C$DW$T$593, DW_AT_decl_column(0x03)
    5803                    
    5804                    
    5805                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
    5806                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x04)
    5807                    $C$DW$521       .dwtag  DW_TAG_member
    5808                            .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$19)
    5809                            .dwattr $C$DW$521, DW_AT_name("key_index")
    5810                            .dwattr $C$DW$521, DW_AT_TI_symbol_name("key_index")
    5811                            .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5812                            .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    5813                            .dwattr $C$DW$521, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5814                            .dwattr $C$DW$521, DW_AT_decl_line(0x312)
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:50 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{DC18D6BA-4494-45CB-997B-AC060EFC778A} PAGE  107

    5815                            .dwattr $C$DW$521, DW_AT_decl_column(0x1b)
    5816                    
    5817                    $C$DW$522       .dwtag  DW_TAG_member
    5818                            .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$19)
    5819                            .dwattr $C$DW$522, DW_AT_name("key_key_usage_index")
    5820                            .dwattr $C$DW$522, DW_AT_TI_symbol_name("key_key_usage_index")
    5821                            .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5822                            .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    5823                            .dwattr $C$DW$522, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5824                            .dwattr $C$DW$522, DW_AT_decl_line(0x313)
    5825                            .dwattr $C$DW$522, DW_AT_decl_column(0x1b)
    5826                    
    5827                    $C$DW$523       .dwtag  DW_TAG_member
    5828                            .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$31)
    5829                            .dwattr $C$DW$523, DW_AT_name("macKeyUsageEntry")
    5830                            .dwattr $C$DW$523, DW_AT_TI_symbol_name("macKeyUsageEntry")
    5831                            .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5832                            .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    5833                            .dwattr $C$DW$523, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5834                            .dwattr $C$DW$523, DW_AT_decl_line(0x314)
    5835                            .dwattr $C$DW$523, DW_AT_decl_column(0x1b)
    5836                    
    5837                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicatio
    5838                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x311)
    5839                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x01)
    5840                            .dwendtag $C$DW$T$58
    5841                    
    5842                    $C$DW$T$595     .dwtag  DW_TAG_typedef
    5843                            .dwattr $C$DW$T$595, DW_AT_name("macSecurityPibKeyUsageEntry_t")
    5844                            .dwattr $C$DW$T$595, DW_AT_type(*$C$DW$T$58)
    5845                            .dwattr $C$DW$T$595, DW_AT_language(DW_LANG_C)
    5846                            .dwattr $C$DW$T$595, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicati
    5847                            .dwattr $C$DW$T$595, DW_AT_decl_line(0x315)
    5848                            .dwattr $C$DW$T$595, DW_AT_decl_column(0x03)
    5849                    
    5850                    
    5851                    $C$DW$T$59      .dwtag  DW_TAG_structure_type
    5852                            .dwattr $C$DW$T$59, DW_AT_byte_size(0x18)
    5853                    $C$DW$524       .dwtag  DW_TAG_member
    5854                            .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$19)
    5855                            .dwattr $C$DW$524, DW_AT_name("key_index")
    5856                            .dwattr $C$DW$524, DW_AT_TI_symbol_name("key_index")
    5857                            .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5858                            .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    5859                            .dwattr $C$DW$524, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5860                            .dwattr $C$DW$524, DW_AT_decl_line(0x319)
    5861                            .dwattr $C$DW$524, DW_AT_decl_column(0x1b)
    5862                    
    5863                    $C$DW$525       .dwtag  DW_TAG_member
    5864                            .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$33)
    5865                            .dwattr $C$DW$525, DW_AT_name("keyEntry")
    5866                            .dwattr $C$DW$525, DW_AT_TI_symbol_name("keyEntry")
    5867                            .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5868                            .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    5869                            .dwattr $C$DW$525, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:50 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{DC18D6BA-4494-45CB-997B-AC060EFC778A} PAGE  108

    5870                            .dwattr $C$DW$525, DW_AT_decl_line(0x31a)
    5871                            .dwattr $C$DW$525, DW_AT_decl_column(0x1b)
    5872                    
    5873                    $C$DW$526       .dwtag  DW_TAG_member
    5874                            .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$34)
    5875                            .dwattr $C$DW$526, DW_AT_name("frameCounter")
    5876                            .dwattr $C$DW$526, DW_AT_TI_symbol_name("frameCounter")
    5877                            .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5878                            .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    5879                            .dwattr $C$DW$526, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5880                            .dwattr $C$DW$526, DW_AT_decl_line(0x31b)
    5881                            .dwattr $C$DW$526, DW_AT_decl_column(0x1b)
    5882                    
    5883                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicatio
    5884                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x318)
    5885                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    5886                            .dwendtag $C$DW$T$59
    5887                    
    5888                    $C$DW$T$597     .dwtag  DW_TAG_typedef
    5889                            .dwattr $C$DW$T$597, DW_AT_name("macSecurityPibKeyEntry_t")
    5890                            .dwattr $C$DW$T$597, DW_AT_type(*$C$DW$T$59)
    5891                            .dwattr $C$DW$T$597, DW_AT_language(DW_LANG_C)
    5892                            .dwattr $C$DW$T$597, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicati
    5893                            .dwattr $C$DW$T$597, DW_AT_decl_line(0x31c)
    5894                            .dwattr $C$DW$T$597, DW_AT_decl_column(0x03)
    5895                    
    5896                    
    5897                    $C$DW$T$60      .dwtag  DW_TAG_structure_type
    5898                            .dwattr $C$DW$T$60, DW_AT_byte_size(0x1c)
    5899                    $C$DW$527       .dwtag  DW_TAG_member
    5900                            .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$19)
    5901                            .dwattr $C$DW$527, DW_AT_name("device_index")
    5902                            .dwattr $C$DW$527, DW_AT_TI_symbol_name("device_index")
    5903                            .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5904                            .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    5905                            .dwattr $C$DW$527, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5906                            .dwattr $C$DW$527, DW_AT_decl_line(0x320)
    5907                            .dwattr $C$DW$527, DW_AT_decl_column(0x1b)
    5908                    
    5909                    $C$DW$528       .dwtag  DW_TAG_member
    5910                            .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$51)
    5911                            .dwattr $C$DW$528, DW_AT_name("macDeviceEntry")
    5912                            .dwattr $C$DW$528, DW_AT_TI_symbol_name("macDeviceEntry")
    5913                            .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5914                            .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    5915                            .dwattr $C$DW$528, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5916                            .dwattr $C$DW$528, DW_AT_decl_line(0x321)
    5917                            .dwattr $C$DW$528, DW_AT_decl_column(0x1b)
    5918                    
    5919                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicatio
    5920                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x31f)
    5921                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x01)
    5922                            .dwendtag $C$DW$T$60
    5923                    
    5924                    $C$DW$T$599     .dwtag  DW_TAG_typedef
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:50 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{DC18D6BA-4494-45CB-997B-AC060EFC778A} PAGE  109

    5925                            .dwattr $C$DW$T$599, DW_AT_name("macSecurityPibDeviceEntry_t")
    5926                            .dwattr $C$DW$T$599, DW_AT_type(*$C$DW$T$60)
    5927                            .dwattr $C$DW$T$599, DW_AT_language(DW_LANG_C)
    5928                            .dwattr $C$DW$T$599, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicati
    5929                            .dwattr $C$DW$T$599, DW_AT_decl_line(0x322)
    5930                            .dwattr $C$DW$T$599, DW_AT_decl_column(0x03)
    5931                    
    5932                    
    5933                    $C$DW$T$61      .dwtag  DW_TAG_structure_type
    5934                            .dwattr $C$DW$T$61, DW_AT_byte_size(0x05)
    5935                    $C$DW$529       .dwtag  DW_TAG_member
    5936                            .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$19)
    5937                            .dwattr $C$DW$529, DW_AT_name("security_level_index")
    5938                            .dwattr $C$DW$529, DW_AT_TI_symbol_name("security_level_index")
    5939                            .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5940                            .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    5941                            .dwattr $C$DW$529, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5942                            .dwattr $C$DW$529, DW_AT_decl_line(0x326)
    5943                            .dwattr $C$DW$529, DW_AT_decl_column(0x1f)
    5944                    
    5945                    $C$DW$530       .dwtag  DW_TAG_member
    5946                            .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$53)
    5947                            .dwattr $C$DW$530, DW_AT_name("macSecurityLevelEntry")
    5948                            .dwattr $C$DW$530, DW_AT_TI_symbol_name("macSecurityLevelEntry")
    5949                            .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5950                            .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    5951                            .dwattr $C$DW$530, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    5952                            .dwattr $C$DW$530, DW_AT_decl_line(0x327)
    5953                            .dwattr $C$DW$530, DW_AT_decl_column(0x1f)
    5954                    
    5955                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicatio
    5956                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x325)
    5957                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x01)
    5958                            .dwendtag $C$DW$T$61
    5959                    
    5960                    $C$DW$T$601     .dwtag  DW_TAG_typedef
    5961                            .dwattr $C$DW$T$601, DW_AT_name("macSecurityPibSecurityLevelEntry_t")
    5962                            .dwattr $C$DW$T$601, DW_AT_type(*$C$DW$T$61)
    5963                            .dwattr $C$DW$T$601, DW_AT_language(DW_LANG_C)
    5964                            .dwattr $C$DW$T$601, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicati
    5965                            .dwattr $C$DW$T$601, DW_AT_decl_line(0x328)
    5966                            .dwattr $C$DW$T$601, DW_AT_decl_column(0x03)
    5967                    
    5968                    
    5969                    $C$DW$T$103     .dwtag  DW_TAG_structure_type
    5970                            .dwattr $C$DW$T$103, DW_AT_byte_size(0x4c)
    5971                    $C$DW$531       .dwtag  DW_TAG_member
    5972                            .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$67)
    5973                            .dwattr $C$DW$531, DW_AT_name("Crc32")
    5974                            .dwattr $C$DW$531, DW_AT_TI_symbol_name("Crc32")
    5975                            .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5976                            .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    5977                            .dwattr $C$DW$531, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    5978                            .dwattr $C$DW$531, DW_AT_decl_line(0x76)
    5979                            .dwattr $C$DW$531, DW_AT_decl_column(0x25)
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:50 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{DC18D6BA-4494-45CB-997B-AC060EFC778A} PAGE  110

    5980                    
    5981                    $C$DW$532       .dwtag  DW_TAG_member
    5982                            .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$70)
    5983                            .dwattr $C$DW$532, DW_AT_name("FlashGetSize")
    5984                            .dwattr $C$DW$532, DW_AT_TI_symbol_name("FlashGetSize")
    5985                            .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5986                            .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    5987                            .dwattr $C$DW$532, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    5988                            .dwattr $C$DW$532, DW_AT_decl_line(0x77)
    5989                            .dwattr $C$DW$532, DW_AT_decl_column(0x25)
    5990                    
    5991                    $C$DW$533       .dwtag  DW_TAG_member
    5992                            .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$71)
    5993                            .dwattr $C$DW$533, DW_AT_name("GetChipId")
    5994                            .dwattr $C$DW$533, DW_AT_TI_symbol_name("GetChipId")
    5995                            .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5996                            .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    5997                            .dwattr $C$DW$533, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    5998                            .dwattr $C$DW$533, DW_AT_decl_line(0x78)
    5999                            .dwattr $C$DW$533, DW_AT_decl_column(0x25)
    6000                    
    6001                    $C$DW$534       .dwtag  DW_TAG_member
    6002                            .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$74)
    6003                            .dwattr $C$DW$534, DW_AT_name("ReservedLocation1")
    6004                            .dwattr $C$DW$534, DW_AT_TI_symbol_name("ReservedLocation1")
    6005                            .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6006                            .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    6007                            .dwattr $C$DW$534, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6008                            .dwattr $C$DW$534, DW_AT_decl_line(0x79)
    6009                            .dwattr $C$DW$534, DW_AT_decl_column(0x25)
    6010                    
    6011                    $C$DW$535       .dwtag  DW_TAG_member
    6012                            .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$75)
    6013                            .dwattr $C$DW$535, DW_AT_name("ReservedLocation2")
    6014                            .dwattr $C$DW$535, DW_AT_TI_symbol_name("ReservedLocation2")
    6015                            .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6016                            .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    6017                            .dwattr $C$DW$535, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6018                            .dwattr $C$DW$535, DW_AT_decl_line(0x7a)
    6019                            .dwattr $C$DW$535, DW_AT_decl_column(0x25)
    6020                    
    6021                    $C$DW$536       .dwtag  DW_TAG_member
    6022                            .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$76)
    6023                            .dwattr $C$DW$536, DW_AT_name("ReservedLocation3")
    6024                            .dwattr $C$DW$536, DW_AT_TI_symbol_name("ReservedLocation3")
    6025                            .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6026                            .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    6027                            .dwattr $C$DW$536, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6028                            .dwattr $C$DW$536, DW_AT_decl_line(0x7b)
    6029                            .dwattr $C$DW$536, DW_AT_decl_column(0x25)
    6030                    
    6031                    $C$DW$537       .dwtag  DW_TAG_member
    6032                            .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$79)
    6033                            .dwattr $C$DW$537, DW_AT_name("ResetDevice")
    6034                            .dwattr $C$DW$537, DW_AT_TI_symbol_name("ResetDevice")
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:50 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{DC18D6BA-4494-45CB-997B-AC060EFC778A} PAGE  111

    6035                            .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6036                            .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    6037                            .dwattr $C$DW$537, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6038                            .dwattr $C$DW$537, DW_AT_decl_line(0x7c)
    6039                            .dwattr $C$DW$537, DW_AT_decl_column(0x25)
    6040                    
    6041                    $C$DW$538       .dwtag  DW_TAG_member
    6042                            .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$84)
    6043                            .dwattr $C$DW$538, DW_AT_name("Fletcher32")
    6044                            .dwattr $C$DW$538, DW_AT_TI_symbol_name("Fletcher32")
    6045                            .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6046                            .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    6047                            .dwattr $C$DW$538, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6048                            .dwattr $C$DW$538, DW_AT_decl_line(0x7d)
    6049                            .dwattr $C$DW$538, DW_AT_decl_column(0x25)
    6050                    
    6051                    $C$DW$539       .dwtag  DW_TAG_member
    6052                            .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$88)
    6053                            .dwattr $C$DW$539, DW_AT_name("MinValue")
    6054                            .dwattr $C$DW$539, DW_AT_TI_symbol_name("MinValue")
    6055                            .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6056                            .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    6057                            .dwattr $C$DW$539, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6058                            .dwattr $C$DW$539, DW_AT_decl_line(0x7e)
    6059                            .dwattr $C$DW$539, DW_AT_decl_column(0x25)
    6060                    
    6061                    $C$DW$540       .dwtag  DW_TAG_member
    6062                            .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$89)
    6063                            .dwattr $C$DW$540, DW_AT_name("MaxValue")
    6064                            .dwattr $C$DW$540, DW_AT_TI_symbol_name("MaxValue")
    6065                            .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6066                            .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    6067                            .dwattr $C$DW$540, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6068                            .dwattr $C$DW$540, DW_AT_decl_line(0x7f)
    6069                            .dwattr $C$DW$540, DW_AT_decl_column(0x25)
    6070                    
    6071                    $C$DW$541       .dwtag  DW_TAG_member
    6072                            .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$90)
    6073                            .dwattr $C$DW$541, DW_AT_name("MeanValue")
    6074                            .dwattr $C$DW$541, DW_AT_TI_symbol_name("MeanValue")
    6075                            .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6076                            .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    6077                            .dwattr $C$DW$541, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6078                            .dwattr $C$DW$541, DW_AT_decl_line(0x80)
    6079                            .dwattr $C$DW$541, DW_AT_decl_column(0x25)
    6080                    
    6081                    $C$DW$542       .dwtag  DW_TAG_member
    6082                            .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$91)
    6083                            .dwattr $C$DW$542, DW_AT_name("StandDeviationValue")
    6084                            .dwattr $C$DW$542, DW_AT_TI_symbol_name("StandDeviationValue")
    6085                            .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    6086                            .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    6087                            .dwattr $C$DW$542, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6088                            .dwattr $C$DW$542, DW_AT_decl_line(0x81)
    6089                            .dwattr $C$DW$542, DW_AT_decl_column(0x25)
TI ARM Assembler PC v16.9.4 Sat Nov 25 18:51:50 2017

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{DC18D6BA-4494-45CB-997B-AC060EFC778A} PAGE  112

    6090                    
    6091                    $C$DW$543       .dwtag  DW_TAG_member
    6092                            .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$94)
    6093                            .dwattr $C$DW$543, DW_AT_name("ReservedLocation4")
    6094                            .dwattr $C$DW$543, DW_AT_TI_symbol_name("ReservedLocation4")
    6095                            .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    6096                            .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    6097                            .dwattr $C$DW$543, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    6098                            .dwattr $C$DW$543, DW_AT_decl_line(0x82)
    6099                            .dwattr $C$DW$543, DW_AT_decl_column(0x25)
    6100                    
    6101                    $C$DW$544       .dwtag  DW_TAG_member
