TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E74AC829-0798-4F01-A406-D828C0940CAB} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.4.LTS *
       3                    ;* Date/Time created: Thu Mar 08 21:09:43 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/StartUp/osaltasks.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.4.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Kevin\workspace_v7\collector_cc1310lp\collector_cc1
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    3817                            .dwattr $C$DW$389, DW_AT_const_value(0x08)
    3818                            .dwattr $C$DW$389, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3819                            .dwattr $C$DW$389, DW_AT_decl_line(0xa8)
    3820                            .dwattr $C$DW$389, DW_AT_decl_column(0x05)
    3821                    
    3822                    $C$DW$390       .dwtag  DW_TAG_enumerator
    3823                            .dwattr $C$DW$390, DW_AT_name("FAPI_VALIDATE_SECTOR")
    3824                            .dwattr $C$DW$390, DW_AT_const_value(0x0e)
    3825                            .dwattr $C$DW$390, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3826                            .dwattr $C$DW$390, DW_AT_decl_line(0xa9)
    3827                            .dwattr $C$DW$390, DW_AT_decl_column(0x05)
    3828                    
    3829                    $C$DW$391       .dwtag  DW_TAG_enumerator
    3830                            .dwattr $C$DW$391, DW_AT_name("FAPI_CLEAR_STATUS")
    3831                            .dwattr $C$DW$391, DW_AT_const_value(0x10)
    3832                            .dwattr $C$DW$391, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3833                            .dwattr $C$DW$391, DW_AT_decl_line(0xaa)
    3834                            .dwattr $C$DW$391, DW_AT_decl_column(0x05)
    3835                    
    3836                    $C$DW$392       .dwtag  DW_TAG_enumerator
    3837                            .dwattr $C$DW$392, DW_AT_name("FAPI_PROGRAM_RESUME")
    3838                            .dwattr $C$DW$392, DW_AT_const_value(0x14)
    3839                            .dwattr $C$DW$392, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3840                            .dwattr $C$DW$392, DW_AT_decl_line(0xab)
    3841                            .dwattr $C$DW$392, DW_AT_decl_column(0x05)
    3842                    
    3843                    $C$DW$393       .dwtag  DW_TAG_enumerator
    3844                            .dwattr $C$DW$393, DW_AT_name("FAPI_ERASE_RESUME")
    3845                            .dwattr $C$DW$393, DW_AT_const_value(0x16)
    3846                            .dwattr $C$DW$393, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3847                            .dwattr $C$DW$393, DW_AT_decl_line(0xac)
    3848                            .dwattr $C$DW$393, DW_AT_decl_column(0x05)
    3849                    
    3850                    $C$DW$394       .dwtag  DW_TAG_enumerator
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E74AC829-0798-4F01-A406-D828C0940CAB} PAGE   71

    3851                            .dwattr $C$DW$394, DW_AT_name("FAPI_CLEAR_MORE")
    3852                            .dwattr $C$DW$394, DW_AT_const_value(0x18)
    3853                            .dwattr $C$DW$394, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3854                            .dwattr $C$DW$394, DW_AT_decl_line(0xad)
    3855                            .dwattr $C$DW$394, DW_AT_decl_column(0x05)
    3856                    
    3857                    $C$DW$395       .dwtag  DW_TAG_enumerator
    3858                            .dwattr $C$DW$395, DW_AT_name("FAPI_PROGRAM_SECTOR")
    3859                            .dwattr $C$DW$395, DW_AT_const_value(0x20)
    3860                            .dwattr $C$DW$395, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3861                            .dwattr $C$DW$395, DW_AT_decl_line(0xae)
    3862                            .dwattr $C$DW$395, DW_AT_decl_column(0x05)
    3863                    
    3864                    $C$DW$396       .dwtag  DW_TAG_enumerator
    3865                            .dwattr $C$DW$396, DW_AT_name("FAPI_ERASE_OTP")
    3866                            .dwattr $C$DW$396, DW_AT_const_value(0x30)
    3867                            .dwattr $C$DW$396, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    3868                            .dwattr $C$DW$396, DW_AT_decl_line(0xaf)
    3869                            .dwattr $C$DW$396, DW_AT_decl_column(0x05)
    3870                    
    3871                            .dwattr $C$DW$T$1018, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/device
    3872                            .dwattr $C$DW$T$1018, DW_AT_decl_line(0xa5)
    3873                            .dwattr $C$DW$T$1018, DW_AT_decl_column(0x01)
    3874                            .dwendtag $C$DW$T$1018
    3875                    
    3876                    $C$DW$T$1019    .dwtag  DW_TAG_typedef
    3877                            .dwattr $C$DW$T$1019, DW_AT_name("tFlashStateCommandsType")
    3878                            .dwattr $C$DW$T$1019, DW_AT_type(*$C$DW$T$1018)
    3879                            .dwattr $C$DW$T$1019, DW_AT_language(DW_LANG_C)
    3880                            .dwattr $C$DW$T$1019, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/device
    3881                            .dwattr $C$DW$T$1019, DW_AT_decl_line(0xb0)
    3882                            .dwattr $C$DW$T$1019, DW_AT_decl_column(0x03)
    3883                    
    3884                    
    3885                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    3886                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    3887                    $C$DW$397       .dwtag  DW_TAG_member
    3888                            .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$19)
    3889                            .dwattr $C$DW$397, DW_AT_name("rfMode")
    3890                            .dwattr $C$DW$397, DW_AT_TI_symbol_name("rfMode")
    3891                            .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3892                            .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3893                            .dwattr $C$DW$397, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    3894                            .dwattr $C$DW$397, DW_AT_decl_line(0x2b7)
    3895                            .dwattr $C$DW$397, DW_AT_decl_column(0x0d)
    3896                    
    3897                    $C$DW$398       .dwtag  DW_TAG_member
    3898                            .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$21)
    3899                            .dwattr $C$DW$398, DW_AT_name("cpePatchFxn")
    3900                            .dwattr $C$DW$398, DW_AT_TI_symbol_name("cpePatchFxn")
    3901                            .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3902                            .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3903                            .dwattr $C$DW$398, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    3904                            .dwattr $C$DW$398, DW_AT_decl_line(0x2b8)
    3905                            .dwattr $C$DW$398, DW_AT_decl_column(0x0c)
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E74AC829-0798-4F01-A406-D828C0940CAB} PAGE   72

    3906                    
    3907                    $C$DW$399       .dwtag  DW_TAG_member
    3908                            .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$21)
    3909                            .dwattr $C$DW$399, DW_AT_name("mcePatchFxn")
    3910                            .dwattr $C$DW$399, DW_AT_TI_symbol_name("mcePatchFxn")
    3911                            .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3912                            .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3913                            .dwattr $C$DW$399, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    3914                            .dwattr $C$DW$399, DW_AT_decl_line(0x2b9)
    3915                            .dwattr $C$DW$399, DW_AT_decl_column(0x0c)
    3916                    
    3917                    $C$DW$400       .dwtag  DW_TAG_member
    3918                            .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$21)
    3919                            .dwattr $C$DW$400, DW_AT_name("rfePatchFxn")
    3920                            .dwattr $C$DW$400, DW_AT_TI_symbol_name("rfePatchFxn")
    3921                            .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3922                            .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3923                            .dwattr $C$DW$400, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/r
    3924                            .dwattr $C$DW$400, DW_AT_decl_line(0x2ba)
    3925                            .dwattr $C$DW$400, DW_AT_decl_column(0x0c)
    3926                    
    3927                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/
    3928                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x2b6)
    3929                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    3930                            .dwendtag $C$DW$T$22
    3931                    
    3932                    $C$DW$T$32      .dwtag  DW_TAG_typedef
    3933                            .dwattr $C$DW$T$32, DW_AT_name("RF_Mode")
    3934                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$22)
    3935                            .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    3936                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/drivers/
    3937                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x2bb)
    3938                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x03)
    3939                    
    3940                    $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    3941                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    3942                            .dwattr $C$DW$T$33, DW_AT_address_class(0x20)
    3943                    
    3944                    
    3945                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3946                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x03)
    3947                    $C$DW$401       .dwtag  DW_TAG_member
    3948                            .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$23)
    3949                            .dwattr $C$DW$401, DW_AT_name("Pout")
    3950                            .dwattr $C$DW$401, DW_AT_TI_symbol_name("Pout")
    3951                            .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3952                            .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3953                            .dwattr $C$DW$401, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    3954                            .dwattr $C$DW$401, DW_AT_decl_line(0x12f)
    3955                            .dwattr $C$DW$401, DW_AT_decl_column(0x0a)
    3956                    
    3957                    $C$DW$402       .dwtag  DW_TAG_member
    3958                            .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$24)
    3959                            .dwattr $C$DW$402, DW_AT_name("txPwrVal")
    3960                            .dwattr $C$DW$402, DW_AT_TI_symbol_name("txPwrVal")
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E74AC829-0798-4F01-A406-D828C0940CAB} PAGE   73

    3961                            .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3962                            .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3963                            .dwattr $C$DW$402, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    3964                            .dwattr $C$DW$402, DW_AT_decl_line(0x130)
    3965                            .dwattr $C$DW$402, DW_AT_decl_column(0x0a)
    3966                    
    3967                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicatio
    3968                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x12e)
    3969                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
    3970                            .dwendtag $C$DW$T$25
    3971                    
    3972                    $C$DW$T$26      .dwtag  DW_TAG_const_type
    3973                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    3974                    
    3975                    $C$DW$T$27      .dwtag  DW_TAG_typedef
    3976                            .dwattr $C$DW$T$27, DW_AT_name("txPwrVal_t")
    3977                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    3978                            .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    3979                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicatio
    3980                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x131)
    3981                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x03)
    3982                    
    3983                    $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    3984                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    3985                            .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
    3986                    
    3987                    
    3988                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3989                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x05)
    3990                    $C$DW$403       .dwtag  DW_TAG_member
    3991                            .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$28)
    3992                            .dwattr $C$DW$403, DW_AT_name("pTxPwrVals")
    3993                            .dwattr $C$DW$403, DW_AT_TI_symbol_name("pTxPwrVals")
    3994                            .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3995                            .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3996                            .dwattr $C$DW$403, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    3997                            .dwattr $C$DW$403, DW_AT_decl_line(0x135)
    3998                            .dwattr $C$DW$403, DW_AT_decl_column(0x0f)
    3999                    
    4000                    $C$DW$404       .dwtag  DW_TAG_member
    4001                            .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$29)
    4002                            .dwattr $C$DW$404, DW_AT_name("numTxPwrVals")
    4003                            .dwattr $C$DW$404, DW_AT_TI_symbol_name("numTxPwrVals")
    4004                            .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4005                            .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    4006                            .dwattr $C$DW$404, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4007                            .dwattr $C$DW$404, DW_AT_decl_line(0x136)
    4008                            .dwattr $C$DW$404, DW_AT_decl_column(0x0f)
    4009                    
    4010                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicatio
    4011                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x134)
    4012                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x01)
    4013                            .dwendtag $C$DW$T$30
    4014                    
    4015                    $C$DW$T$35      .dwtag  DW_TAG_const_type
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E74AC829-0798-4F01-A406-D828C0940CAB} PAGE   74

    4016                            .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$30)
    4017                    
    4018                    $C$DW$T$36      .dwtag  DW_TAG_typedef
    4019                            .dwattr $C$DW$T$36, DW_AT_name("txPwrTbl_t")
    4020                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    4021                            .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    4022                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicatio
    4023                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x137)
    4024                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x03)
    4025                    
    4026                    $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    4027                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    4028                            .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
    4029                    
    4030                    
    4031                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    4032                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x38)
    4033                    $C$DW$405       .dwtag  DW_TAG_member
    4034                            .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$31)
    4035                            .dwattr $C$DW$405, DW_AT_name("getHwRevision")
    4036                            .dwattr $C$DW$405, DW_AT_TI_symbol_name("getHwRevision")
    4037                            .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4038                            .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    4039                            .dwattr $C$DW$405, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4040                            .dwattr $C$DW$405, DW_AT_decl_line(0x143)
    4041                            .dwattr $C$DW$405, DW_AT_decl_column(0x1c)
    4042                    
    4043                    $C$DW$406       .dwtag  DW_TAG_member
    4044                            .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$33)
    4045                            .dwattr $C$DW$406, DW_AT_name("pRfPropTable")
    4046                            .dwattr $C$DW$406, DW_AT_TI_symbol_name("pRfPropTable")
    4047                            .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4048                            .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    4049                            .dwattr $C$DW$406, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4050                            .dwattr $C$DW$406, DW_AT_decl_line(0x144)
    4051                            .dwattr $C$DW$406, DW_AT_decl_column(0x1d)
    4052                    
    4053                    $C$DW$407       .dwtag  DW_TAG_member
    4054                            .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$34)
    4055                            .dwattr $C$DW$407, DW_AT_name("pRfDrvTblPtr")
    4056                            .dwattr $C$DW$407, DW_AT_TI_symbol_name("pRfDrvTblPtr")
    4057                            .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4058                            .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    4059                            .dwattr $C$DW$407, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4060                            .dwattr $C$DW$407, DW_AT_decl_line(0x145)
    4061                            .dwattr $C$DW$407, DW_AT_decl_column(0x1d)
    4062                    
    4063                    $C$DW$408       .dwtag  DW_TAG_member
    4064                            .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$34)
    4065                            .dwattr $C$DW$408, DW_AT_name("pCryptoDrvTblPtr")
    4066                            .dwattr $C$DW$408, DW_AT_TI_symbol_name("pCryptoDrvTblPtr")
    4067                            .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4068                            .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    4069                            .dwattr $C$DW$408, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4070                            .dwattr $C$DW$408, DW_AT_decl_line(0x146)
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E74AC829-0798-4F01-A406-D828C0940CAB} PAGE   75

    4071                            .dwattr $C$DW$408, DW_AT_decl_column(0x1d)
    4072                    
    4073                    $C$DW$409       .dwtag  DW_TAG_member
    4074                            .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$37)
    4075                            .dwattr $C$DW$409, DW_AT_name("pTxPwrTbl")
    4076                            .dwattr $C$DW$409, DW_AT_TI_symbol_name("pTxPwrTbl")
    4077                            .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4078                            .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4079                            .dwattr $C$DW$409, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4080                            .dwattr $C$DW$409, DW_AT_decl_line(0x147)
    4081                            .dwattr $C$DW$409, DW_AT_decl_column(0x1d)
    4082                    
    4083                    $C$DW$410       .dwtag  DW_TAG_member
    4084                            .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$37)
    4085                            .dwattr $C$DW$410, DW_AT_name("pTxPwrTblRe")
    4086                            .dwattr $C$DW$410, DW_AT_TI_symbol_name("pTxPwrTblRe")
    4087                            .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4088                            .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    4089                            .dwattr $C$DW$410, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4090                            .dwattr $C$DW$410, DW_AT_decl_line(0x148)
    4091                            .dwattr $C$DW$410, DW_AT_decl_column(0x1d)
    4092                    
    4093                    $C$DW$411       .dwtag  DW_TAG_member
    4094                            .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$38)
    4095                            .dwattr $C$DW$411, DW_AT_name("pOverrides")
    4096                            .dwattr $C$DW$411, DW_AT_TI_symbol_name("pOverrides")
    4097                            .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4098                            .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    4099                            .dwattr $C$DW$411, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4100                            .dwattr $C$DW$411, DW_AT_decl_line(0x149)
    4101                            .dwattr $C$DW$411, DW_AT_decl_column(0x1e)
    4102                    
    4103                    $C$DW$412       .dwtag  DW_TAG_member
    4104                            .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$38)
    4105                            .dwattr $C$DW$412, DW_AT_name("pOverridesRe")
    4106                            .dwattr $C$DW$412, DW_AT_TI_symbol_name("pOverridesRe")
    4107                            .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4108                            .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    4109                            .dwattr $C$DW$412, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4110                            .dwattr $C$DW$412, DW_AT_decl_line(0x14a)
    4111                            .dwattr $C$DW$412, DW_AT_decl_column(0x1e)
    4112                    
    4113                    $C$DW$413       .dwtag  DW_TAG_member
    4114                            .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$39)
    4115                            .dwattr $C$DW$413, DW_AT_name("pLoDivider")
    4116                            .dwattr $C$DW$413, DW_AT_TI_symbol_name("pLoDivider")
    4117                            .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4118                            .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    4119                            .dwattr $C$DW$413, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4120                            .dwattr $C$DW$413, DW_AT_decl_line(0x14b)
    4121                            .dwattr $C$DW$413, DW_AT_decl_column(0x1d)
    4122                    
    4123                    $C$DW$414       .dwtag  DW_TAG_member
    4124                            .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$19)
    4125                            .dwattr $C$DW$414, DW_AT_name("rfFeModeBias")
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E74AC829-0798-4F01-A406-D828C0940CAB} PAGE   76

    4126                            .dwattr $C$DW$414, DW_AT_TI_symbol_name("rfFeModeBias")
    4127                            .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4128                            .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    4129                            .dwattr $C$DW$414, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4130                            .dwattr $C$DW$414, DW_AT_decl_line(0x14c)
    4131                            .dwattr $C$DW$414, DW_AT_decl_column(0x1c)
    4132                    
    4133                    $C$DW$415       .dwtag  DW_TAG_member
    4134                            .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$19)
    4135                            .dwattr $C$DW$415, DW_AT_name("phyId")
    4136                            .dwattr $C$DW$415, DW_AT_TI_symbol_name("phyId")
    4137                            .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    4138                            .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    4139                            .dwattr $C$DW$415, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4140                            .dwattr $C$DW$415, DW_AT_decl_line(0x14d)
    4141                            .dwattr $C$DW$415, DW_AT_decl_column(0x1c)
    4142                    
    4143                    $C$DW$416       .dwtag  DW_TAG_member
    4144                            .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$19)
    4145                            .dwattr $C$DW$416, DW_AT_name("last")
    4146                            .dwattr $C$DW$416, DW_AT_TI_symbol_name("last")
    4147                            .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4148                            .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    4149                            .dwattr $C$DW$416, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4150                            .dwattr $C$DW$416, DW_AT_decl_line(0x14e)
    4151                            .dwattr $C$DW$416, DW_AT_decl_column(0x1c)
    4152                    
    4153                    $C$DW$417       .dwtag  DW_TAG_member
    4154                            .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$42)
    4155                            .dwattr $C$DW$417, DW_AT_name("pSetRE")
    4156                            .dwattr $C$DW$417, DW_AT_TI_symbol_name("pSetRE")
    4157                            .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4158                            .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4159                            .dwattr $C$DW$417, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4160                            .dwattr $C$DW$417, DW_AT_decl_line(0x14f)
    4161                            .dwattr $C$DW$417, DW_AT_decl_column(0x1c)
    4162                    
    4163                    $C$DW$418       .dwtag  DW_TAG_member
    4164                            .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$43)
    4165                            .dwattr $C$DW$418, DW_AT_name("pAssertFP")
    4166                            .dwattr $C$DW$418, DW_AT_TI_symbol_name("pAssertFP")
    4167                            .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4168                            .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4169                            .dwattr $C$DW$418, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4170                            .dwattr $C$DW$418, DW_AT_decl_line(0x150)
    4171                            .dwattr $C$DW$418, DW_AT_decl_column(0x1c)
    4172                    
    4173                    $C$DW$419       .dwtag  DW_TAG_member
    4174                            .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$44)
    4175                            .dwattr $C$DW$419, DW_AT_name("pAntSwitchFP")
    4176                            .dwattr $C$DW$419, DW_AT_TI_symbol_name("pAntSwitchFP")
    4177                            .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4178                            .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4179                            .dwattr $C$DW$419, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4180                            .dwattr $C$DW$419, DW_AT_decl_line(0x151)
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E74AC829-0798-4F01-A406-D828C0940CAB} PAGE   77

    4181                            .dwattr $C$DW$419, DW_AT_decl_column(0x1c)
    4182                    
    4183                    $C$DW$420       .dwtag  DW_TAG_member
    4184                            .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$47)
    4185                            .dwattr $C$DW$420, DW_AT_name("pAntPwrFP")
    4186                            .dwattr $C$DW$420, DW_AT_TI_symbol_name("pAntPwrFP")
    4187                            .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4188                            .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4189                            .dwattr $C$DW$420, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4190                            .dwattr $C$DW$420, DW_AT_decl_line(0x152)
    4191                            .dwattr $C$DW$420, DW_AT_decl_column(0x1c)
    4192                    
    4193                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicatio
    4194                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x142)
    4195                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x01)
    4196                            .dwendtag $C$DW$T$48
    4197                    
    4198                    $C$DW$T$1021    .dwtag  DW_TAG_typedef
    4199                            .dwattr $C$DW$T$1021, DW_AT_name("macUserCfg_t")
    4200                            .dwattr $C$DW$T$1021, DW_AT_type(*$C$DW$T$48)
    4201                            .dwattr $C$DW$T$1021, DW_AT_language(DW_LANG_C)
    4202                            .dwattr $C$DW$T$1021, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicat
    4203                            .dwattr $C$DW$T$1021, DW_AT_decl_line(0x15a)
    4204                            .dwattr $C$DW$T$1021, DW_AT_decl_column(0x03)
    4205                    
    4206                    $C$DW$T$1022    .dwtag  DW_TAG_pointer_type
    4207                            .dwattr $C$DW$T$1022, DW_AT_type(*$C$DW$T$1021)
    4208                            .dwattr $C$DW$T$1022, DW_AT_address_class(0x20)
    4209                    
    4210                    
    4211                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
    4212                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x08)
    4213                    $C$DW$421       .dwtag  DW_TAG_member
    4214                            .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$10)
    4215                            .dwattr $C$DW$421, DW_AT_name("quot")
    4216                            .dwattr $C$DW$421, DW_AT_TI_symbol_name("quot")
    4217                            .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4218                            .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4219                            .dwattr $C$DW$421, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    4220                            .dwattr $C$DW$421, DW_AT_decl_line(0x5c)
    4221                            .dwattr $C$DW$421, DW_AT_decl_column(0x16)
    4222                    
    4223                    $C$DW$422       .dwtag  DW_TAG_member
    4224                            .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$10)
    4225                            .dwattr $C$DW$422, DW_AT_name("rem")
    4226                            .dwattr $C$DW$422, DW_AT_TI_symbol_name("rem")
    4227                            .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4228                            .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4229                            .dwattr $C$DW$422, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    4230                            .dwattr $C$DW$422, DW_AT_decl_line(0x5c)
    4231                            .dwattr $C$DW$422, DW_AT_decl_column(0x1c)
    4232                    
    4233                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
    4234                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x5c)
    4235                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x10)
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E74AC829-0798-4F01-A406-D828C0940CAB} PAGE   78

    4236                            .dwendtag $C$DW$T$49
    4237                    
    4238                    $C$DW$T$1023    .dwtag  DW_TAG_typedef
    4239                            .dwattr $C$DW$T$1023, DW_AT_name("div_t")
    4240                            .dwattr $C$DW$T$1023, DW_AT_type(*$C$DW$T$49)
    4241                            .dwattr $C$DW$T$1023, DW_AT_language(DW_LANG_C)
    4242                            .dwattr $C$DW$T$1023, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/includ
    4243                            .dwattr $C$DW$T$1023, DW_AT_decl_line(0x5c)
    4244                            .dwattr $C$DW$T$1023, DW_AT_decl_column(0x23)
    4245                    
    4246                    
    4247                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    4248                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x08)
    4249                    $C$DW$423       .dwtag  DW_TAG_member
    4250                            .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$10)
    4251                            .dwattr $C$DW$423, DW_AT_name("quot")
    4252                            .dwattr $C$DW$423, DW_AT_TI_symbol_name("quot")
    4253                            .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4254                            .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4255                            .dwattr $C$DW$423, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    4256                            .dwattr $C$DW$423, DW_AT_decl_line(0x5e)
    4257                            .dwattr $C$DW$423, DW_AT_decl_column(0x16)
    4258                    
    4259                    $C$DW$424       .dwtag  DW_TAG_member
    4260                            .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$10)
    4261                            .dwattr $C$DW$424, DW_AT_name("rem")
    4262                            .dwattr $C$DW$424, DW_AT_TI_symbol_name("rem")
    4263                            .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4264                            .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4265                            .dwattr $C$DW$424, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    4266                            .dwattr $C$DW$424, DW_AT_decl_line(0x5e)
    4267                            .dwattr $C$DW$424, DW_AT_decl_column(0x1c)
    4268                    
    4269                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
    4270                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x5e)
    4271                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x10)
    4272                            .dwendtag $C$DW$T$50
    4273                    
    4274                    $C$DW$T$1024    .dwtag  DW_TAG_typedef
    4275                            .dwattr $C$DW$T$1024, DW_AT_name("ldiv_t")
    4276                            .dwattr $C$DW$T$1024, DW_AT_type(*$C$DW$T$50)
    4277                            .dwattr $C$DW$T$1024, DW_AT_language(DW_LANG_C)
    4278                            .dwattr $C$DW$T$1024, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/includ
    4279                            .dwattr $C$DW$T$1024, DW_AT_decl_line(0x5e)
    4280                            .dwattr $C$DW$T$1024, DW_AT_decl_column(0x23)
    4281                    
    4282                    
    4283                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
    4284                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x10)
    4285                    $C$DW$425       .dwtag  DW_TAG_member
    4286                            .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$14)
    4287                            .dwattr $C$DW$425, DW_AT_name("quot")
    4288                            .dwattr $C$DW$425, DW_AT_TI_symbol_name("quot")
    4289                            .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4290                            .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E74AC829-0798-4F01-A406-D828C0940CAB} PAGE   79

    4291                            .dwattr $C$DW$425, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    4292                            .dwattr $C$DW$425, DW_AT_decl_line(0x61)
    4293                            .dwattr $C$DW$425, DW_AT_decl_column(0x1c)
    4294                    
    4295                    $C$DW$426       .dwtag  DW_TAG_member
    4296                            .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$14)
    4297                            .dwattr $C$DW$426, DW_AT_name("rem")
    4298                            .dwattr $C$DW$426, DW_AT_TI_symbol_name("rem")
    4299                            .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4300                            .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4301                            .dwattr $C$DW$426, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/s
    4302                            .dwattr $C$DW$426, DW_AT_decl_line(0x61)
    4303                            .dwattr $C$DW$426, DW_AT_decl_column(0x22)
    4304                    
    4305                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/include/
    4306                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x61)
    4307                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x10)
    4308                            .dwendtag $C$DW$T$51
    4309                    
    4310                    $C$DW$T$1025    .dwtag  DW_TAG_typedef
    4311                            .dwattr $C$DW$T$1025, DW_AT_name("lldiv_t")
    4312                            .dwattr $C$DW$T$1025, DW_AT_type(*$C$DW$T$51)
    4313                            .dwattr $C$DW$T$1025, DW_AT_language(DW_LANG_C)
    4314                            .dwattr $C$DW$T$1025, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.4.LTS/includ
    4315                            .dwattr $C$DW$T$1025, DW_AT_decl_line(0x61)
    4316                            .dwattr $C$DW$T$1025, DW_AT_decl_column(0x29)
    4317                    
    4318                    
    4319                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    4320                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x08)
    4321                    $C$DW$427       .dwtag  DW_TAG_member
    4322                            .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$53)
    4323                            .dwattr $C$DW$427, DW_AT_name("pointerStack")
    4324                            .dwattr $C$DW$427, DW_AT_TI_symbol_name("pointerStack")
    4325                            .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4326                            .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4327                            .dwattr $C$DW$427, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4328                            .dwattr $C$DW$427, DW_AT_decl_line(0x3f5)
    4329                            .dwattr $C$DW$427, DW_AT_decl_column(0x16)
    4330                    
    4331                    $C$DW$428       .dwtag  DW_TAG_member
    4332                            .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$54)
    4333                            .dwattr $C$DW$428, DW_AT_name("directAPI")
    4334                            .dwattr $C$DW$428, DW_AT_TI_symbol_name("directAPI")
    4335                            .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4336                            .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    4337                            .dwattr $C$DW$428, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4338                            .dwattr $C$DW$428, DW_AT_decl_line(0x3f6)
    4339                            .dwattr $C$DW$428, DW_AT_decl_column(0x15)
    4340                    
    4341                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    4342                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x3f4)
    4343                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x01)
    4344                            .dwendtag $C$DW$T$55
    4345                    
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E74AC829-0798-4F01-A406-D828C0940CAB} PAGE   80

    4346                    $C$DW$T$57      .dwtag  DW_TAG_typedef
    4347                            .dwattr $C$DW$T$57, DW_AT_name("icall_directAPIMsg_t")
    4348                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$55)
    4349                            .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    4350                            .dwattr $C$DW$T$57, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    4351                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x3f7)
    4352                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x03)
    4353                    
    4354                    
    4355                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
    4356                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x14)
    4357                    $C$DW$429       .dwtag  DW_TAG_member
    4358                            .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$56)
    4359                            .dwattr $C$DW$429, DW_AT_name("hdr")
    4360                            .dwattr $C$DW$429, DW_AT_TI_symbol_name("hdr")
    4361                            .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4362                            .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4363                            .dwattr $C$DW$429, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4364                            .dwattr $C$DW$429, DW_AT_decl_line(0x3fb)
    4365                            .dwattr $C$DW$429, DW_AT_decl_column(0x10)
    4366                    
    4367                    $C$DW$430       .dwtag  DW_TAG_member
    4368                            .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$57)
    4369                            .dwattr $C$DW$430, DW_AT_name("msg")
    4370                            .dwattr $C$DW$430, DW_AT_TI_symbol_name("msg")
    4371                            .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4372                            .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4373                            .dwattr $C$DW$430, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4374                            .dwattr $C$DW$430, DW_AT_decl_line(0x3fc)
    4375                            .dwattr $C$DW$430, DW_AT_decl_column(0x1a)
    4376                    
    4377                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    4378                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x3fa)
    4379                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x01)
    4380                            .dwendtag $C$DW$T$58
    4381                    
    4382                    $C$DW$T$1026    .dwtag  DW_TAG_typedef
    4383                            .dwattr $C$DW$T$1026, DW_AT_name("icallLiteMsg_t")
    4384                            .dwattr $C$DW$T$1026, DW_AT_type(*$C$DW$T$58)
    4385                            .dwattr $C$DW$T$1026, DW_AT_language(DW_LANG_C)
    4386                            .dwattr $C$DW$T$1026, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154s
    4387                            .dwattr $C$DW$T$1026, DW_AT_decl_line(0x3fd)
    4388                            .dwattr $C$DW$T$1026, DW_AT_decl_column(0x03)
    4389                    
    4390                    
    4391                    $C$DW$T$59      .dwtag  DW_TAG_structure_type
    4392                            .dwattr $C$DW$T$59, DW_AT_byte_size(0x0a)
    4393                    $C$DW$431       .dwtag  DW_TAG_member
    4394                            .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$450)
    4395                            .dwattr $C$DW$431, DW_AT_name("addr")
    4396                            .dwattr $C$DW$431, DW_AT_TI_symbol_name("addr")
    4397                            .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4398                            .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4399                            .dwattr $C$DW$431, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4400                            .dwattr $C$DW$431, DW_AT_decl_line(0x52)
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E74AC829-0798-4F01-A406-D828C0940CAB} PAGE   81

    4401                            .dwattr $C$DW$431, DW_AT_decl_column(0x05)
    4402                    
    4403                    $C$DW$432       .dwtag  DW_TAG_member
    4404                            .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$29)
    4405                            .dwattr $C$DW$432, DW_AT_name("addrMode")
    4406                            .dwattr $C$DW$432, DW_AT_TI_symbol_name("addrMode")
    4407                            .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4408                            .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4409                            .dwattr $C$DW$432, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4410                            .dwattr $C$DW$432, DW_AT_decl_line(0x53)
    4411                            .dwattr $C$DW$432, DW_AT_decl_column(0x11)
    4412                    
    4413                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicatio
    4414                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x4d)
    4415                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    4416                            .dwendtag $C$DW$T$59
    4417                    
    4418                    $C$DW$T$346     .dwtag  DW_TAG_typedef
    4419                            .dwattr $C$DW$T$346, DW_AT_name("sAddr_t")
    4420                            .dwattr $C$DW$T$346, DW_AT_type(*$C$DW$T$59)
    4421                            .dwattr $C$DW$T$346, DW_AT_language(DW_LANG_C)
    4422                            .dwattr $C$DW$T$346, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicati
    4423                            .dwattr $C$DW$T$346, DW_AT_decl_line(0x54)
    4424                            .dwattr $C$DW$T$346, DW_AT_decl_column(0x03)
    4425                    
    4426                    $C$DW$T$399     .dwtag  DW_TAG_pointer_type
    4427                            .dwattr $C$DW$T$399, DW_AT_type(*$C$DW$T$346)
    4428                            .dwattr $C$DW$T$399, DW_AT_address_class(0x20)
    4429                    
    4430                    
    4431                    $C$DW$T$61      .dwtag  DW_TAG_structure_type
    4432                            .dwattr $C$DW$T$61, DW_AT_byte_size(0x0a)
    4433                    $C$DW$433       .dwtag  DW_TAG_member
    4434                            .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$453)
    4435                            .dwattr $C$DW$433, DW_AT_name("addr")
    4436                            .dwattr $C$DW$433, DW_AT_TI_symbol_name("addr")
    4437                            .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4438                            .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    4439                            .dwattr $C$DW$433, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4440                            .dwattr $C$DW$433, DW_AT_decl_line(0x139)
    4441                            .dwattr $C$DW$433, DW_AT_decl_column(0x05)
    4442                    
    4443                    $C$DW$434       .dwtag  DW_TAG_member
    4444                            .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$60)
    4445                            .dwattr $C$DW$434, DW_AT_name("addrMode")
    4446                            .dwattr $C$DW$434, DW_AT_TI_symbol_name("addrMode")
    4447                            .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4448                            .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4449                            .dwattr $C$DW$434, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4450                            .dwattr $C$DW$434, DW_AT_decl_line(0x13a)
    4451                            .dwattr $C$DW$434, DW_AT_decl_column(0x08)
    4452                    
    4453                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    4454                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x134)
    4455                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x01)
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E74AC829-0798-4F01-A406-D828C0940CAB} PAGE   82

    4456                            .dwendtag $C$DW$T$61
    4457                    
    4458                    $C$DW$T$1027    .dwtag  DW_TAG_typedef
    4459                            .dwattr $C$DW$T$1027, DW_AT_name("zAddrType_t")
    4460                            .dwattr $C$DW$T$1027, DW_AT_type(*$C$DW$T$61)
    4461                            .dwattr $C$DW$T$1027, DW_AT_language(DW_LANG_C)
    4462                            .dwattr $C$DW$T$1027, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154s
    4463                            .dwattr $C$DW$T$1027, DW_AT_decl_line(0x13b)
    4464                            .dwattr $C$DW$T$1027, DW_AT_decl_column(0x03)
    4465                    
    4466                    
    4467                    $C$DW$T$63      .dwtag  DW_TAG_structure_type
    4468                            .dwattr $C$DW$T$63, DW_AT_byte_size(0x0c)
    4469                    $C$DW$435       .dwtag  DW_TAG_member
    4470                            .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$29)
    4471                            .dwattr $C$DW$435, DW_AT_name("txCounter")
    4472                            .dwattr $C$DW$435, DW_AT_TI_symbol_name("txCounter")
    4473                            .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4474                            .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4475                            .dwattr $C$DW$435, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4476                            .dwattr $C$DW$435, DW_AT_decl_line(0x198)
    4477                            .dwattr $C$DW$435, DW_AT_decl_column(0x0a)
    4478                    
    4479                    $C$DW$436       .dwtag  DW_TAG_member
    4480                            .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$29)
    4481                            .dwattr $C$DW$436, DW_AT_name("txCost")
    4482                            .dwattr $C$DW$436, DW_AT_TI_symbol_name("txCost")
    4483                            .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4484                            .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4485                            .dwattr $C$DW$436, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4486                            .dwattr $C$DW$436, DW_AT_decl_line(0x199)
    4487                            .dwattr $C$DW$436, DW_AT_decl_column(0x0a)
    4488                    
    4489                    $C$DW$437       .dwtag  DW_TAG_member
    4490                            .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$29)
    4491                            .dwattr $C$DW$437, DW_AT_name("rxLqi")
    4492                            .dwattr $C$DW$437, DW_AT_TI_symbol_name("rxLqi")
    4493                            .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4494                            .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4495                            .dwattr $C$DW$437, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4496                            .dwattr $C$DW$437, DW_AT_decl_line(0x19b)
    4497                            .dwattr $C$DW$437, DW_AT_decl_column(0x0a)
    4498                    
    4499                    $C$DW$438       .dwtag  DW_TAG_member
    4500                            .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$29)
    4501                            .dwattr $C$DW$438, DW_AT_name("inKeySeqNum")
    4502                            .dwattr $C$DW$438, DW_AT_TI_symbol_name("inKeySeqNum")
    4503                            .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4504                            .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4505                            .dwattr $C$DW$438, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4506                            .dwattr $C$DW$438, DW_AT_decl_line(0x19d)
    4507                            .dwattr $C$DW$438, DW_AT_decl_column(0x0a)
    4508                    
    4509                    $C$DW$439       .dwtag  DW_TAG_member
    4510                            .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$62)
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E74AC829-0798-4F01-A406-D828C0940CAB} PAGE   83

    4511                            .dwattr $C$DW$439, DW_AT_name("inFrmCntr")
    4512                            .dwattr $C$DW$439, DW_AT_TI_symbol_name("inFrmCntr")
    4513                            .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4514                            .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4515                            .dwattr $C$DW$439, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4516                            .dwattr $C$DW$439, DW_AT_decl_line(0x19e)
    4517                            .dwattr $C$DW$439, DW_AT_decl_column(0x0a)
    4518                    
    4519                    $C$DW$440       .dwtag  DW_TAG_member
    4520                            .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$24)
    4521                            .dwattr $C$DW$440, DW_AT_name("txFailure")
    4522                            .dwattr $C$DW$440, DW_AT_TI_symbol_name("txFailure")
    4523                            .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4524                            .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4525                            .dwattr $C$DW$440, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154stac
    4526                            .dwattr $C$DW$440, DW_AT_decl_line(0x19f)
    4527                            .dwattr $C$DW$440, DW_AT_decl_column(0x0a)
    4528                    
    4529                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154sta
    4530                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x197)
    4531                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x01)
    4532                            .dwendtag $C$DW$T$63
    4533                    
    4534                    $C$DW$T$1028    .dwtag  DW_TAG_typedef
    4535                            .dwattr $C$DW$T$1028, DW_AT_name("linkInfo_t")
    4536                            .dwattr $C$DW$T$1028, DW_AT_type(*$C$DW$T$63)
    4537                            .dwattr $C$DW$T$1028, DW_AT_language(DW_LANG_C)
    4538                            .dwattr $C$DW$T$1028, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/ti154s
    4539                            .dwattr $C$DW$T$1028, DW_AT_decl_line(0x1a0)
    4540                            .dwattr $C$DW$T$1028, DW_AT_decl_column(0x03)
    4541                    
    4542                    
    4543                    $C$DW$T$64      .dwtag  DW_TAG_structure_type
    4544                            .dwattr $C$DW$T$64, DW_AT_byte_size(0x02)
    4545                    $C$DW$441       .dwtag  DW_TAG_member
    4546                            .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$29)
    4547                            .dwattr $C$DW$441, DW_AT_name("event")
    4548                            .dwattr $C$DW$441, DW_AT_TI_symbol_name("event")
    4549                            .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4550                            .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4551                            .dwattr $C$DW$441, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4552                            .dwattr $C$DW$441, DW_AT_decl_line(0x79)
    4553                            .dwattr $C$DW$441, DW_AT_decl_column(0x0a)
    4554                    
    4555                    $C$DW$442       .dwtag  DW_TAG_member
    4556                            .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$29)
    4557                            .dwattr $C$DW$442, DW_AT_name("status")
    4558                            .dwattr $C$DW$442, DW_AT_TI_symbol_name("status")
    4559                            .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4560                            .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4561                            .dwattr $C$DW$442, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Application
    4562                            .dwattr $C$DW$442, DW_AT_decl_line(0x7a)
    4563                            .dwattr $C$DW$442, DW_AT_decl_column(0x0a)
    4564                    
    4565                            .dwattr $C$DW$T$64, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicatio
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E74AC829-0798-4F01-A406-D828C0940CAB} PAGE   84

    4566                            .dwattr $C$DW$T$64, DW_AT_decl_line(0x78)
    4567                            .dwattr $C$DW$T$64, DW_AT_decl_column(0x01)
    4568                            .dwendtag $C$DW$T$64
    4569                    
    4570                    $C$DW$T$1029    .dwtag  DW_TAG_typedef
    4571                            .dwattr $C$DW$T$1029, DW_AT_name("osal_event_hdr_t")
    4572                            .dwattr $C$DW$T$1029, DW_AT_type(*$C$DW$T$64)
    4573                            .dwattr $C$DW$T$1029, DW_AT_language(DW_LANG_C)
    4574                            .dwattr $C$DW$T$1029, DW_AT_decl_file("C:/Users/Kevin/workspace_v7/collector_cc1310lp/Applicat
    4575                            .dwattr $C$DW$T$1029, DW_AT_decl_line(0x7b)
    4576                            .dwattr $C$DW$T$1029, DW_AT_decl_column(0x03)
    4577                    
    4578                    
    4579                    $C$DW$T$96      .dwtag  DW_TAG_structure_type
    4580                            .dwattr $C$DW$T$96, DW_AT_byte_size(0x4c)
    4581                    $C$DW$443       .dwtag  DW_TAG_member
    4582                            .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$67)
    4583                            .dwattr $C$DW$443, DW_AT_name("Crc32")
    4584                            .dwattr $C$DW$443, DW_AT_TI_symbol_name("Crc32")
    4585                            .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4586                            .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4587                            .dwattr $C$DW$443, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4588                            .dwattr $C$DW$443, DW_AT_decl_line(0x76)
    4589                            .dwattr $C$DW$443, DW_AT_decl_column(0x25)
    4590                    
    4591                    $C$DW$444       .dwtag  DW_TAG_member
    4592                            .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$70)
    4593                            .dwattr $C$DW$444, DW_AT_name("FlashGetSize")
    4594                            .dwattr $C$DW$444, DW_AT_TI_symbol_name("FlashGetSize")
    4595                            .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4596                            .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4597                            .dwattr $C$DW$444, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4598                            .dwattr $C$DW$444, DW_AT_decl_line(0x77)
    4599                            .dwattr $C$DW$444, DW_AT_decl_column(0x25)
    4600                    
    4601                    $C$DW$445       .dwtag  DW_TAG_member
    4602                            .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$71)
    4603                            .dwattr $C$DW$445, DW_AT_name("GetChipId")
    4604                            .dwattr $C$DW$445, DW_AT_TI_symbol_name("GetChipId")
    4605                            .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4606                            .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4607                            .dwattr $C$DW$445, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4608                            .dwattr $C$DW$445, DW_AT_decl_line(0x78)
    4609                            .dwattr $C$DW$445, DW_AT_decl_column(0x25)
    4610                    
    4611                    $C$DW$446       .dwtag  DW_TAG_member
    4612                            .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$74)
    4613                            .dwattr $C$DW$446, DW_AT_name("ReservedLocation1")
    4614                            .dwattr $C$DW$446, DW_AT_TI_symbol_name("ReservedLocation1")
    4615                            .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4616                            .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4617                            .dwattr $C$DW$446, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4618                            .dwattr $C$DW$446, DW_AT_decl_line(0x79)
    4619                            .dwattr $C$DW$446, DW_AT_decl_column(0x25)
    4620                    
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E74AC829-0798-4F01-A406-D828C0940CAB} PAGE   85

    4621                    $C$DW$447       .dwtag  DW_TAG_member
    4622                            .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$75)
    4623                            .dwattr $C$DW$447, DW_AT_name("ReservedLocation2")
    4624                            .dwattr $C$DW$447, DW_AT_TI_symbol_name("ReservedLocation2")
    4625                            .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4626                            .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4627                            .dwattr $C$DW$447, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4628                            .dwattr $C$DW$447, DW_AT_decl_line(0x7a)
    4629                            .dwattr $C$DW$447, DW_AT_decl_column(0x25)
    4630                    
    4631                    $C$DW$448       .dwtag  DW_TAG_member
    4632                            .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$76)
    4633                            .dwattr $C$DW$448, DW_AT_name("ReservedLocation3")
    4634                            .dwattr $C$DW$448, DW_AT_TI_symbol_name("ReservedLocation3")
    4635                            .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4636                            .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4637                            .dwattr $C$DW$448, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4638                            .dwattr $C$DW$448, DW_AT_decl_line(0x7b)
    4639                            .dwattr $C$DW$448, DW_AT_decl_column(0x25)
    4640                    
    4641                    $C$DW$449       .dwtag  DW_TAG_member
    4642                            .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$77)
    4643                            .dwattr $C$DW$449, DW_AT_name("ResetDevice")
    4644                            .dwattr $C$DW$449, DW_AT_TI_symbol_name("ResetDevice")
    4645                            .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4646                            .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4647                            .dwattr $C$DW$449, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4648                            .dwattr $C$DW$449, DW_AT_decl_line(0x7c)
    4649                            .dwattr $C$DW$449, DW_AT_decl_column(0x25)
    4650                    
    4651                    $C$DW$450       .dwtag  DW_TAG_member
    4652                            .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$82)
    4653                            .dwattr $C$DW$450, DW_AT_name("Fletcher32")
    4654                            .dwattr $C$DW$450, DW_AT_TI_symbol_name("Fletcher32")
    4655                            .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4656                            .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4657                            .dwattr $C$DW$450, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4658                            .dwattr $C$DW$450, DW_AT_decl_line(0x7d)
    4659                            .dwattr $C$DW$450, DW_AT_decl_column(0x25)
    4660                    
    4661                    $C$DW$451       .dwtag  DW_TAG_member
    4662                            .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$85)
    4663                            .dwattr $C$DW$451, DW_AT_name("MinValue")
    4664                            .dwattr $C$DW$451, DW_AT_TI_symbol_name("MinValue")
    4665                            .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4666                            .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4667                            .dwattr $C$DW$451, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4668                            .dwattr $C$DW$451, DW_AT_decl_line(0x7e)
    4669                            .dwattr $C$DW$451, DW_AT_decl_column(0x25)
    4670                    
    4671                    $C$DW$452       .dwtag  DW_TAG_member
    4672                            .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$86)
    4673                            .dwattr $C$DW$452, DW_AT_name("MaxValue")
    4674                            .dwattr $C$DW$452, DW_AT_TI_symbol_name("MaxValue")
    4675                            .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E74AC829-0798-4F01-A406-D828C0940CAB} PAGE   86

    4676                            .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4677                            .dwattr $C$DW$452, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4678                            .dwattr $C$DW$452, DW_AT_decl_line(0x7f)
    4679                            .dwattr $C$DW$452, DW_AT_decl_column(0x25)
    4680                    
    4681                    $C$DW$453       .dwtag  DW_TAG_member
    4682                            .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$87)
    4683                            .dwattr $C$DW$453, DW_AT_name("MeanValue")
    4684                            .dwattr $C$DW$453, DW_AT_TI_symbol_name("MeanValue")
    4685                            .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4686                            .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4687                            .dwattr $C$DW$453, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4688                            .dwattr $C$DW$453, DW_AT_decl_line(0x80)
    4689                            .dwattr $C$DW$453, DW_AT_decl_column(0x25)
    4690                    
    4691                    $C$DW$454       .dwtag  DW_TAG_member
    4692                            .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$88)
    4693                            .dwattr $C$DW$454, DW_AT_name("StandDeviationValue")
    4694                            .dwattr $C$DW$454, DW_AT_TI_symbol_name("StandDeviationValue")
    4695                            .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4696                            .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4697                            .dwattr $C$DW$454, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4698                            .dwattr $C$DW$454, DW_AT_decl_line(0x81)
    4699                            .dwattr $C$DW$454, DW_AT_decl_column(0x25)
    4700                    
    4701                    $C$DW$455       .dwtag  DW_TAG_member
    4702                            .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$89)
    4703                            .dwattr $C$DW$455, DW_AT_name("ReservedLocation4")
    4704                            .dwattr $C$DW$455, DW_AT_TI_symbol_name("ReservedLocation4")
    4705                            .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4706                            .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4707                            .dwattr $C$DW$455, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4708                            .dwattr $C$DW$455, DW_AT_decl_line(0x82)
    4709                            .dwattr $C$DW$455, DW_AT_decl_column(0x25)
    4710                    
    4711                    $C$DW$456       .dwtag  DW_TAG_member
    4712                            .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$90)
    4713                            .dwattr $C$DW$456, DW_AT_name("ReservedLocation5")
    4714                            .dwattr $C$DW$456, DW_AT_TI_symbol_name("ReservedLocation5")
    4715                            .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4716                            .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4717                            .dwattr $C$DW$456, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4718                            .dwattr $C$DW$456, DW_AT_decl_line(0x83)
    4719                            .dwattr $C$DW$456, DW_AT_decl_column(0x25)
    4720                    
    4721                    $C$DW$457       .dwtag  DW_TAG_member
    4722                            .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$91)
    4723                            .dwattr $C$DW$457, DW_AT_name("HFSourceSafeSwitch")
    4724                            .dwattr $C$DW$457, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    4725                            .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4726                            .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4727                            .dwattr $C$DW$457, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4728                            .dwattr $C$DW$457, DW_AT_decl_line(0x84)
    4729                            .dwattr $C$DW$457, DW_AT_decl_column(0x25)
    4730                    
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E74AC829-0798-4F01-A406-D828C0940CAB} PAGE   87

    4731                    $C$DW$458       .dwtag  DW_TAG_member
    4732                            .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$92)
    4733                            .dwattr $C$DW$458, DW_AT_name("SelectCompAInput")
    4734                            .dwattr $C$DW$458, DW_AT_TI_symbol_name("SelectCompAInput")
    4735                            .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4736                            .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4737                            .dwattr $C$DW$458, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4738                            .dwattr $C$DW$458, DW_AT_decl_line(0x85)
    4739                            .dwattr $C$DW$458, DW_AT_decl_column(0x25)
    4740                    
    4741                    $C$DW$459       .dwtag  DW_TAG_member
    4742                            .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$93)
    4743                            .dwattr $C$DW$459, DW_AT_name("SelectCompARef")
    4744                            .dwattr $C$DW$459, DW_AT_TI_symbol_name("SelectCompARef")
    4745                            .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4746                            .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4747                            .dwattr $C$DW$459, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4748                            .dwattr $C$DW$459, DW_AT_decl_line(0x86)
    4749                            .dwattr $C$DW$459, DW_AT_decl_column(0x25)
    4750                    
    4751                    $C$DW$460       .dwtag  DW_TAG_member
    4752                            .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$94)
    4753                            .dwattr $C$DW$460, DW_AT_name("SelectADCCompBInput")
    4754                            .dwattr $C$DW$460, DW_AT_TI_symbol_name("SelectADCCompBInput")
    4755                            .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4756                            .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4757                            .dwattr $C$DW$460, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4758                            .dwattr $C$DW$460, DW_AT_decl_line(0x87)
    4759                            .dwattr $C$DW$460, DW_AT_decl_column(0x25)
    4760                    
    4761                    $C$DW$461       .dwtag  DW_TAG_member
    4762                            .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$95)
    4763                            .dwattr $C$DW$461, DW_AT_name("SelectCompBRef")
    4764                            .dwattr $C$DW$461, DW_AT_TI_symbol_name("SelectCompBRef")
    4765                            .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4766                            .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4767                            .dwattr $C$DW$461, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4768                            .dwattr $C$DW$461, DW_AT_decl_line(0x88)
    4769                            .dwattr $C$DW$461, DW_AT_decl_column(0x25)
    4770                    
    4771                            .dwattr $C$DW$T$96, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\
    4772                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x75)
    4773                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x01)
    4774                            .dwendtag $C$DW$T$96
    4775                    
    4776                    $C$DW$T$1030    .dwtag  DW_TAG_typedef
    4777                            .dwattr $C$DW$T$1030, DW_AT_name("HARD_API_T")
    4778                            .dwattr $C$DW$T$1030, DW_AT_type(*$C$DW$T$96)
    4779                            .dwattr $C$DW$T$1030, DW_AT_language(DW_LANG_C)
    4780                            .dwattr $C$DW$T$1030, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\device
    4781                            .dwattr $C$DW$T$1030, DW_AT_decl_line(0x89)
    4782                            .dwattr $C$DW$T$1030, DW_AT_decl_column(0x03)
    4783                    
    4784                    
    4785                    $C$DW$T$99      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E74AC829-0798-4F01-A406-D828C0940CAB} PAGE   88

    4786                            .dwattr $C$DW$T$99, DW_AT_byte_size(0x0a)
    4787                    $C$DW$462       .dwtag  DW_TAG_member
    4788                            .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$454)
    4789                            .dwattr $C$DW$462, DW_AT_name("addr")
    4790                            .dwattr $C$DW$462, DW_AT_TI_symbol_name("addr")
    4791                            .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4792                            .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4793                            .dwattr $C$DW$462, DW_AT_decl_file("C:\Users\Kevin\workspace_v7\collector_cc1310lp\Application
    4794                            .dwattr $C$DW$462, DW_AT_decl_line(0x4a7)
    4795                            .dwattr $C$DW$462, DW_AT_decl_column(0x07)
    4796                    
    4797                    $C$DW$463       .dwtag  DW_TAG_member
    4798                            .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$98)
    4799                            .dwattr $C$DW$463, DW_AT_name("addrMode")
    4800                            .dwattr $C$DW$463, DW_AT_TI_symbol_name("addrMode")
    4801                            .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4802                            .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4803                            .dwattr $C$DW$463, DW_AT_decl_file("C:\Users\Kevin\workspace_v7\collector_cc1310lp\Application
    4804                            .dwattr $C$DW$463, DW_AT_decl_line(0x4aa)
    4805                            .dwattr $C$DW$463, DW_AT_decl_column(0x17)
    4806                    
    4807                            .dwattr $C$DW$T$99, DW_AT_decl_file("C:\Users\Kevin\workspace_v7\collector_cc1310lp\Applicatio
    4808                            .dwattr $C$DW$T$99, DW_AT_decl_line(0x49c)
    4809                            .dwattr $C$DW$T$99, DW_AT_decl_column(0x01)
    4810                            .dwendtag $C$DW$T$99
    4811                    
    4812                    $C$DW$T$687     .dwtag  DW_TAG_typedef
    4813                            .dwattr $C$DW$T$687, DW_AT_name("ApiMac_sAddr_t")
    4814                            .dwattr $C$DW$T$687, DW_AT_type(*$C$DW$T$99)
    4815                            .dwattr $C$DW$T$687, DW_AT_language(DW_LANG_C)
    4816                            .dwattr $C$DW$T$687, DW_AT_decl_file("C:\Users\Kevin\workspace_v7\collector_cc1310lp\Applicati
    4817                            .dwattr $C$DW$T$687, DW_AT_decl_line(0x4ab)
    4818                            .dwattr $C$DW$T$687, DW_AT_decl_column(0x03)
    4819                    
    4820                    
    4821                    $C$DW$T$103     .dwtag  DW_TAG_structure_type
    4822                            .dwattr $C$DW$T$103, DW_AT_byte_size(0x40)
    4823                    $C$DW$464       .dwtag  DW_TAG_member
    4824                            .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$101)
    4825                            .dwattr $C$DW$464, DW_AT_name("beaconType")
    4826                            .dwattr $C$DW$464, DW_AT_TI_symbol_name("beaconType")
    4827                            .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4828                            .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4829                            .dwattr $C$DW$464, DW_AT_decl_file("C:\Users\Kevin\workspace_v7\collector_cc1310lp\Application
    4830                            .dwattr $C$DW$464, DW_AT_decl_line(0x848)
    4831                            .dwattr $C$DW$464, DW_AT_decl_column(0x19)
    4832                    
    4833                    $C$DW$465       .dwtag  DW_TAG_member
    4834                            .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$19)
    4835                            .dwattr $C$DW$465, DW_AT_name("bsn")
    4836                            .dwattr $C$DW$465, DW_AT_TI_symbol_name("bsn")
    4837                            .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4838                            .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4839                            .dwattr $C$DW$465, DW_AT_decl_file("C:\Users\Kevin\workspace_v7\collector_cc1310lp\Application
    4840                            .dwattr $C$DW$465, DW_AT_decl_line(0x84a)
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E74AC829-0798-4F01-A406-D828C0940CAB} PAGE   89

    4841                            .dwattr $C$DW$465, DW_AT_decl_column(0x0d)
    4842                    
    4843                    $C$DW$466       .dwtag  DW_TAG_member
    4844                            .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$102)
    4845                            .dwattr $C$DW$466, DW_AT_name("panDesc")
    4846                            .dwattr $C$DW$466, DW_AT_TI_symbol_name("panDesc")
    4847                            .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4848                            .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4849                            .dwattr $C$DW$466, DW_AT_decl_file("C:\Users\Kevin\workspace_v7\collector_cc1310lp\Application
    4850                            .dwattr $C$DW$466, DW_AT_decl_line(0x84c)
    4851                            .dwattr $C$DW$466, DW_AT_decl_column(0x16)
    4852                    
    4853                    $C$DW$467       .dwtag  DW_TAG_member
    4854                            .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$457)
    4855                            .dwattr $C$DW$467, DW_AT_name("beaconData")
    4856                            .dwattr $C$DW$467, DW_AT_TI_symbol_name("beaconData")
    4857                            .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4858                            .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4859                            .dwattr $C$DW$467, DW_AT_decl_file("C:\Users\Kevin\workspace_v7\collector_cc1310lp\Application
    4860                            .dwattr $C$DW$467, DW_AT_decl_line(0x857)
    4861                            .dwattr $C$DW$467, DW_AT_decl_column(0x07)
    4862                    
    4863                            .dwattr $C$DW$T$103, DW_AT_decl_file("C:\Users\Kevin\workspace_v7\collector_cc1310lp\Applicati
    4864                            .dwattr $C$DW$T$103, DW_AT_decl_line(0x846)
    4865                            .dwattr $C$DW$T$103, DW_AT_decl_column(0x01)
    4866                            .dwendtag $C$DW$T$103
    4867                    
    4868                    $C$DW$T$601     .dwtag  DW_TAG_typedef
    4869                            .dwattr $C$DW$T$601, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
    4870                            .dwattr $C$DW$T$601, DW_AT_type(*$C$DW$T$103)
    4871                            .dwattr $C$DW$T$601, DW_AT_language(DW_LANG_C)
    4872                            .dwattr $C$DW$T$601, DW_AT_decl_file("C:\Users\Kevin\workspace_v7\collector_cc1310lp\Applicati
    4873                            .dwattr $C$DW$T$601, DW_AT_decl_line(0x858)
    4874                            .dwattr $C$DW$T$601, DW_AT_decl_column(0x03)
    4875                    
    4876                    $C$DW$T$602     .dwtag  DW_TAG_pointer_type
    4877                            .dwattr $C$DW$T$602, DW_AT_type(*$C$DW$T$601)
    4878                            .dwattr $C$DW$T$602, DW_AT_address_class(0x20)
    4879                    
    4880                    
    4881                    $C$DW$T$104     .dwtag  DW_TAG_structure_type
    4882                            .dwattr $C$DW$T$104, DW_AT_byte_size(0x08)
    4883                    $C$DW$468       .dwtag  DW_TAG_member
    4884                            .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$39)
    4885                            .dwattr $C$DW$468, DW_AT_name("pCurrEntry")
    4886                            .dwattr $C$DW$468, DW_AT_TI_symbol_name("pCurrEntry")
    4887                            .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4888                            .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4889                            .dwattr $C$DW$468, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4890                            .dwattr $C$DW$468, DW_AT_decl_line(0x41)
    4891                            .dwattr $C$DW$468, DW_AT_decl_column(0x0d)
    4892                    
    4893                    $C$DW$469       .dwtag  DW_TAG_member
    4894                            .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$39)
    4895                            .dwattr $C$DW$469, DW_AT_name("pLastEntry")
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E74AC829-0798-4F01-A406-D828C0940CAB} PAGE   90

    4896                            .dwattr $C$DW$469, DW_AT_TI_symbol_name("pLastEntry")
    4897                            .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4898                            .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4899                            .dwattr $C$DW$469, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices\c
    4900                            .dwattr $C$DW$469, DW_AT_decl_line(0x42)
    4901                            .dwattr $C$DW$469, DW_AT_decl_column(0x0d)
    4902                    
    4903                            .dwattr $C$DW$T$104, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    4904                            .dwattr $C$DW$T$104, DW_AT_decl_line(0x40)
    4905                            .dwattr $C$DW$T$104, DW_AT_decl_column(0x10)
    4906                            .dwendtag $C$DW$T$104
    4907                    
    4908                    $C$DW$T$843     .dwtag  DW_TAG_typedef
    4909                            .dwattr $C$DW$T$843, DW_AT_name("dataQueue_t")
    4910                            .dwattr $C$DW$T$843, DW_AT_type(*$C$DW$T$104)
    4911                            .dwattr $C$DW$T$843, DW_AT_language(DW_LANG_C)
    4912                            .dwattr $C$DW$T$843, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_1_50_00_08\source\ti\devices
    4913                            .dwattr $C$DW$T$843, DW_AT_decl_line(0x43)
    4914                            .dwattr $C$DW$T$843, DW_AT_decl_column(0x03)
    4915                    
    4916                    $C$DW$T$844     .dwtag  DW_TAG_pointer_type
    4917                            .dwattr $C$DW$T$844, DW_AT_type(*$C$DW$T$843)
    4918                            .dwattr $C$DW$T$844, DW_AT_address_class(0x20)
    4919                    
    4920                    
    4921                    $C$DW$T$105     .dwtag  DW_TAG_structure_type
    4922                            .dwattr $C$DW$T$105, DW_AT_byte_size(0x01)
    4923                    $C$DW$470       .dwtag  DW_TAG_member
    4924                            .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$19)
    4925                            .dwattr $C$DW$470, DW_AT_name("triggerType")
    4926                            .dwattr $C$DW$470, DW_AT_TI_symbol_name("triggerType")
    4927                            .dwattr $C$DW$470, DW_AT_bit_offset(0x04)
    4928                            .dwattr $C$DW$470, DW_AT_bit_size(0x04)
    4929                            .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4930                            .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4931                            .dwattr $C$DW$470, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4932                            .dwattr $C$DW$470, DW_AT_decl_line(0x77)
    4933                            .dwattr $C$DW$470, DW_AT_decl_column(0x0f)
    4934                    
    4935                    $C$DW$471       .dwtag  DW_TAG_member
    4936                            .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$19)
    4937                            .dwattr $C$DW$471, DW_AT_name("bEnaCmd")
    4938                            .dwattr $C$DW$471, DW_AT_TI_symbol_name("bEnaCmd")
    4939                            .dwattr $C$DW$471, DW_AT_bit_offset(0x03)
    4940                            .dwattr $C$DW$471, DW_AT_bit_size(0x01)
    4941                            .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4942                            .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4943                            .dwattr $C$DW$471, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4944                            .dwattr $C$DW$471, DW_AT_decl_line(0x78)
    4945                            .dwattr $C$DW$471, DW_AT_decl_column(0x0f)
    4946                    
    4947                    $C$DW$472       .dwtag  DW_TAG_member
    4948                            .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$19)
    4949                            .dwattr $C$DW$472, DW_AT_name("triggerNo")
    4950                            .dwattr $C$DW$472, DW_AT_TI_symbol_name("triggerNo")
TI ARM Assembler PC v16.9.4 Thu Mar 08 21:09:44 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Kevin\AppData\Local\Temp\{E74AC829-0798-4F01-A406-D828C0940CAB} PAGE   91

    4951                            .dwattr $C$DW$472, DW_AT_bit_offset(0x01)
    4952                            .dwattr $C$DW$472, DW_AT_bit_size(0x02)
    4953                            .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4954                            .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4955                            .dwattr $C$DW$472, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4956                            .dwattr $C$DW$472, DW_AT_decl_line(0x7a)
    4957                            .dwattr $C$DW$472, DW_AT_decl_column(0x0f)
    4958                    
    4959                    $C$DW$473       .dwtag  DW_TAG_member
    4960                            .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$19)
    4961                            .dwattr $C$DW$473, DW_AT_name("pastTrig")
    4962                            .dwattr $C$DW$473, DW_AT_TI_symbol_name("pastTrig")
    4963                            .dwattr $C$DW$473, DW_AT_bit_offset(0x00)
    4964                            .dwattr $C$DW$473, DW_AT_bit_size(0x01)
    4965                            .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4966                            .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    4967                            .dwattr $C$DW$473, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4968                            .dwattr $C$DW$473, DW_AT_decl_line(0x7b)
    4969                            .dwattr $C$DW$473, DW_AT_decl_column(0x0f)
    4970                    
    4971                            .dwattr $C$DW$T$105, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices
    4972                            .dwattr $C$DW$T$105, DW_AT_decl_line(0x76)
    4973                            .dwattr $C$DW$T$105, DW_AT_decl_column(0x0b)
    4974                            .dwendtag $C$DW$T$105
    4975                    
    4976                    
    4977                    $C$DW$T$106     .dwtag  DW_TAG_structure_type
    4978                            .dwattr $C$DW$T$106, DW_AT_byte_size(0x01)
    4979                    $C$DW$474       .dwtag  DW_TAG_member
    4980                            .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$19)
    4981                            .dwattr $C$DW$474, DW_AT_name("rule")
    4982                            .dwattr $C$DW$474, DW_AT_TI_symbol_name("rule")
    4983                            .dwattr $C$DW$474, DW_AT_bit_offset(0x04)
    4984                            .dwattr $C$DW$474, DW_AT_bit_size(0x04)
    4985                            .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4986                            .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    4987                            .dwattr $C$DW$474, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_1_50_00_08/source/ti/devices/c
    4988                            .dwattr $C$DW$474, DW_AT_decl_line(0x7f)
    4989                            .dwattr $C$DW$474, DW_AT_decl_column(0x0f)
    4990                    
    4991                    $C$DW$475       .dwtag  DW_TAG_member
    4992                            .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$19)
    4993                            .dwattr $C$DW$475, DW_AT_name("nSkip")
    4994                            .dwattr $C$DW$475, DW_AT_TI_symbol_name("nSkip")
    4995                            .dwattr $C$DW$475, DW_AT_bit_offset(0x00)
